{
  "fetched_at": "2025-11-08T11:49:36.957248",
  "total_papers": 100,
  "papers": [
    {
      "id": "2511.04681v1",
      "title": "Dark Energy Survey Year 3 results: Simulation-based $w$CDM inference from weak lensing and galaxy clustering maps with deep learning. I. Analysis design",
      "authors": [
        "A. Thomsen",
        "J. Bucko",
        "T. Kacprzak",
        "V. Ajani",
        "J. Fluri",
        "A. Refregier",
        "D. Anbajagane",
        "F. J. Castander",
        "A. Ferté",
        "M. Gatti",
        "N. Jeffrey",
        "A. Alarcon",
        "A. Amon",
        "K. Bechtol",
        "M. R. Becker",
        "G. M. Bernstein",
        "A. Campos",
        "A. Carnero Rosell",
        "C. Chang",
        "R. Chen",
        "A. Choi",
        "M. Crocce",
        "C. Davis",
        "J. DeRose",
        "S. Dodelson",
        "C. Doux",
        "K. Eckert",
        "J. Elvin-Poole",
        "S. Everett",
        "P. Fosalba",
        "D. Gruen",
        "I. Harrison",
        "K. Herner",
        "E. M. Huff",
        "M. Jarvis",
        "N. Kuropatkin",
        "P. -F. Leget",
        "N. MacCrann",
        "J. McCullough",
        "J. Myles",
        "A. Navarro-Alsina",
        "S. Pandey",
        "A. Porredon",
        "J. Prat",
        "M. Raveri",
        "M. Rodriguez-Monroy",
        "R. P. Rollins",
        "A. Roodman",
        "E. S. Rykoff",
        "C. Sánchez",
        "L. F. Secco",
        "E. Sheldon",
        "T. Shin",
        "M. A. Troxel",
        "I. Tutusaus",
        "T. N. Varga",
        "N. Weaverdyck",
        "R. H. Wechsler",
        "B. Yanny",
        "B. Yin",
        "Y. Zhang",
        "J. Zuntz",
        "S. Allam",
        "F. Andrade-Oliveira",
        "D. Bacon",
        "J. Blazek",
        "D. Brooks",
        "R. Camilleri",
        "J. Carretero",
        "R. Cawthon",
        "L. N. da Costa",
        "M. E. da Silva Pereira",
        "T. M. Davis",
        "J. De Vicente",
        "S. Desai",
        "P. Doel",
        "J. García-Bellido",
        "G. Gutierrez",
        "S. R. Hinton",
        "D. L. Hollowood",
        "K. Honscheid",
        "D. J. James",
        "K. Kuehn",
        "O. Lahav",
        "S. Lee",
        "J. L. Marshall",
        "J. Mena-Fernández",
        "F. Menanteau",
        "R. Miquel",
        "J. Muir",
        "R. L. C. Ogando",
        "A. A. Plazas Malagón",
        "E. Sanchez",
        "D. Sanchez Cid",
        "I. Sevilla-Noarbe",
        "M. Smith",
        "E. Suchyta",
        "M. E. C. Swanson",
        "D. Thomas",
        "C. To",
        "D. L. Tucker"
      ],
      "abstract": "Data-driven approaches using deep learning are emerging as powerful\ntechniques to extract non-Gaussian information from cosmological large-scale\nstructure. This work presents the first simulation-based inference (SBI)\npipeline that combines weak lensing and galaxy clustering maps in a realistic\nDark Energy Survey Year 3 (DES Y3) configuration and serves as preparation for\na forthcoming analysis of the survey data. We develop a scalable forward model\nbased on the CosmoGridV1 suite of N-body simulations to generate over one\nmillion self-consistent mock realizations of DES Y3 at the map level.\nLeveraging this large dataset, we train deep graph convolutional neural\nnetworks on the full survey footprint in spherical geometry to learn\nlow-dimensional features that approximately maximize mutual information with\ntarget parameters. These learned compressions enable neural density estimation\nof the implicit likelihood via normalizing flows in a ten-dimensional parameter\nspace spanning cosmological $w$CDM, intrinsic alignment, and linear galaxy bias\nparameters, while marginalizing over baryonic, photometric redshift, and shear\nbias nuisances. To ensure robustness, we extensively validate our inference\npipeline using synthetic observations derived from both systematic\ncontaminations in our forward model and independent Buzzard galaxy catalogs.\nOur forecasts yield significant improvements in cosmological parameter\nconstraints, achieving $2-3\\times$ higher figures of merit in the $\\Omega_m -\nS_8$ plane relative to our implementation of baseline two-point statistics and\neffectively breaking parameter degeneracies through probe combination. These\nresults demonstrate the potential of SBI analyses powered by deep learning for\nupcoming Stage-IV wide-field imaging surveys.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "astro-ph.CO",
        "cs.LG"
      ],
      "primary_category": "astro-ph.CO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04681v1",
        "pdf": "http://arxiv.org/pdf/2511.04681v1"
      },
      "arxiv_id": "2511.04681v1",
      "comment": "38 pages, 14 figures, submitted",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04680v1",
      "title": "Carousel: A High-Resolution Dataset for Multi-Target Automatic Image Cropping",
      "authors": [
        "Rafe Loya",
        "Andrew Hamara",
        "Benjamin Estell",
        "Benjamin Kilpatrick",
        "Andrew C. Freeman"
      ],
      "abstract": "Automatic image cropping is a method for maximizing the human-perceived\nquality of cropped regions in photographs. Although several works have proposed\ntechniques for producing singular crops, little work has addressed the problem\nof producing multiple, distinct crops with aesthetic appeal. In this paper, we\nmotivate the problem with a discussion on modern social media applications,\nintroduce a dataset of 277 relevant images and human labels, and evaluate the\nefficacy of several single-crop models with an image partitioning algorithm as\na pre-processing step. The dataset is available at\nhttps://github.com/RafeLoya/carousel.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04680v1",
        "pdf": "http://arxiv.org/pdf/2511.04680v1"
      },
      "arxiv_id": "2511.04680v1",
      "comment": "Accepted to the Datasets track of VCIP 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04679v1",
      "title": "GentleHumanoid: Learning Upper-body Compliance for Contact-rich Human and Object Interaction",
      "authors": [
        "Qingzhou Lu",
        "Yao Feng",
        "Baiyu Shi",
        "Michael Piseno",
        "Zhenan Bao",
        "C. Karen Liu"
      ],
      "abstract": "Humanoid robots are expected to operate in human-centered environments where\nsafe and natural physical interaction is essential. However, most recent\nreinforcement learning (RL) policies emphasize rigid tracking and suppress\nexternal forces. Existing impedance-augmented approaches are typically\nrestricted to base or end-effector control and focus on resisting extreme\nforces rather than enabling compliance. We introduce GentleHumanoid, a\nframework that integrates impedance control into a whole-body motion tracking\npolicy to achieve upper-body compliance. At its core is a unified spring-based\nformulation that models both resistive contacts (restoring forces when pressing\nagainst surfaces) and guiding contacts (pushes or pulls sampled from human\nmotion data). This formulation ensures kinematically consistent forces across\nthe shoulder, elbow, and wrist, while exposing the policy to diverse\ninteraction scenarios. Safety is further supported through task-adjustable\nforce thresholds. We evaluate our approach in both simulation and on the\nUnitree G1 humanoid across tasks requiring different levels of compliance,\nincluding gentle hugging, sit-to-stand assistance, and safe object\nmanipulation. Compared to baselines, our policy consistently reduces peak\ncontact forces while maintaining task success, resulting in smoother and more\nnatural interactions. These results highlight a step toward humanoid robots\nthat can safely and effectively collaborate with humans and handle objects in\nreal-world environments.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.RO",
        "cs.CV",
        "cs.HC"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04679v1",
        "pdf": "http://arxiv.org/pdf/2511.04679v1"
      },
      "arxiv_id": "2511.04679v1",
      "comment": "Home page: https://gentle-humanoid.axell.top",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04678v1",
      "title": "Tracking and Understanding Object Transformations",
      "authors": [
        "Yihong Sun",
        "Xinyu Yang",
        "Jennifer J. Sun",
        "Bharath Hariharan"
      ],
      "abstract": "Real-world objects frequently undergo state transformations. From an apple\nbeing cut into pieces to a butterfly emerging from its cocoon, tracking through\nthese changes is important for understanding real-world objects and dynamics.\nHowever, existing methods often lose track of the target object after\ntransformation, due to significant changes in object appearance. To address\nthis limitation, we introduce the task of Track Any State: tracking objects\nthrough transformations while detecting and describing state changes,\naccompanied by a new benchmark dataset, VOST-TAS. To tackle this problem, we\npresent TubeletGraph, a zero-shot system that recovers missing objects after\ntransformation and maps out how object states are evolving over time.\nTubeletGraph first identifies potentially overlooked tracks, and determines\nwhether they should be integrated based on semantic and proximity priors. Then,\nit reasons about the added tracks and generates a state graph describing each\nobserved transformation. TubeletGraph achieves state-of-the-art tracking\nperformance under transformations, while demonstrating deeper understanding of\nobject transformations and promising capabilities in temporal grounding and\nsemantic reasoning for complex object transformations. Code, additional\nresults, and the benchmark dataset are available at\nhttps://tubelet-graph.github.io.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04678v1",
        "pdf": "http://arxiv.org/pdf/2511.04678v1"
      },
      "arxiv_id": "2511.04678v1",
      "comment": "NeurIPS 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04675v1",
      "title": "InfinityStar: Unified Spacetime AutoRegressive Modeling for Visual Generation",
      "authors": [
        "Jinlai Liu",
        "Jian Han",
        "Bin Yan",
        "Hui Wu",
        "Fengda Zhu",
        "Xing Wang",
        "Yi Jiang",
        "Bingyue Peng",
        "Zehuan Yuan"
      ],
      "abstract": "We introduce InfinityStar, a unified spacetime autoregressive framework for\nhigh-resolution image and dynamic video synthesis. Building on the recent\nsuccess of autoregressive modeling in both vision and language, our purely\ndiscrete approach jointly captures spatial and temporal dependencies within a\nsingle architecture. This unified design naturally supports a variety of\ngeneration tasks such as text-to-image, text-to-video, image-to-video, and long\ninteractive video synthesis via straightforward temporal autoregression.\nExtensive experiments demonstrate that InfinityStar scores 83.74 on VBench,\noutperforming all autoregressive models by large margins, even surpassing some\ndiffusion competitors like HunyuanVideo. Without extra optimizations, our model\ngenerates a 5s, 720p video approximately 10x faster than leading\ndiffusion-based methods. To our knowledge, InfinityStar is the first discrete\nautoregressive video generator capable of producing industrial level 720p\nvideos. We release all code and models to foster further research in efficient,\nhigh-quality video generation.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04675v1",
        "pdf": "http://arxiv.org/pdf/2511.04675v1"
      },
      "arxiv_id": "2511.04675v1",
      "comment": "NeurIPS 2025 Oral",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04671v1",
      "title": "X-Diffusion: Training Diffusion Policies on Cross-Embodiment Human Demonstrations",
      "authors": [
        "Maximus A. Pace",
        "Prithwish Dan",
        "Chuanruo Ning",
        "Atiksh Bhardwaj",
        "Audrey Du",
        "Edward W. Duan",
        "Wei-Chiu Ma",
        "Kushal Kedia"
      ],
      "abstract": "Human videos can be recorded quickly and at scale, making them an appealing\nsource of training data for robot learning. However, humans and robots differ\nfundamentally in embodiment, resulting in mismatched action execution. Direct\nkinematic retargeting of human hand motion can therefore produce actions that\nare physically infeasible for robots. Despite these low-level differences,\nhuman demonstrations provide valuable motion cues about how to manipulate and\ninteract with objects. Our key idea is to exploit the forward diffusion\nprocess: as noise is added to actions, low-level execution differences fade\nwhile high-level task guidance is preserved. We present X-Diffusion, a\nprincipled framework for training diffusion policies that maximally leverages\nhuman data without learning dynamically infeasible motions. X-Diffusion first\ntrains a classifier to predict whether a noisy action is executed by a human or\nrobot. Then, a human action is incorporated into policy training only after\nadding sufficient noise such that the classifier cannot discern its embodiment.\nActions consistent with robot execution supervise fine-grained denoising at low\nnoise levels, while mismatched human actions provide only coarse guidance at\nhigher noise levels. Our experiments show that naive co-training under\nexecution mismatches degrades policy performance, while X-Diffusion\nconsistently improves it. Across five manipulation tasks, X-Diffusion achieves\na 16% higher average success rate than the best baseline. The project website\nis available at https://portal-cornell.github.io/X-Diffusion/.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.CV"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04671v1",
        "pdf": "http://arxiv.org/pdf/2511.04671v1"
      },
      "arxiv_id": "2511.04671v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04670v1",
      "title": "Cambrian-S: Towards Spatial Supersensing in Video",
      "authors": [
        "Shusheng Yang",
        "Jihan Yang",
        "Pinzhi Huang",
        "Ellis Brown",
        "Zihao Yang",
        "Yue Yu",
        "Shengbang Tong",
        "Zihan Zheng",
        "Yifan Xu",
        "Muhan Wang",
        "Daohan Lu",
        "Rob Fergus",
        "Yann LeCun",
        "Li Fei-Fei",
        "Saining Xie"
      ],
      "abstract": "We argue that progress in true multimodal intelligence calls for a shift from\nreactive, task-driven systems and brute-force long context towards a broader\nparadigm of supersensing. We frame spatial supersensing as four stages beyond\nlinguistic-only understanding: semantic perception (naming what is seen),\nstreaming event cognition (maintaining memory across continuous experiences),\nimplicit 3D spatial cognition (inferring the world behind pixels), and\npredictive world modeling (creating internal models that filter and organize\ninformation). Current benchmarks largely test only the early stages, offering\nnarrow coverage of spatial cognition and rarely challenging models in ways that\nrequire true world modeling. To drive progress in spatial supersensing, we\npresent VSI-SUPER, a two-part benchmark: VSR (long-horizon visual spatial\nrecall) and VSC (continual visual spatial counting). These tasks require\narbitrarily long video inputs yet are resistant to brute-force context\nexpansion. We then test data scaling limits by curating VSI-590K and training\nCambrian-S, achieving +30% absolute improvement on VSI-Bench without\nsacrificing general capabilities. Yet performance on VSI-SUPER remains limited,\nindicating that scale alone is insufficient for spatial supersensing. We\npropose predictive sensing as a path forward, presenting a proof-of-concept in\nwhich a self-supervised next-latent-frame predictor leverages surprise\n(prediction error) to drive memory and event segmentation. On VSI-SUPER, this\napproach substantially outperforms leading proprietary baselines, showing that\nspatial supersensing requires models that not only see but also anticipate,\nselect, and organize experience.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04670v1",
        "pdf": "http://arxiv.org/pdf/2511.04670v1"
      },
      "arxiv_id": "2511.04670v1",
      "comment": "Website: https://cambrian-mllm.github.io/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.04668v1",
      "title": "SIMS-V: Simulated Instruction-Tuning for Spatial Video Understanding",
      "authors": [
        "Ellis Brown",
        "Arijit Ray",
        "Ranjay Krishna",
        "Ross Girshick",
        "Rob Fergus",
        "Saining Xie"
      ],
      "abstract": "Despite impressive high-level video comprehension, multimodal language models\nstruggle with spatial reasoning across time and space. While current spatial\ntraining approaches rely on real-world video data, obtaining diverse footage\nwith precise spatial annotations remains a bottleneck. To alleviate this\nbottleneck, we present SIMS-V -- a systematic data-generation framework that\nleverages the privileged information of 3D simulators to create spatially-rich\nvideo training data for multimodal language models. Using this framework, we\ninvestigate which properties of simulated data drive effective real-world\ntransfer through systematic ablations of question types, mixes, and scales. We\nidentify a minimal set of three question categories (metric measurement,\nperspective-dependent reasoning, and temporal tracking) that prove most\neffective for developing transferable spatial intelligence, outperforming\ncomprehensive coverage despite using fewer question types. These insights\nenable highly efficient training: our 7B-parameter video LLM fine-tuned on just\n25K simulated examples outperforms the larger 72B baseline and achieves\ncompetitive performance with proprietary models on rigorous real-world spatial\nreasoning benchmarks. Our approach demonstrates robust generalization,\nmaintaining performance on general video understanding while showing\nsubstantial improvements on embodied and real-world spatial tasks.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04668v1",
        "pdf": "http://arxiv.org/pdf/2511.04668v1"
      },
      "arxiv_id": "2511.04668v1",
      "comment": "Project page: https://ellisbrown.github.io/sims-v",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.04667v1",
      "title": "Multi-Method Analysis of Mathematics Placement Assessments: Classical, Machine Learning, and Clustering Approaches",
      "authors": [
        "Julian D. Allagan",
        "Dasia A. Singleton",
        "Shanae N. Perry",
        "Gabrielle C. Morgan",
        "Essence A. Morgan"
      ],
      "abstract": "This study evaluates a 40-item mathematics placement examination administered\nto 198 students using a multi-method framework combining Classical Test Theory,\nmachine learning, and unsupervised clustering. Classical Test Theory analysis\nreveals that 55\\% of items achieve excellent discrimination ($D \\geq 0.40$)\nwhile 30\\% demonstrate poor discrimination ($D < 0.20$) requiring replacement.\nQuestion 6 (Graph Interpretation) emerges as the examination's most powerful\ndiscriminator, achieving perfect discrimination ($D = 1.000$), highest ANOVA\nF-statistic ($F = 4609.1$), and maximum Random Forest feature importance\n(0.206), accounting for 20.6\\% of predictive power. Machine learning algorithms\ndemonstrate exceptional performance, with Random Forest and Gradient Boosting\nachieving 97.5\\% and 96.0\\% cross-validation accuracy. K-means clustering\nidentifies a natural binary competency structure with a boundary at 42.5\\%,\ndiverging from the institutional threshold of 55\\% and suggesting potential\noverclassification into remedial categories. The two-cluster solution exhibits\nexceptional stability (bootstrap ARI = 0.855) with perfect lower-cluster\npurity. Convergent evidence across methods supports specific refinements:\nreplace poorly discriminating items, implement a two-stage assessment, and\nintegrate Random Forest predictions with transparency mechanisms. These\nfindings demonstrate that multi-method integration provides a robust empirical\nfoundation for evidence-based mathematics placement optimization.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "97C70, 62P25, 62H30, 68T05"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04667v1",
        "pdf": "http://arxiv.org/pdf/2511.04667v1"
      },
      "arxiv_id": "2511.04667v1",
      "comment": "28 pages, 8 table, 4figures, NAM conference",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04666v1",
      "title": "Forgetting is Everywhere",
      "authors": [
        "Ben Sanati",
        "Thomas L. Lee",
        "Trevor McInroe",
        "Aidan Scannell",
        "Nikolay Malkin",
        "David Abel",
        "Amos Storkey"
      ],
      "abstract": "A fundamental challenge in developing general learning algorithms is their\ntendency to forget past knowledge when adapting to new data. Addressing this\nproblem requires a principled understanding of forgetting; yet, despite decades\nof study, no unified definition has emerged that provides insights into the\nunderlying dynamics of learning. We propose an algorithm- and task-agnostic\ntheory that characterises forgetting as a lack of self-consistency in a\nlearner's predictive distribution over future experiences, manifesting as a\nloss of predictive information. Our theory naturally yields a general measure\nof an algorithm's propensity to forget. To validate the theory, we design a\ncomprehensive set of experiments that span classification, regression,\ngenerative modelling, and reinforcement learning. We empirically demonstrate\nhow forgetting is present across all learning settings and plays a significant\nrole in determining learning efficiency. Together, these results establish a\nprincipled understanding of forgetting and lay the foundation for analysing and\nimproving the information retention capabilities of general learning\nalgorithms.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04666v1",
        "pdf": "http://arxiv.org/pdf/2511.04666v1"
      },
      "arxiv_id": "2511.04666v1",
      "comment": "Project page:\n  https://ben-sanati.github.io/forgetting-is-everywhere-project/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.04665v1",
      "title": "Real-to-Sim Robot Policy Evaluation with Gaussian Splatting Simulation of Soft-Body Interactions",
      "authors": [
        "Kaifeng Zhang",
        "Shuo Sha",
        "Hanxiao Jiang",
        "Matthew Loper",
        "Hyunjong Song",
        "Guangyan Cai",
        "Zhuo Xu",
        "Xiaochen Hu",
        "Changxi Zheng",
        "Yunzhu Li"
      ],
      "abstract": "Robotic manipulation policies are advancing rapidly, but their direct\nevaluation in the real world remains costly, time-consuming, and difficult to\nreproduce, particularly for tasks involving deformable objects. Simulation\nprovides a scalable and systematic alternative, yet existing simulators often\nfail to capture the coupled visual and physical complexity of soft-body\ninteractions. We present a real-to-sim policy evaluation framework that\nconstructs soft-body digital twins from real-world videos and renders robots,\nobjects, and environments with photorealistic fidelity using 3D Gaussian\nSplatting. We validate our approach on representative deformable manipulation\ntasks, including plush toy packing, rope routing, and T-block pushing,\ndemonstrating that simulated rollouts correlate strongly with real-world\nexecution performance and reveal key behavioral patterns of learned policies.\nOur results suggest that combining physics-informed reconstruction with\nhigh-quality rendering enables reproducible, scalable, and accurate evaluation\nof robotic manipulation policies. Website: https://real2sim-eval.github.io/",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.RO",
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04665v1",
        "pdf": "http://arxiv.org/pdf/2511.04665v1"
      },
      "arxiv_id": "2511.04665v1",
      "comment": "Website: https://real2sim-eval.github.io/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.04662v1",
      "title": "VeriCoT: Neuro-symbolic Chain-of-Thought Validation via Logical Consistency Checks",
      "authors": [
        "Yu Feng",
        "Nathaniel Weir",
        "Kaj Bostrom",
        "Sam Bayless",
        "Darion Cassel",
        "Sapana Chaudhary",
        "Benjamin Kiesl-Reiter",
        "Huzefa Rangwala"
      ],
      "abstract": "LLMs can perform multi-step reasoning through Chain-of-Thought (CoT), but\nthey cannot reliably verify their own logic. Even when they reach correct\nanswers, the underlying reasoning may be flawed, undermining trust in\nhigh-stakes scenarios. To mitigate this issue, we introduce VeriCoT, a\nneuro-symbolic method that extracts and verifies formal logical arguments from\nCoT reasoning. VeriCoT formalizes each CoT reasoning step into first-order\nlogic and identifies premises that ground the argument in source context,\ncommonsense knowledge, or prior reasoning steps. The symbolic representation\nenables automated solvers to verify logical validity while the NL premises\nallow humans and systems to identify ungrounded or fallacious reasoning steps.\nExperiments on the ProofWriter, LegalBench, and BioASQ datasets show VeriCoT\neffectively identifies flawed reasoning, and serves as a strong predictor of\nfinal answer correctness. We also leverage VeriCoT's verification signal for\n(1) inference-time self-reflection, (2) supervised fine-tuning (SFT) on\nVeriCoT-distilled datasets and (3) preference fine-tuning (PFT) with direct\npreference optimization (DPO) using verification-based pairwise rewards,\nfurther improving reasoning validity and accuracy.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04662v1",
        "pdf": "http://arxiv.org/pdf/2511.04662v1"
      },
      "arxiv_id": "2511.04662v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04659v1",
      "title": "Nowcast3D: Reliable precipitation nowcasting via gray-box learning",
      "authors": [
        "Huaguan Chen",
        "Wei Han",
        "Haofei Sun",
        "Ning Lin",
        "Xingtao Song",
        "Yunfan Yang",
        "Jie Tian",
        "Yang Liu",
        "Ji-Rong Wen",
        "Xiaoye Zhang",
        "Xueshun Shen",
        "Hao Sun"
      ],
      "abstract": "Extreme precipitation nowcasting demands high spatiotemporal fidelity and\nextended lead times, yet existing approaches remain limited. Numerical Weather\nPrediction (NWP) and its deep-learning emulations are too slow and coarse for\nrapidly evolving convection, while extrapolation and purely data-driven models\nsuffer from error accumulation and excessive smoothing. Hybrid 2D radar-based\nmethods discard crucial vertical information, preventing accurate\nreconstruction of height-dependent dynamics. We introduce a gray-box, fully\nthree-dimensional nowcasting framework that directly processes volumetric radar\nreflectivity and couples physically constrained neural operators with\ndatadriven learning. The model learns vertically varying 3D advection fields\nunder a conservative advection operator, parameterizes spatially varying\ndiffusion, and introduces a Brownian-motion--inspired stochastic term to\nrepresent unresolved motions. A residual branch captures small-scale convective\ninitiation and microphysical variability, while a diffusion-based stochastic\nmodule estimates uncertainty. The framework achieves more accurate forecasts up\nto three-hour lead time across precipitation regimes and ranked first in 57\\%\nof cases in a blind evaluation by 160 meteorologists. By restoring full 3D\ndynamics with physical consistency, it offers a scalable and robust pathway for\nskillful and reliable nowcasting of extreme precipitation.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "physics.ao-ph"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04659v1",
        "pdf": "http://arxiv.org/pdf/2511.04659v1"
      },
      "arxiv_id": "2511.04659v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04655v1",
      "title": "Benchmark Designers Should \"Train on the Test Set\" to Expose Exploitable Non-Visual Shortcuts",
      "authors": [
        "Ellis Brown",
        "Jihan Yang",
        "Shusheng Yang",
        "Rob Fergus",
        "Saining Xie"
      ],
      "abstract": "Robust benchmarks are crucial for evaluating Multimodal Large Language Models\n(MLLMs). Yet we find that models can ace many multimodal benchmarks without\nstrong visual understanding, instead exploiting biases, linguistic priors, and\nsuperficial patterns. This is especially problematic for vision-centric\nbenchmarks that are meant to require visual inputs. We adopt a diagnostic\nprinciple for benchmark design: if a benchmark can be gamed, it will be.\nDesigners should therefore try to ``game'' their own benchmarks first, using\ndiagnostic and debiasing procedures to systematically identify and mitigate\nnon-visual biases. Effective diagnosis requires directly ``training on the test\nset'' -- probing the released test set for its intrinsic, exploitable patterns.\n  We operationalize this standard with two components. First, we diagnose\nbenchmark susceptibility using a ``Test-set Stress-Test'' (TsT) methodology.\nOur primary diagnostic tool involves fine-tuning a powerful Large Language\nModel via $k$-fold cross-validation on exclusively the non-visual, textual\ninputs of the test set to reveal shortcut performance and assign each sample a\nbias score $s(x)$. We complement this with a lightweight Random Forest-based\ndiagnostic operating on hand-crafted features for fast, interpretable auditing.\nSecond, we debias benchmarks by filtering high-bias samples using an\n``Iterative Bias Pruning'' (IBP) procedure. Applying this framework to four\nbenchmarks -- VSI-Bench, CV-Bench, MMMU, and VideoMME -- we uncover pervasive\nnon-visual biases. As a case study, we apply our full framework to create\nVSI-Bench-Debiased, demonstrating reduced non-visual solvability and a wider\nvision-blind performance gap than the original.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04655v1",
        "pdf": "http://arxiv.org/pdf/2511.04655v1"
      },
      "arxiv_id": "2511.04655v1",
      "comment": "Project page: https://cambrian-mllm.github.io",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.04653v1",
      "title": "TT-Prune: Joint Model Pruning and Resource Allocation for Communication-efficient Time-triggered Federated Learning",
      "authors": [
        "Xinlu Zhang",
        "Yansha Deng",
        "Toktam Mahmoodi"
      ],
      "abstract": "Federated learning (FL) offers new opportunities in machine learning,\nparticularly in addressing data privacy concerns. In contrast to conventional\nevent-based federated learning, time-triggered federated learning (TT-Fed), as\na general form of both asynchronous and synchronous FL, clusters users into\ndifferent tiers based on fixed time intervals. However, the FL network consists\nof a growing number of user devices with limited wireless bandwidth,\nconsequently magnifying issues such as stragglers and communication overhead.\nIn this paper, we introduce adaptive model pruning to wireless TT-Fed systems\nand study the problem of jointly optimizing the pruning ratio and bandwidth\nallocation to minimize the training loss while ensuring minimal learning\nlatency. To answer this question, we perform convergence analysis on the\ngradient l_2 norm of the TT-Fed model based on model pruning. Based on the\nobtained convergence upper bound, a joint optimization problem of pruning ratio\nand wireless bandwidth is formulated to minimize the model training loss under\na given delay threshold. Then, we derive closed-form solutions for wireless\nbandwidth and pruning ratio using Karush-Kuhn-Tucker(KKT) conditions. The\nsimulation results show that model pruning could reduce the communication cost\nby 40% while maintaining the model performance at the same level.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04653v1",
        "pdf": "http://arxiv.org/pdf/2511.04653v1"
      },
      "arxiv_id": "2511.04653v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04652v1",
      "title": "Polarization-resolved imaging improves eye tracking",
      "authors": [
        "Mantas Žurauskas",
        "Tom Bu",
        "Sanaz Alali",
        "Beyza Kalkanli",
        "Derek Shi",
        "Fernando Alamos",
        "Gauresh Pandit",
        "Christopher Mei",
        "Ali Behrooz",
        "Ramin Mirjalili",
        "Dave Stronks",
        "Alexander Fix",
        "Dmitri Model"
      ],
      "abstract": "Polarization-resolved near-infrared imaging adds a useful optical contrast\nmechanism to eye tracking by measuring the polarization state of light\nreflected by ocular tissues in addition to its intensity. In this paper we\ndemonstrate how this contrast can be used to enable eye tracking. Specifically,\nwe demonstrate that a polarization-enabled eye tracking (PET) system composed\nof a polarization--filter--array camera paired with a linearly polarized\nnear-infrared illuminator can reveal trackable features across the sclera and\ngaze-informative patterns on the cornea, largely absent in intensity-only\nimages. Across a cohort of 346 participants, convolutional neural network based\nmachine learning models trained on data from PET reduced the median\n95th-percentile absolute gaze error by 10--16\\% relative to capacity-matched\nintensity baselines under nominal conditions and in the presence of eyelid\nocclusions, eye-relief changes, and pupil-size variation. These results link\nlight--tissue polarization effects to practical gains in human--computer\ninteraction and position PET as a simple, robust sensing modality for future\nwearable devices.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV",
        "physics.optics"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04652v1",
        "pdf": "http://arxiv.org/pdf/2511.04652v1"
      },
      "arxiv_id": "2511.04652v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04647v1",
      "title": "Optimal Inference Schedules for Masked Diffusion Models",
      "authors": [
        "Sitan Chen",
        "Kevin Cong",
        "Jerry Li"
      ],
      "abstract": "A major bottleneck of standard auto-regressive large language models is that\ntheir inference process is inherently sequential, resulting in very long and\ncostly inference times. To circumvent this, practitioners proposed a class of\nlanguage models called diffusion language models, of which the masked diffusion\nmodel (MDM) is the most successful. The MDM is able to sample tokens\nout-of-order and, ostensibly, many tokens at once and in parallel. However,\nthere is very limited rigorous understanding of how much parallel sampling\nthese models can perform without noticeable degradation in their sampling\nperformance. Prior work of Li and Cai obtained some preliminary bounds, but\nthese are not tight for many natural classes of distributions. In this work, we\ngive a new, exact characterization of the expected divergence between the true\ndistribution and the sampled distribution, for any distribution and any\nunmasking schedule for the sampler, showing an elegant connection to the theory\nof univariate function approximation.\n  By leveraging this connection, we then attain a number of novel lower and\nupper bounds for this problem. While the connection to function approximation\nin principle gives the optimal unmasking schedule for any distribution, we show\nthat it is in general impossible to compete with it without strong a priori\nknowledge of the distribution, even in seemingly benign settings. However, we\nalso demonstrate new upper bounds and new sampling schedules in terms of\nwell-studied information-theoretic properties of the base distribution, namely,\nits total correlation and dual total correlation, which show that in some\nnatural settings, one can sample in $O(log n)$ steps without any visible loss\nin performance, where $n$ is the total sequence length.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04647v1",
        "pdf": "http://arxiv.org/pdf/2511.04647v1"
      },
      "arxiv_id": "2511.04647v1",
      "comment": "33 pages, 1 figure",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04646v1",
      "title": "DR. WELL: Dynamic Reasoning and Learning with Symbolic World Model for Embodied LLM-Based Multi-Agent Collaboration",
      "authors": [
        "Narjes Nourzad",
        "Hanqing Yang",
        "Shiyu Chen",
        "Carlee Joe-Wong"
      ],
      "abstract": "Cooperative multi-agent planning requires agents to make joint decisions with\npartial information and limited communication. Coordination at the trajectory\nlevel often fails, as small deviations in timing or movement cascade into\nconflicts. Symbolic planning mitigates this challenge by raising the level of\nabstraction and providing a minimal vocabulary of actions that enable\nsynchronization and collective progress. We present DR. WELL, a decentralized\nneurosymbolic framework for cooperative multi-agent planning. Cooperation\nunfolds through a two-phase negotiation protocol: agents first propose\ncandidate roles with reasoning and then commit to a joint allocation under\nconsensus and environment constraints. After commitment, each agent\nindependently generates and executes a symbolic plan for its role without\nrevealing detailed trajectories. Plans are grounded in execution outcomes via a\nshared world model that encodes the current state and is updated as agents act.\nBy reasoning over symbolic plans rather than raw trajectories, DR. WELL avoids\nbrittle step-level alignment and enables higher-level operations that are\nreusable, synchronizable, and interpretable. Experiments on cooperative\nblock-push tasks show that agents adapt across episodes, with the dynamic world\nmodel capturing reusable patterns and improving task completion rates and\nefficiency. Experiments on cooperative block-push tasks show that our dynamic\nworld model improves task completion and efficiency through negotiation and\nself-refinement, trading a time overhead for evolving, more efficient\ncollaboration strategies.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.LG",
        "cs.MA"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04646v1",
        "pdf": "http://arxiv.org/pdf/2511.04646v1"
      },
      "arxiv_id": "2511.04646v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04641v1",
      "title": "Efficient probabilistic surrogate modeling techniques for partially-observed large-scale dynamical systems",
      "authors": [
        "Hans Harder",
        "Abhijeet Vishwasrao",
        "Luca Guastoni",
        "Ricardo Vinuesa",
        "Sebastian Peitz"
      ],
      "abstract": "This paper is concerned with probabilistic techniques for forecasting\ndynamical systems described by partial differential equations (such as, for\nexample, the Navier-Stokes equations). In particular, it is investigating and\ncomparing various extensions to the flow matching paradigm that reduce the\nnumber of sampling steps. In this regard, it compares direct distillation,\nprogressive distillation, adversarial diffusion distillation, Wasserstein GANs\nand rectified flows. Moreover, experiments are conducted on a set of\nchallenging systems. In particular, we also address the challenge of directly\npredicting 2D slices of large-scale 3D simulations, paving the way for\nefficient inflow generation for solvers.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04641v1",
        "pdf": "http://arxiv.org/pdf/2511.04641v1"
      },
      "arxiv_id": "2511.04641v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04638v1",
      "title": "Addressing divergent representations from causal interventions on neural networks",
      "authors": [
        "Satchel Grant",
        "Simon Jerome Han",
        "Alexa Tartaglini",
        "Christopher Potts"
      ],
      "abstract": "A common approach to mechanistic interpretability is to causally manipulate\nmodel representations via targeted interventions in order to understand what\nthose representations encode. Here we ask whether such interventions create\nout-of-distribution (divergent) representations, and whether this raises\nconcerns about how faithful their resulting explanations are to the target\nmodel in its natural state. First, we demonstrate empirically that common\ncausal intervention techniques often do shift internal representations away\nfrom the natural distribution of the target model. Then, we provide a\ntheoretical analysis of two classes of such divergences: `harmless' divergences\nthat occur in the null-space of the weights and from covariance within\nbehavioral decision boundaries, and `pernicious' divergences that activate\nhidden network pathways and cause dormant behavioral changes. Finally, in an\neffort to mitigate the pernicious cases, we modify the Counterfactual Latent\n(CL) loss from Grant (2025) that regularizes interventions to remain closer to\nthe natural distributions, reducing the likelihood of harmful divergences while\npreserving the interpretive power of interventions. Together, these results\nhighlight a path towards more reliable interpretability methods.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04638v1",
        "pdf": "http://arxiv.org/pdf/2511.04638v1"
      },
      "arxiv_id": "2511.04638v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04628v1",
      "title": "NovisVQ: A Streaming Convolutional Neural Network for No-Reference Opinion-Unaware Frame Quality Assessment",
      "authors": [
        "Kylie Cancilla",
        "Alexander Moore",
        "Amar Saini",
        "Carmen Carrano"
      ],
      "abstract": "Video quality assessment (VQA) is vital for computer vision tasks, but\nexisting approaches face major limitations: full-reference (FR) metrics require\nclean reference videos, and most no-reference (NR) models depend on training on\ncostly human opinion labels. Moreover, most opinion-unaware NR methods are\nimage-based, ignoring temporal context critical for video object detection. In\nthis work, we present a scalable, streaming-based VQA model that is both\nno-reference and opinion-unaware. Our model leverages synthetic degradations of\nthe DAVIS dataset, training a temporal-aware convolutional architecture to\npredict FR metrics (LPIPS , PSNR, SSIM) directly from degraded video, without\nreferences at inference. We show that our streaming approach outperforms our\nown image-based baseline by generalizing across diverse degradations,\nunderscoring the value of temporal modeling for scalable VQA in real-world\nvision systems. Additionally, we demonstrate that our model achieves higher\ncorrelation with full-reference metrics compared to BRISQUE, a widely-used\nopinion-aware image quality assessment baseline, validating the effectiveness\nof our temporal, opinion-unaware approach.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04628v1",
        "pdf": "http://arxiv.org/pdf/2511.04628v1"
      },
      "arxiv_id": "2511.04628v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04622v1",
      "title": "ODE approximation for the Adam algorithm: General and overparametrized setting",
      "authors": [
        "Steffen Dereich",
        "Arnulf Jentzen",
        "Sebastian Kassing"
      ],
      "abstract": "The Adam optimizer is currently presumably the most popular optimization\nmethod in deep learning. In this article we develop an ODE based method to\nstudy the Adam optimizer in a fast-slow scaling regime. For fixed momentum\nparameters and vanishing step-sizes, we show that the Adam algorithm is an\nasymptotic pseudo-trajectory of the flow of a particular vector field, which is\nreferred to as the Adam vector field. Leveraging properties of asymptotic\npseudo-trajectories, we establish convergence results for the Adam algorithm.\nIn particular, in a very general setting we show that if the Adam algorithm\nconverges, then the limit must be a zero of the Adam vector field, rather than\na local minimizer or critical point of the objective function.\n  In contrast, in the overparametrized empirical risk minimization setting, the\nAdam algorithm is able to locally find the set of minima. Specifically, we show\nthat in a neighborhood of the global minima, the objective function serves as a\nLyapunov function for the flow induced by the Adam vector field. As a\nconsequence, if the Adam algorithm enters a neighborhood of the global minima\ninfinitely often, it converges to the set of global minima.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "math.OC",
        "cs.LG",
        "math.PR"
      ],
      "primary_category": "math.OC",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04622v1",
        "pdf": "http://arxiv.org/pdf/2511.04622v1"
      },
      "arxiv_id": "2511.04622v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04619v1",
      "title": "Dynamic causal discovery in Alzheimer's disease through latent pseudotime modelling",
      "authors": [
        "Natalia Glazman",
        "Jyoti Mangal",
        "Pedro Borges",
        "Sebastien Ourselin",
        "M. Jorge Cardoso"
      ],
      "abstract": "The application of causal discovery to diseases like Alzheimer's (AD) is\nlimited by the static graph assumptions of most methods; such models cannot\naccount for an evolving pathophysiology, modulated by a latent disease\npseudotime. We propose to apply an existing latent variable model to real-world\nAD data, inferring a pseudotime that orders patients along a data-driven\ndisease trajectory independent of chronological age, then learning how causal\nrelationships evolve. Pseudotime outperformed age in predicting diagnosis (AUC\n0.82 vs 0.59). Incorporating minimal, disease-agnostic background knowledge\nsubstantially improved graph accuracy and orientation. Our framework reveals\ndynamic interactions between novel (NfL, GFAP) and established AD markers,\nenabling practical causal discovery despite violated assumptions.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "stat.AP",
        "cs.CE",
        "cs.LG"
      ],
      "primary_category": "stat.AP",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04619v1",
        "pdf": "http://arxiv.org/pdf/2511.04619v1"
      },
      "arxiv_id": "2511.04619v1",
      "comment": "Accepted to the NeurIPS 2025 Workshop on CauScien: Uncovering\n  Causality in Science",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04615v1",
      "title": "Building Trust in Virtual Immunohistochemistry: Automated Assessment of Image Quality",
      "authors": [
        "Tushar Kataria",
        "Shikha Dubey",
        "Mary Bronner",
        "Jolanta Jedrzkiewicz",
        "Ben J. Brintz",
        "Shireen Y. Elhabian",
        "Beatrice S. Knudsen"
      ],
      "abstract": "Deep learning models can generate virtual immunohistochemistry (IHC) stains\nfrom hematoxylin and eosin (H&E) images, offering a scalable and low-cost\nalternative to laboratory IHC. However, reliable evaluation of image quality\nremains a challenge as current texture- and distribution-based metrics quantify\nimage fidelity rather than the accuracy of IHC staining. Here, we introduce an\nautomated and accuracy grounded framework to determine image quality across\nsixteen paired or unpaired image translation models. Using color deconvolution,\nwe generate masks of pixels stained brown (i.e., IHC-positive) as predicted by\neach virtual IHC model. We use the segmented masks of real and virtual IHC to\ncompute stain accuracy metrics (Dice, IoU, Hausdorff distance) that directly\nquantify correct pixel - level labeling without needing expert manual\nannotations. Our results demonstrate that conventional image fidelity metrics,\nincluding Frechet Inception Distance (FID), peak signal-to-noise ratio (PSNR),\nand structural similarity (SSIM), correlate poorly with stain accuracy and\npathologist assessment. Paired models such as PyramidPix2Pix and AdaptiveNCE\nachieve the highest stain accuracy, whereas unpaired diffusion- and GAN-based\nmodels are less reliable in providing accurate IHC positive pixel labels.\nMoreover, whole-slide images (WSI) reveal performance declines that are\ninvisible in patch-based evaluations, emphasizing the need for WSI-level\nbenchmarks. Together, this framework defines a reproducible approach for\nassessing the quality of virtual IHC models, a critical step to accelerate\ntranslation towards routine use by pathologists.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04615v1",
        "pdf": "http://arxiv.org/pdf/2511.04615v1"
      },
      "arxiv_id": "2511.04615v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04611v1",
      "title": "evomap: A Toolbox for Dynamic Mapping in Python",
      "authors": [
        "Maximilian Matthe"
      ],
      "abstract": "This paper presents evomap, a Python package for dynamic mapping. Mapping\nmethods are widely used across disciplines to visualize relationships among\nobjects as spatial representations, or maps. However, most existing statistical\nsoftware supports only static mapping, which captures objects' relationships at\na single point in time and lacks tools to analyze how these relationships\nevolve. evomap fills this gap by implementing the dynamic mapping framework\nEvoMap, originally proposed by Matthe, Ringel, and Skiera (2023), which adapts\ntraditional static mapping methods for dynamic analyses. The package supports\nmultiple mapping techniques, including variants of Multidimensional Scaling\n(MDS), Sammon Mapping, and t-distributed Stochastic Neighbor Embedding (t-SNE).\nIt also includes utilities for data preprocessing, exploration, and result\nevaluation, offering a comprehensive toolkit for dynamic mapping applications.\nThis paper outlines the foundations of static and dynamic mapping, describes\nthe architecture and functionality of evomap, and illustrates its application\nthrough an extensive usage example.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.MS",
        "cs.LG",
        "cs.SE"
      ],
      "primary_category": "cs.MS",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04611v1",
        "pdf": "http://arxiv.org/pdf/2511.04611v1"
      },
      "arxiv_id": "2511.04611v1",
      "comment": "Accepted for publication by the Journal of Statistical Software",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04601v1",
      "title": "PixCLIP: Achieving Fine-grained Visual Language Understanding via Any-granularity Pixel-Text Alignment Learning",
      "authors": [
        "Yicheng Xiao",
        "Yu Chen",
        "Haoxuan Ma",
        "Jiale Hong",
        "Caorui Li",
        "Lingxiang Wu",
        "Haiyun Guo",
        "Jinqiao Wang"
      ],
      "abstract": "While the Contrastive Language-Image Pretraining(CLIP) model has achieved\nremarkable success in a variety of downstream vison language understanding\ntasks, enhancing its capability for fine-grained image-text alignment remains\nan active research focus. To this end, most existing works adopt the strategy\nof explicitly increasing the granularity of visual information processing,\ne.g., incorporating visual prompts to guide the model focus on specific local\nregions within the image. Meanwhile, researches on Multimodal Large Language\nModels(MLLMs) have demonstrated that training with long and detailed textual\ndescriptions can effectively improve the model's fine-grained vision-language\nalignment. However, the inherent token length limitation of CLIP's text encoder\nfundamentally limits CLIP to process more granular textual information embedded\nin long text sequences. To synergistically leverage the advantages of enhancing\nboth visual and textual content processing granularity, we propose PixCLIP, a\nnovel framework designed to concurrently accommodate visual prompt inputs and\nprocess lengthy textual descriptions. Specifically, we first establish an\nautomated annotation pipeline capable of generating pixel-level localized,\nlong-form textual descriptions for images. Utilizing this pipeline, we\nconstruct LongGRIT, a high-quality dataset comprising nearly 1.5 million\nsamples. Secondly, we replace CLIP's original text encoder with the LLM and\npropose a three-branch pixel-text alignment learning framework, facilitating\nfine-grained alignment between image regions and corresponding textual\ndescriptions at arbitrary granularity. Experiments demonstrate that PixCLIP\nshowcases breakthroughs in pixel-level interaction and handling long-form\ntexts, achieving state-of-the-art performance.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV",
        "cs.MM"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04601v1",
        "pdf": "http://arxiv.org/pdf/2511.04601v1"
      },
      "arxiv_id": "2511.04601v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04598v1",
      "title": "Environment Agnostic Goal-Conditioning, A Study of Reward-Free Autonomous Learning",
      "authors": [
        "Hampus Åström",
        "Elin Anna Topp",
        "Jacek Malec"
      ],
      "abstract": "In this paper we study how transforming regular reinforcement learning\nenvironments into goal-conditioned environments can let agents learn to solve\ntasks autonomously and reward-free. We show that an agent can learn to solve\ntasks by selecting its own goals in an environment-agnostic way, at training\ntimes comparable to externally guided reinforcement learning. Our method is\nindependent of the underlying off-policy learning algorithm. Since our method\nis environment-agnostic, the agent does not value any goals higher than others,\nleading to instability in performance for individual goals. However, in our\nexperiments, we show that the average goal success rate improves and\nstabilizes. An agent trained with this method can be instructed to seek any\nobservations made in the environment, enabling generic training of agents prior\nto specific use cases.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04598v1",
        "pdf": "http://arxiv.org/pdf/2511.04598v1"
      },
      "arxiv_id": "2511.04598v1",
      "comment": "8 pages without cover, references and supplementary materials, 11\n  with. Submitted to RLC 2025's workshop RLBrew and IMOL 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04595v1",
      "title": "UniSplat: Unified Spatio-Temporal Fusion via 3D Latent Scaffolds for Dynamic Driving Scene Reconstruction",
      "authors": [
        "Chen Shi",
        "Shaoshuai Shi",
        "Xiaoyang Lyu",
        "Chunyang Liu",
        "Kehua Sheng",
        "Bo Zhang",
        "Li Jiang"
      ],
      "abstract": "Feed-forward 3D reconstruction for autonomous driving has advanced rapidly,\nyet existing methods struggle with the joint challenges of sparse,\nnon-overlapping camera views and complex scene dynamics. We present UniSplat, a\ngeneral feed-forward framework that learns robust dynamic scene reconstruction\nthrough unified latent spatio-temporal fusion. UniSplat constructs a 3D latent\nscaffold, a structured representation that captures geometric and semantic\nscene context by leveraging pretrained foundation models. To effectively\nintegrate information across spatial views and temporal frames, we introduce an\nefficient fusion mechanism that operates directly within the 3D scaffold,\nenabling consistent spatio-temporal alignment. To ensure complete and detailed\nreconstructions, we design a dual-branch decoder that generates dynamic-aware\nGaussians from the fused scaffold by combining point-anchored refinement with\nvoxel-based generation, and maintain a persistent memory of static Gaussians to\nenable streaming scene completion beyond current camera coverage. Extensive\nexperiments on real-world datasets demonstrate that UniSplat achieves\nstate-of-the-art performance in novel view synthesis, while providing robust\nand high-quality renderings even for viewpoints outside the original camera\ncoverage.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04595v1",
        "pdf": "http://arxiv.org/pdf/2511.04595v1"
      },
      "arxiv_id": "2511.04595v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04594v1",
      "title": "Regret Lower Bounds for Decentralized Multi-Agent Stochastic Shortest Path Problems",
      "authors": [
        "Utkarsh U. Chavan",
        "Prashant Trivedi",
        "Nandyala Hemachandra"
      ],
      "abstract": "Multi-agent systems (MAS) are central to applications such as swarm robotics\nand traffic routing, where agents must coordinate in a decentralized manner to\nachieve a common objective. Stochastic Shortest Path (SSP) problems provide a\nnatural framework for modeling decentralized control in such settings. While\nthe problem of learning in SSP has been extensively studied in single-agent\nsettings, the decentralized multi-agent variant remains largely unexplored. In\nthis work, we take a step towards addressing that gap. We study decentralized\nmulti-agent SSPs (Dec-MASSPs) under linear function approximation, where the\ntransition dynamics and costs are represented using linear models. Applying\nnovel symmetry-based arguments, we identify the structure of optimal policies.\nOur main contribution is the first regret lower bound for this setting based on\nthe construction of hard-to-learn instances for any number of agents, $n$. Our\nregret lower bound of $\\Omega(\\sqrt{K})$, over $K$ episodes, highlights the\ninherent learning difficulty in Dec-MASSPs. These insights clarify the learning\ncomplexity of decentralized control and can further guide the design of\nefficient learning algorithms in multi-agent systems.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.MA"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04594v1",
        "pdf": "http://arxiv.org/pdf/2511.04594v1"
      },
      "arxiv_id": "2511.04594v1",
      "comment": "To appear in 39th Conference on Neural Information Processing Systems\n  (NeurIPS 2025)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04590v1",
      "title": "Complexity as Advantage: A Regret-Based Perspective on Emergent Structure",
      "authors": [
        "Oshri Naparstek"
      ],
      "abstract": "We introduce Complexity as Advantage (CAA), a framework that defines the\ncomplexity of a system relative to a family of observers. Instead of measuring\ncomplexity as an intrinsic property, we evaluate how much predictive regret a\nsystem induces for different observers attempting to model it. A system is\ncomplex when it is easy for some observers and hard for others, creating an\ninformation advantage. We show that this formulation unifies several notions of\nemergent behavior, including multiscale entropy, predictive information, and\nobserver-dependent structure. The framework suggests that \"interesting\" systems\nare those positioned to create differentiated regret across observers,\nproviding a quantitative grounding for why complexity can be functionally\nvaluable. We demonstrate the idea through simple dynamical models and discuss\nimplications for learning, evolution, and artificial agents.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.IT",
        "math.IT"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04590v1",
        "pdf": "http://arxiv.org/pdf/2511.04590v1"
      },
      "arxiv_id": "2511.04590v1",
      "comment": "15 pages. Under preparation for submission to ICML 2026. Feedback\n  welcome",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04588v1",
      "title": "Question the Questions: Auditing Representation in Online Deliberative Processes",
      "authors": [
        "Soham De",
        "Lodewijk Gelauff",
        "Ashish Goel",
        "Smitha Milli",
        "Ariel Procaccia",
        "Alice Siu"
      ],
      "abstract": "A central feature of many deliberative processes, such as citizens'\nassemblies and deliberative polls, is the opportunity for participants to\nengage directly with experts. While participants are typically invited to\npropose questions for expert panels, only a limited number can be selected due\nto time constraints. This raises the challenge of how to choose a small set of\nquestions that best represent the interests of all participants. We introduce\nan auditing framework for measuring the level of representation provided by a\nslate of questions, based on the social choice concept known as justified\nrepresentation (JR). We present the first algorithms for auditing JR in the\ngeneral utility setting, with our most efficient algorithm achieving a runtime\nof $O(mn\\log n)$, where $n$ is the number of participants and $m$ is the number\nof proposed questions. We apply our auditing methods to historical\ndeliberations, comparing the representativeness of (a) the actual questions\nposed to the expert panel (chosen by a moderator), (b) participants' questions\nchosen via integer linear programming, (c) summary questions generated by large\nlanguage models (LLMs). Our results highlight both the promise and current\nlimitations of LLMs in supporting deliberative processes. By integrating our\nmethods into an online deliberation platform that has been used for over\nhundreds of deliberations across more than 50 countries, we make it easy for\npractitioners to audit and improve representation in future deliberations.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.CY"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04588v1",
        "pdf": "http://arxiv.org/pdf/2511.04588v1"
      },
      "arxiv_id": "2511.04588v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04584v1",
      "title": "Are We Asking the Right Questions? On Ambiguity in Natural Language Queries for Tabular Data Analysis",
      "authors": [
        "Daniel Gomm",
        "Cornelius Wolff",
        "Madelon Hulsebos"
      ],
      "abstract": "Natural language interfaces to tabular data must handle ambiguities inherent\nto queries. Instead of treating ambiguity as a deficiency, we reframe it as a\nfeature of cooperative interaction, where the responsibility of query\nspecification is shared among the user and the system. We develop a principled\nframework distinguishing cooperative queries, i.e., queries that yield a\nresolvable interpretation, from uncooperative queries that cannot be resolved.\nApplying the framework to evaluations for tabular question answering and\nanalysis, we analyze the queries in 15 popular datasets, and observe an\nuncontrolled mixing of query types neither adequate for evaluating a system's\nexecution accuracy nor for evaluating interpretation capabilities. Our\nframework and analysis of queries shifts the perspective from fixing ambiguity\nto embracing cooperation in resolving queries. This reflection enables more\ninformed design and evaluation for natural language interfaces for tabular\ndata, for which we outline implications and directions for future research.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.DB",
        "cs.HC"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04584v1",
        "pdf": "http://arxiv.org/pdf/2511.04584v1"
      },
      "arxiv_id": "2511.04584v1",
      "comment": "Accepted to the AI for Tabular Data workshop at EurIPS 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04583v1",
      "title": "Jr. AI Scientist and Its Risk Report: Autonomous Scientific Exploration from a Baseline Paper",
      "authors": [
        "Atsuyuki Miyai",
        "Mashiro Toyooka",
        "Takashi Otonari",
        "Zaiying Zhao",
        "Kiyoharu Aizawa"
      ],
      "abstract": "Understanding the current capabilities and risks of AI Scientist systems is\nessential for ensuring trustworthy and sustainable AI-driven scientific\nprogress while preserving the integrity of the academic ecosystem. To this end,\nwe develop Jr. AI Scientist, a state-of-the-art autonomous AI scientist system\nthat mimics the core research workflow of a novice student researcher: Given\nthe baseline paper from the human mentor, it analyzes its limitations,\nformulates novel hypotheses for improvement, validates them through rigorous\nexperimentation, and writes a paper with the results. Unlike previous\napproaches that assume full automation or operate on small-scale code, Jr. AI\nScientist follows a well-defined research workflow and leverages modern coding\nagents to handle complex, multi-file implementations, leading to scientifically\nvaluable contributions. For evaluation, we conducted automated assessments\nusing AI Reviewers, author-led evaluations, and submissions to Agents4Science,\na venue dedicated to AI-driven scientific contributions. The findings\ndemonstrate that Jr. AI Scientist generates papers receiving higher review\nscores than existing fully automated systems. Nevertheless, we identify\nimportant limitations from both the author evaluation and the Agents4Science\nreviews, indicating the potential risks of directly applying current AI\nScientist systems and key challenges for future research. Finally, we\ncomprehensively report various risks identified during development. We hope\nthese insights will deepen understanding of current progress and risks in AI\nScientist development.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04583v1",
        "pdf": "http://arxiv.org/pdf/2511.04583v1"
      },
      "arxiv_id": "2511.04583v1",
      "comment": "Issues, comments, and questions are all welcome in\n  https://github.com/Agent4Science-UTokyo/Jr.AI-Scientist",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.04576v1",
      "title": "Physics-Informed Neural Networks and Neural Operators for Parametric PDEs: A Human-AI Collaborative Analysis",
      "authors": [
        "Zhuo Zhang",
        "Xiong Xiong",
        "Sen Zhang",
        "Yuan Zhao",
        "Xi Yang"
      ],
      "abstract": "PDEs arise ubiquitously in science and engineering, where solutions depend on\nparameters (physical properties, boundary conditions, geometry). Traditional\nnumerical methods require re-solving the PDE for each parameter, making\nparameter space exploration prohibitively expensive. Recent machine learning\nadvances, particularly physics-informed neural networks (PINNs) and neural\noperators, have revolutionized parametric PDE solving by learning solution\noperators that generalize across parameter spaces. We critically analyze two\nmain paradigms: (1) PINNs, which embed physical laws as soft constraints and\nexcel at inverse problems with sparse data, and (2) neural operators (e.g.,\nDeepONet, Fourier Neural Operator), which learn mappings between\ninfinite-dimensional function spaces and achieve unprecedented generalization.\nThrough comparisons across fluid dynamics, solid mechanics, heat transfer, and\nelectromagnetics, we show neural operators can achieve computational speedups\nof $10^3$ to $10^5$ times faster than traditional solvers for multi-query\nscenarios, while maintaining comparable accuracy. We provide practical guidance\nfor method selection, discuss theoretical foundations (universal approximation,\nconvergence), and identify critical open challenges: high-dimensional\nparameters, complex geometries, and out-of-distribution generalization. This\nwork establishes a unified framework for understanding parametric PDE solvers\nvia operator learning, offering a comprehensive, incrementally updated resource\nfor this rapidly evolving field",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "stat.ML",
        "cs.LG",
        "68T01"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04576v1",
        "pdf": "http://arxiv.org/pdf/2511.04576v1"
      },
      "arxiv_id": "2511.04576v1",
      "comment": "61 pages, 3 figures. Submitted to The 1st International Conference on\n  AI Scientists (ICAIS 2025)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04573v1",
      "title": "ARETE: an R package for Automated REtrieval from TExt with large language models",
      "authors": [
        "Vasco V. Branco",
        "Jandó Benedek",
        "Lidia Pivovarova",
        "Luís Correia",
        "Pedro Cardoso"
      ],
      "abstract": "1. A hard stop for the implementation of rigorous conservation initiatives is\nour lack of key species data, especially occurrence data. Furthermore,\nresearchers have to contend with an accelerated speed at which new information\nmust be collected and processed due to anthropogenic activity. Publications\nranging from scientific papers to gray literature contain this crucial\ninformation but their data are often not machine-readable, requiring extensive\nhuman work to be retrieved. 2. We present the ARETE R package, an open-source\nsoftware aiming to automate data extraction of species occurrences powered by\nlarge language models, namely using the chatGPT Application Programming\nInterface. This R package integrates all steps of the data extraction and\nvalidation process, from Optical Character Recognition to detection of outliers\nand output in tabular format. Furthermore, we validate ARETE through systematic\ncomparison between what is modelled and the work of human annotators. 3. We\ndemonstrate the usefulness of the approach by comparing range maps produced\nusing GBIF data and with those automatically extracted for 100 species of\nspiders. Newly extracted data allowed to expand the known Extent of Occurrence\nby a mean three orders of magnitude, revealing new areas where the species were\nfound in the past, which mayhave important implications for spatial\nconservation planning and extinction risk assessments. 4. ARETE allows faster\naccess to hitherto untapped occurrence data, a potential game changer in\nprojects requiring such data. Researchers will be able to better prioritize\nresources, manually verifying selected species while maintaining automated\nextraction for the majority. This workflow also allows predicting available\nbibliographic data during project planning.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04573v1",
        "pdf": "http://arxiv.org/pdf/2511.04573v1"
      },
      "arxiv_id": "2511.04573v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04570v1",
      "title": "Thinking with Video: Video Generation as a Promising Multimodal Reasoning Paradigm",
      "authors": [
        "Jingqi Tong",
        "Yurong Mou",
        "Hangcheng Li",
        "Mingzhe Li",
        "Yongzhuo Yang",
        "Ming Zhang",
        "Qiguang Chen",
        "Tianyi Liang",
        "Xiaomeng Hu",
        "Yining Zheng",
        "Xinchi Chen",
        "Jun Zhao",
        "Xuanjing Huang",
        "Xipeng Qiu"
      ],
      "abstract": "\"Thinking with Text\" and \"Thinking with Images\" paradigm significantly\nimprove the reasoning ability of large language models (LLMs) and Vision\nLanguage Models (VLMs). However, these paradigms have inherent limitations. (1)\nImages capture only single moments and fail to represent dynamic processes or\ncontinuous changes, and (2) The separation of text and vision as distinct\nmodalities, hindering unified multimodal understanding and generation. To\novercome these limitations, we introduce \"Thinking with Video\", a new paradigm\nthat leverages video generation models, such as Sora-2, to bridge visual and\ntextual reasoning in a unified temporal framework. To support this exploration,\nwe developed the Video Thinking Benchmark (VideoThinkBench). VideoThinkBench\nencompasses two task categories: (1) vision-centric tasks (e.g., Eyeballing\nPuzzles), and (2) text-centric tasks (e.g., subsets of GSM8K, MMMU). Our\nevaluation establishes Sora-2 as a capable reasoner. On vision-centric tasks,\nSora-2 is generally comparable to state-of-the-art (SOTA) VLMs, and even\nsurpasses VLMs on several tasks, such as Eyeballing Games. On text-centric\ntasks, Sora-2 achieves 92% accuracy on MATH, and 75.53% accuracy on MMMU.\nFurthermore, we systematically analyse the source of these abilities. We also\nfind that self-consistency and in-context learning can improve Sora-2's\nperformance. In summary, our findings demonstrate that the video generation\nmodel is the potential unified multimodal understanding and generation model,\npositions \"thinking with video\" as a unified multimodal reasoning paradigm.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV",
        "cs.CL"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04570v1",
        "pdf": "http://arxiv.org/pdf/2511.04570v1"
      },
      "arxiv_id": "2511.04570v1",
      "comment": "36 pages, 14 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04568v1",
      "title": "Riesz Regression As Direct Density Ratio Estimation",
      "authors": [
        "Masahiro Kato"
      ],
      "abstract": "Riesz regression has garnered attention as a tool in debiased machine\nlearning for causal and structural parameter estimation (Chernozhukov et al.,\n2021). This study shows that Riesz regression is closely related to direct\ndensity-ratio estimation (DRE) in important cases, including average treat-\nment effect (ATE) estimation. Specifically, the idea and objective in Riesz\nregression coincide with the one in least-squares importance fitting (LSIF,\nKanamori et al., 2009) in direct density-ratio estimation. While Riesz\nregression is general in the sense that it can be applied to Riesz representer\nestimation in a wide class of problems, the equivalence with DRE allows us to\ndirectly import exist- ing results in specific cases, including\nconvergence-rate analyses, the selection of loss functions via\nBregman-divergence minimization, and regularization techniques for flexible\nmodels, such as neural networks. Conversely, insights about the Riesz\nrepresenter in debiased machine learning broaden the applications of direct\ndensity-ratio estimation methods. This paper consolidates our prior results in\nKato (2025a) and Kato (2025b).",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "stat.ML",
        "cs.LG",
        "econ.EM",
        "math.ST",
        "stat.ME",
        "stat.TH"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04568v1",
        "pdf": "http://arxiv.org/pdf/2511.04568v1"
      },
      "arxiv_id": "2511.04568v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04567v1",
      "title": "Machine Learning for Electron-Scale Turbulence Modeling in W7-X",
      "authors": [
        "Ionut-Gabriel Farcas",
        "Don Lawrence Carl Agapito Fernando",
        "Alejandro Banon Navarro",
        "Gabriele Merlo",
        "Frank Jenko"
      ],
      "abstract": "Constructing reduced models for turbulent transport is essential for\naccelerating profile predictions and enabling many-query tasks such as\nuncertainty quantification, parameter scans, and design optimization. This\npaper presents machine-learning-driven reduced models for Electron Temperature\nGradient (ETG) turbulence in the Wendelstein 7-X (W7-X) stellarator. Each model\npredicts the ETG heat flux as a function of three plasma parameters: the\nnormalized electron temperature radial gradient ($\\omega_{T_e}$), the ratio of\nnormalized electron temperature and density radial gradients ($\\eta_e$), and\nthe electron-to-ion temperature ratio ($\\tau$). We first construct models\nacross seven radial locations using regression and an active\nmachine-learning-based procedure. This process initializes models using\nlow-cardinality sparse-grid training data and then iteratively refines their\ntraining sets by selecting the most informative points from a pre-existing\nsimulation database. We evaluate the prediction capabilities of our models\nusing out-of-sample datasets with over $393$ points per location, and $95\\%$\nprediction intervals are estimated via bootstrapping to assess prediction\nuncertainty. We then investigate the construction of generalized reduced\nmodels, including a generic, position-independent model, and assess their heat\nflux prediction capabilities at three additional locations. Our models\ndemonstrate robust performance and predictive accuracy comparable to the\noriginal reference simulations, even when applied beyond the training domain.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "physics.plasm-ph",
        "cs.CE",
        "cs.LG",
        "physics.comp-ph"
      ],
      "primary_category": "physics.plasm-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04567v1",
        "pdf": "http://arxiv.org/pdf/2511.04567v1"
      },
      "arxiv_id": "2511.04567v1",
      "comment": "13 pages, 7 tables, 11 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04564v1",
      "title": "Uncertainties in Physics-informed Inverse Problems: The Hidden Risk in Scientific AI",
      "authors": [
        "Yoh-ichi Mototake",
        "Makoto Sasaki"
      ],
      "abstract": "Physics-informed machine learning (PIML) integrates partial differential\nequations (PDEs) into machine learning models to solve inverse problems, such\nas estimating coefficient functions (e.g., the Hamiltonian function) that\ncharacterize physical systems. This framework enables data-driven understanding\nand prediction of complex physical phenomena. While coefficient functions in\nPIML are typically estimated on the basis of predictive performance, physics as\na discipline does not rely solely on prediction accuracy to evaluate models.\nFor example, Kepler's heliocentric model was favored owing to small\ndiscrepancies in planetary motion, despite its similar predictive accuracy to\nthe geocentric model. This highlights the inherent uncertainties in data-driven\nmodel inference and the scientific importance of selecting physically\nmeaningful solutions. In this paper, we propose a framework to quantify and\nanalyze such uncertainties in the estimation of coefficient functions in PIML.\nWe apply our framework to reduced model of magnetohydrodynamics and our\nframework shows that there are uncertainties, and unique identification is\npossible with geometric constraints. Finally, we confirm that we can estimate\nthe reduced model uniquely by incorporating these constraints.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "physics.comp-ph",
        "cs.LG"
      ],
      "primary_category": "physics.comp-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04564v1",
        "pdf": "http://arxiv.org/pdf/2511.04564v1"
      },
      "arxiv_id": "2511.04564v1",
      "comment": "17 pages, 6 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04557v1",
      "title": "Integrating Temporal and Structural Context in Graph Transformers for Relational Deep Learning",
      "authors": [
        "Divyansha Lachi",
        "Mahmoud Mohammadi",
        "Joe Meyer",
        "Vinam Arora",
        "Tom Palczewski",
        "Eva L. Dyer"
      ],
      "abstract": "In domains such as healthcare, finance, and e-commerce, the temporal dynamics\nof relational data emerge from complex interactions-such as those between\npatients and providers, or users and products across diverse categories. To be\nbroadly useful, models operating on these data must integrate long-range\nspatial and temporal dependencies across diverse types of entities, while also\nsupporting multiple predictive tasks. However, existing graph models for\nrelational data primarily focus on spatial structure, treating temporal\ninformation merely as a filtering constraint to exclude future events rather\nthan a modeling signal, and are typically designed for single-task prediction.\nTo address these gaps, we introduce a temporal subgraph sampler that enhances\nglobal context by retrieving nodes beyond the immediate neighborhood to capture\ntemporally relevant relationships. In addition, we propose the Relational Graph\nPerceiver (RGP), a graph transformer architecture for relational deep learning\nthat leverages a cross-attention-based latent bottleneck to efficiently\nintegrate information from both structural and temporal contexts. This latent\nbottleneck integrates signals from different node and edge types into a common\nlatent space, enabling the model to build global context across the entire\nrelational system. RGP also incorporates a flexible cross-attention decoder\nthat supports joint learning across tasks with disjoint label spaces within a\nsingle model. Experiments on RelBench, SALT, and CTU show that RGP delivers\nstate-of-the-art performance, offering a general and scalable solution for\nrelational deep learning with support for diverse predictive tasks.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04557v1",
        "pdf": "http://arxiv.org/pdf/2511.04557v1"
      },
      "arxiv_id": "2511.04557v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04556v1",
      "title": "Optimizing Sensor Placement in Urban Storm Sewers: A Data-Driven Sparse Sensing Approach",
      "authors": [
        "Zihang Ding",
        "Kun Zhang"
      ],
      "abstract": "Urban surface water flooding, triggered by intense rainfall overwhelming\ndrainage systems, is increasingly frequent and widespread. While flood\nprediction and monitoring in high spatial-temporal resolution are desired,\npractical constraints in time, budget, and technology hinder its full\nimplementation. How to monitor urban drainage networks and predict flow\nconditions under constrained resource is a major challenge. This study presents\na data-driven sparse sensing (DSS) framework, integrated with EPA-SWMM, to\noptimize sensor placement and reconstruct peak flowrates in a stormwater\nsystem, using the Woodland Avenue catchment in Duluth, Minnesota, as a case\nstudy. We utilized a SWMM model to generate a training dataset of peak flowrate\nprofiles across the stormwater network. Furthermore, we applied DSS -\nleveraging singular value decomposition for dimensionality reduction and QR\nfactorization for sensor allocation - to identify the optimal monitoring nodes\nbased on the simulated training dataset. We then validated the\nrepresentativeness of these identified monitoring nodes by comparing the\nDSS-reconstructed peak flowrate profiles with those obtained from SWMM. Three\noptimally placed sensors among 77 nodes achieved satisfactory reconstruction\nperformance with Nash-Sutcliffe Efficiency (NSE) values of 0.92-0.95 (25th to\n75th percentiles). In addition, the model showed good robustness to uncertainty\nin measurements. Its robustness to sensor failures is location-dependent and\nimproves with the number of sensors deployed. The framework balances\ncomputational efficiency and physical interpretability, enabling high-accuracy\nflow reconstruction with minimal sensors. This DSS framework can be further\nintegrated with predictive models to realize flood early warning and real-time\ncontrol under limited sensing and monitoring resource.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.CE"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04556v1",
        "pdf": "http://arxiv.org/pdf/2511.04556v1"
      },
      "arxiv_id": "2511.04556v1",
      "comment": "32 pages (including supplementary information), 11 figures (and 7\n  figures in supplementary). Submitted to Nature Water. Partially presented at\n  HydroML 2025 Symposium, Minnesota Water Resources Conference 2025, and will\n  be presented at AGU Fall Meeting 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04555v1",
      "title": "Evo-1: Lightweight Vision-Language-Action Model with Preserved Semantic Alignment",
      "authors": [
        "Tao Lin",
        "Yilei Zhong",
        "Yuxin Du",
        "Jingjing Zhang",
        "Jiting Liu",
        "Yinxinyu Chen",
        "Encheng Gu",
        "Ziyan Liu",
        "Hongyi Cai",
        "Yanwen Zou",
        "Lixing Zou",
        "Zhaoye Zhou",
        "Gen Li",
        "Bo Zhao"
      ],
      "abstract": "Vision-Language-Action (VLA) models have emerged as a powerful framework that\nunifies perception, language, and control, enabling robots to perform diverse\ntasks through multimodal understanding. However, current VLA models typically\ncontain massive parameters and rely heavily on large-scale robot data\npretraining, leading to high computational costs during training, as well as\nlimited deployability for real-time inference. Moreover, most training\nparadigms often degrade the perceptual representations of the vision-language\nbackbone, resulting in overfitting and poor generalization to downstream tasks.\nIn this work, we present Evo-1, a lightweight VLA model that reduces\ncomputation and improves deployment efficiency, while maintaining strong\nperformance without pretraining on robot data. Evo-1 builds on a native\nmultimodal Vision-Language model (VLM), incorporating a novel cross-modulated\ndiffusion transformer along with an optimized integration module, together\nforming an effective architecture. We further introduce a two-stage training\nparadigm that progressively aligns action with perception, preserving the\nrepresentations of the VLM. Notably, with only 0.77 billion parameters, Evo-1\nachieves state-of-the-art results on the Meta-World and RoboTwin suite,\nsurpassing the previous best models by 12.4% and 6.9%, respectively, and also\nattains a competitive result of 94.8% on LIBERO. In real-world evaluations,\nEvo-1 attains a 78% success rate with high inference frequency and low memory\noverhead, outperforming all baseline methods. We release code, data, and model\nweights to facilitate future research on lightweight and efficient VLA models.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.RO",
        "cs.CV"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04555v1",
        "pdf": "http://arxiv.org/pdf/2511.04555v1"
      },
      "arxiv_id": "2511.04555v1",
      "comment": "Github: https://github.com/MINT-SJTU/Evo-1",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.04550v1",
      "title": "Confidential Computing for Cloud Security: Exploring Hardware based Encryption Using Trusted Execution Environments",
      "authors": [
        "Dhruv Deepak Agarwal",
        "Aswani Kumar Cherukuri"
      ],
      "abstract": "The growth of cloud computing has revolutionized data processing and storage\ncapacities to another levels of scalability and flexibility. But in the\nprocess, it has created a huge challenge of security, especially in terms of\nsafeguarding sensitive data. Classical security practices, including encryption\nat rest and during transit, fail to protect data in use and expose it to\nvarious possible breaches. In response to this problem , Confidential Computing\nhas been a tool ,seeking to secure data in processing by usage of\nhardware-based Trusted Execution Environments (TEEs). TEEs, including Intel's\nSoftware Guard Extensions (SGX) and ARM's TrustZone, offers protected contexts\nwithin the processor, where data is kept confidential ,intact and secure , even\nwith malicious software or compromised operating systems. In this research, we\nhave explored the architecture and security features of TEEs like Intel SGX and\nARM TrustZone, and their effectiveness in improving cloud data security. From a\nthorough literature survey ,we have analyzed the deployment strategies,\nperformance indicators, and practical uses of these TEEs for the same purpose.\nIn addition, we have discussed the issues regarding deployment, possible\nweaknesses, scalability issues, and integration issues. Our results focuses on\nthe central position of TEEs in strengthening and advancing cloud security\ninfrastructures, pointing towards their ability to create a secure foundation\nfor Confidential Computing.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CR",
        "cs.LG"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04550v1",
        "pdf": "http://arxiv.org/pdf/2511.04550v1"
      },
      "arxiv_id": "2511.04550v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04541v1",
      "title": "LLM-as-a-Judge: Toward World Models for Slate Recommendation Systems",
      "authors": [
        "Baptiste Bonin",
        "Maxime Heuillet",
        "Audrey Durand"
      ],
      "abstract": "Modeling user preferences across domains remains a key challenge in slate\nrecommendation (i.e. recommending an ordered sequence of items) research. We\ninvestigate how Large Language Models (LLM) can effectively act as world models\nof user preferences through pairwise reasoning over slates. We conduct an\nempirical study involving several LLMs on three tasks spanning different\ndatasets. Our results reveal relationships between task performance and\nproperties of the preference function captured by LLMs, hinting towards areas\nfor improvement and highlighting the potential of LLMs as world models in\nrecommender systems.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.IR",
        "cs.AI"
      ],
      "primary_category": "cs.IR",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04541v1",
        "pdf": "http://arxiv.org/pdf/2511.04541v1"
      },
      "arxiv_id": "2511.04541v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04539v1",
      "title": "Unified Generative Latent Representation for Functional Brain Graphs",
      "authors": [
        "Subati Abulikemu",
        "Tiago Azevedo",
        "Michail Mamalakis",
        "John Suckling"
      ],
      "abstract": "Functional brain graphs are often characterized with separate graph-theoretic\nor spectral descriptors, overlooking how these properties covary and partially\noverlap across brains and conditions. We anticipate that dense, weighted\nfunctional connectivity graphs occupy a low-dimensional latent geometry along\nwhich both topological and spectral structures display graded variations. Here,\nwe estimated this unified graph representation and enabled generation of dense\nfunctional brain graphs through a graph transformer autoencoder with latent\ndiffusion, with spectral geometry providing an inductive bias to guide\nlearning. This geometry-aware latent representation, although unsupervised,\nmeaningfully separated working-memory states and decoded visual stimuli, with\nperformance further enhanced by incorporating neural dynamics. From the\ndiffusion modeled distribution, we were able to sample biologically plausible\nand structurally grounded synthetic dense graphs.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "q-bio.NC",
        "cs.LG"
      ],
      "primary_category": "q-bio.NC",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04539v1",
        "pdf": "http://arxiv.org/pdf/2511.04539v1"
      },
      "arxiv_id": "2511.04539v1",
      "comment": "NeurIPS 2025 Workshop on Symmetry and Geometry in Neural\n  Representations",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04534v1",
      "title": "Uncertainty Quantification for Reduced-Order Surrogate Models Applied to Cloud Microphysics",
      "authors": [
        "Jonas E. Katona",
        "Emily K. de Jong",
        "Nipun Gunawardena"
      ],
      "abstract": "Reduced-order models (ROMs) can efficiently simulate high-dimensional\nphysical systems, but lack robust uncertainty quantification methods. Existing\napproaches are frequently architecture- or training-specific, which limits\nflexibility and generalization. We introduce a post hoc, model-agnostic\nframework for predictive uncertainty quantification in latent space ROMs that\nrequires no modification to the underlying architecture or training procedure.\nUsing conformal prediction, our approach estimates statistical prediction\nintervals for multiple components of the ROM pipeline: latent dynamics,\nreconstruction, and end-to-end predictions. We demonstrate the method on a\nlatent space dynamical model for cloud microphysics, where it accurately\npredicts the evolution of droplet-size distributions and quantifies uncertainty\nacross the ROM pipeline.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "physics.ao-ph",
        "physics.comp-ph",
        "I.6.5; I.2.6; G.3; J.2"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04534v1",
        "pdf": "http://arxiv.org/pdf/2511.04534v1"
      },
      "arxiv_id": "2511.04534v1",
      "comment": "Accepted at the NeurIPS 2025 Workshop on Machine Learning and the\n  Physical Sciences (ML4PS). 11 pages, 4 figures, 1 table. LLNL-CONF-2010541",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04527v1",
      "title": "Are language models aware of the road not taken? Token-level uncertainty and hidden state dynamics",
      "authors": [
        "Amir Zur",
        "Atticus Geiger",
        "Ekdeep Singh Lubana",
        "Eric Bigelow"
      ],
      "abstract": "When a language model generates text, the selection of individual tokens\nmight lead it down very different reasoning paths, making uncertainty difficult\nto quantify. In this work, we consider whether reasoning language models\nrepresent the alternate paths that they could take during generation. To test\nthis hypothesis, we use hidden activations to control and predict a language\nmodel's uncertainty during chain-of-thought reasoning. In our experiments, we\nfind a clear correlation between how uncertain a model is at different tokens,\nand how easily the model can be steered by controlling its activations. This\nsuggests that activation interventions are most effective when there are\nalternate paths available to the model -- in other words, when it has not yet\ncommitted to a particular final answer. We also find that hidden activations\ncan predict a model's future outcome distribution, demonstrating that models\nimplicitly represent the space of possible paths.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04527v1",
        "pdf": "http://arxiv.org/pdf/2511.04527v1"
      },
      "arxiv_id": "2511.04527v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04525v1",
      "title": "Learning from Single Timestamps: Complexity Estimation in Laparoscopic Cholecystectomy",
      "authors": [
        "Dimitrios Anastasiou",
        "Santiago Barbarisi",
        "Lucy Culshaw",
        "Jayna Patel",
        "Evangelos B. Mazomenos",
        "Imanol Luengo",
        "Danail Stoyanov"
      ],
      "abstract": "Purpose: Accurate assessment of surgical complexity is essential in\nLaparoscopic Cholecystectomy (LC), where severe inflammation is associated with\nlonger operative times and increased risk of postoperative complications. The\nParkland Grading Scale (PGS) provides a clinically validated framework for\nstratifying inflammation severity; however, its automation in surgical videos\nremains largely unexplored, particularly in realistic scenarios where complete\nvideos must be analyzed without prior manual curation. Methods: In this work,\nwe introduce STC-Net, a novel framework for SingleTimestamp-based Complexity\nestimation in LC via the PGS, designed to operate under weak temporal\nsupervision. Unlike prior methods limited to static images or manually trimmed\nclips, STC-Net operates directly on full videos. It jointly performs temporal\nlocalization and grading through a localization, window proposal, and grading\nmodule. We introduce a novel loss formulation combining hard and soft\nlocalization objectives and background-aware grading supervision. Results:\nEvaluated on a private dataset of 1,859 LC videos, STC-Net achieves an accuracy\nof 62.11% and an F1-score of 61.42%, outperforming non-localized baselines by\nover 10% in both metrics and highlighting the effectiveness of weak supervision\nfor surgical complexity assessment. Conclusion: STC-Net demonstrates a scalable\nand effective approach for automated PGS-based surgical complexity estimation\nfrom full LC videos, making it promising for post-operative analysis and\nsurgical training.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04525v1",
        "pdf": "http://arxiv.org/pdf/2511.04525v1"
      },
      "arxiv_id": "2511.04525v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04522v1",
      "title": "End-to-End Reinforcement Learning of Koopman Models for eNMPC of an Air Separation Unit",
      "authors": [
        "Daniel Mayfrank",
        "Kayra Dernek",
        "Laura Lang",
        "Alexander Mitsos",
        "Manuel Dahmen"
      ],
      "abstract": "With our recently proposed method based on reinforcement learning (Mayfrank\net al. (2024), Comput. Chem. Eng. 190), Koopman surrogate models can be trained\nfor optimal performance in specific (economic) nonlinear model predictive\ncontrol ((e)NMPC) applications. So far, our method has exclusively been\ndemonstrated on a small-scale case study. Herein, we show that our method\nscales well to a more challenging demand response case study built on a\nlarge-scale model of a single-product (nitrogen) air separation unit. Across\nall numerical experiments, we assume observability of only a few realistically\nmeasurable plant variables. Compared to a purely system identification-based\nKoopman eNMPC, which generates small economic savings but frequently violates\nconstraints, our method delivers similar economic performance while avoiding\nconstraint violations.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "math.OC"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04522v1",
        "pdf": "http://arxiv.org/pdf/2511.04522v1"
      },
      "arxiv_id": "2511.04522v1",
      "comment": "manuscript (8 pages, 5 figures, 1 table), supplementary materials (5\n  pages, 1 figure, 1 table)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04520v1",
      "title": "THEval. Evaluation Framework for Talking Head Video Generation",
      "authors": [
        "Nabyl Quignon",
        "Baptiste Chopin",
        "Yaohui Wang",
        "Antitza Dantcheva"
      ],
      "abstract": "Video generation has achieved remarkable progress, with generated videos\nincreasingly resembling real ones. However, the rapid advance in generation has\noutpaced the development of adequate evaluation metrics. Currently, the\nassessment of talking head generation primarily relies on limited metrics,\nevaluating general video quality, lip synchronization, and on conducting user\nstudies. Motivated by this, we propose a new evaluation framework comprising 8\nmetrics related to three dimensions (i) quality, (ii) naturalness, and (iii)\nsynchronization. In selecting the metrics, we place emphasis on efficiency, as\nwell as alignment with human preferences. Based on this considerations, we\nstreamline to analyze fine-grained dynamics of head, mouth, and eyebrows, as\nwell as face quality. Our extensive experiments on 85,000 videos generated by\n17 state-of-the-art models suggest that while many algorithms excel in lip\nsynchronization, they face challenges with generating expressiveness and\nartifact-free details. These videos were generated based on a novel real\ndataset, that we have curated, in order to mitigate bias of training data. Our\nproposed benchmark framework is aimed at evaluating the improvement of\ngenerative methods. Original code, dataset and leaderboards will be publicly\nreleased and regularly updated with new methods, in order to reflect progress\nin the field.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04520v1",
        "pdf": "http://arxiv.org/pdf/2511.04520v1"
      },
      "arxiv_id": "2511.04520v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04518v1",
      "title": "Comparing EPGP Surrogates and Finite Elements Under Degree-of-Freedom Parity",
      "authors": [
        "Obed Amo",
        "Samit Ghosh",
        "Markus Lange-Hegermann",
        "Bogdan Raiţă",
        "Michael Pokojovy"
      ],
      "abstract": "We present a new benchmarking study comparing a boundary-constrained\nEhrenpreis--Palamodov Gaussian Process (B-EPGP) surrogate with a classical\nfinite element method combined with Crank--Nicolson time stepping (CN-FEM) for\nsolving the two-dimensional wave equation with homogeneous Dirichlet boundary\nconditions. The B-EPGP construction leverages exponential-polynomial bases\nderived from the characteristic variety to enforce the PDE and boundary\nconditions exactly and employs penalized least squares to estimate the\ncoefficients. To ensure fairness across paradigms, we introduce a\ndegrees-of-freedom (DoF) matching protocol. Under matched DoF, B-EPGP\nconsistently attains lower space-time $L^2$-error and maximum-in-time\n$L^{2}$-error in space than CN-FEM, improving accuracy by roughly two orders of\nmagnitude.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.NA",
        "math.NA",
        "stat.ML",
        "68T05, 62J07, 65M20, 65M60",
        "I.2.6; G.1.2; G.1.8"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04518v1",
        "pdf": "http://arxiv.org/pdf/2511.04518v1"
      },
      "arxiv_id": "2511.04518v1",
      "comment": "14 pages, 2 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04514v1",
      "title": "Linear Mode Connectivity under Data Shifts for Deep Ensembles of Image Classifiers",
      "authors": [
        "C. Hepburn",
        "T. Zielke",
        "A. P. Raulf"
      ],
      "abstract": "The phenomenon of linear mode connectivity (LMC) links several aspects of\ndeep learning, including training stability under noisy stochastic gradients,\nthe smoothness and generalization of local minima (basins), the similarity and\nfunctional diversity of sampled models, and architectural effects on data\nprocessing. In this work, we experimentally study LMC under data shifts and\nidentify conditions that mitigate their impact. We interpret data shifts as an\nadditional source of stochastic gradient noise, which can be reduced through\nsmall learning rates and large batch sizes. These parameters influence whether\nmodels converge to the same local minimum or to regions of the loss landscape\nwith varying smoothness and generalization. Although models sampled via LMC\ntend to make similar errors more frequently than those converging to different\nbasins, the benefit of LMC lies in balancing training efficiency against the\ngains achieved from larger, more diverse ensembles. Code and supplementary\nmaterials will be made publicly available at https://github.com/DLR-KI/LMC in\ndue course.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04514v1",
        "pdf": "http://arxiv.org/pdf/2511.04514v1"
      },
      "arxiv_id": "2511.04514v1",
      "comment": "16 pages, 22 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04510v1",
      "title": "$μ$NeuFMT: Optical-Property-Adaptive Fluorescence Molecular Tomography via Implicit Neural Representation",
      "authors": [
        "Shihan Zhao",
        "Jianru Zhang",
        "Yanan Wu",
        "Linlin Li",
        "Siyuan Shen",
        "Xingjun Zhu",
        "Guoyan Zheng",
        "Jiahua Jiang",
        "Wuwei Ren"
      ],
      "abstract": "Fluorescence Molecular Tomography (FMT) is a promising technique for\nnon-invasive 3D visualization of fluorescent probes, but its reconstruction\nremains challenging due to the inherent ill-posedness and reliance on\ninaccurate or often-unknown tissue optical properties. While deep learning\nmethods have shown promise, their supervised nature limits generalization\nbeyond training data. To address these problems, we propose $\\mu$NeuFMT, a\nself-supervised FMT reconstruction framework that integrates implicit\nneural-based scene representation with explicit physical modeling of photon\npropagation. Its key innovation lies in jointly optimize both the fluorescence\ndistribution and the optical properties ($\\mu$) during reconstruction,\neliminating the need for precise prior knowledge of tissue optics or\npre-conditioned training data. We demonstrate that $\\mu$NeuFMT robustly\nrecovers accurate fluorophore distributions and optical coefficients even with\nseverely erroneous initial values (0.5$\\times$ to 2$\\times$ of ground truth).\nExtensive numerical, phantom, and in vivo validations show that $\\mu$NeuFMT\noutperforms conventional and supervised deep learning approaches across diverse\nheterogeneous scenarios. Our work establishes a new paradigm for robust and\naccurate FMT reconstruction, paving the way for more reliable molecular imaging\nin complex clinically related scenarios, such as fluorescence guided surgery.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "eess.IV",
        "cs.CV",
        "physics.optics",
        "68T07, 78A46, 78A70, 92C55",
        "I.2.10; I.4.5"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04510v1",
        "pdf": "http://arxiv.org/pdf/2511.04510v1"
      },
      "arxiv_id": "2511.04510v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04505v1",
      "title": "Alternative Fairness and Accuracy Optimization in Criminal Justice",
      "authors": [
        "Shaolong Wu",
        "James Blume",
        "Geshi Yeung"
      ],
      "abstract": "Algorithmic fairness has grown rapidly as a research area, yet key concepts\nremain unsettled, especially in criminal justice. We review group, individual,\nand process fairness and map the conditions under which they conflict. We then\ndevelop a simple modification to standard group fairness. Rather than exact\nparity across protected groups, we minimize a weighted error loss while keeping\ndifferences in false negative rates within a small tolerance. This makes\nsolutions easier to find, can raise predictive accuracy, and surfaces the\nethical choice of error costs. We situate this proposal within three classes of\ncritique: biased and incomplete data, latent affirmative action, and the\nexplosion of subgroup constraints. Finally, we offer a practical framework for\ndeployment in public decision systems built on three pillars: need-based\ndecisions, Transparency and accountability, and narrowly tailored definitions\nand solutions. Together, these elements link technical design to legitimacy and\nprovide actionable guidance for agencies that use risk assessment and related\ntools.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CY"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04505v1",
        "pdf": "http://arxiv.org/pdf/2511.04505v1"
      },
      "arxiv_id": "2511.04505v1",
      "comment": "Accepted for presentation at the AAAI 2026 AI Governance Workshop\n  (AIGOV). 24 pages",
      "journal_ref": "Proceedings of the AAAI 2026 AI Governance Workshop (AIGOV),\n  Singapore, 2026",
      "has_code": false
    },
    {
      "id": "2511.04502v1",
      "title": "RAGalyst: Automated Human-Aligned Agentic Evaluation for Domain-Specific RAG",
      "authors": [
        "Joshua Gao",
        "Quoc Huy Pham",
        "Subin Varghese",
        "Silwal Saurav",
        "Vedhus Hoskere"
      ],
      "abstract": "Retrieval-Augmented Generation (RAG) is a critical technique for grounding\nLarge Language Models (LLMs) in factual evidence, yet evaluating RAG systems in\nspecialized, safety-critical domains remains a significant challenge. Existing\nevaluation frameworks often rely on heuristic-based metrics that fail to\ncapture domain-specific nuances and other works utilize LLM-as-a-Judge\napproaches that lack validated alignment with human judgment. This paper\nintroduces RAGalyst, an automated, human-aligned agentic framework designed for\nthe rigorous evaluation of domain-specific RAG systems. RAGalyst features an\nagentic pipeline that generates high-quality, synthetic question-answering (QA)\ndatasets from source documents, incorporating an agentic filtering step to\nensure data fidelity. The framework refines two key LLM-as-a-Judge\nmetrics-Answer Correctness and Answerability-using prompt optimization to\nachieve a strong correlation with human annotations. Applying this framework to\nevaluate various RAG components across three distinct domains (military\noperations, cybersecurity, and bridge engineering), we find that performance is\nhighly context-dependent. No single embedding model, LLM, or hyperparameter\nconfiguration proves universally optimal. Additionally, we provide an analysis\non the most common low Answer Correctness reasons in RAG. These findings\nhighlight the necessity of a systematic evaluation framework like RAGalyst,\nwhich empowers practitioners to uncover domain-specific trade-offs and make\ninformed design choices for building reliable and effective RAG systems.\nRAGalyst is available on our Github.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04502v1",
        "pdf": "http://arxiv.org/pdf/2511.04502v1"
      },
      "arxiv_id": "2511.04502v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04500v1",
      "title": "Large language models replicate and predict human cooperation across experiments in game theory",
      "authors": [
        "Andrea Cera Palatsi",
        "Samuel Martin-Gutierrez",
        "Ana S. Cardenal",
        "Max Pellert"
      ],
      "abstract": "Large language models (LLMs) are increasingly used both to make decisions in\ndomains such as health, education and law, and to simulate human behavior. Yet\nhow closely LLMs mirror actual human decision-making remains poorly understood.\nThis gap is critical: misalignment could produce harmful outcomes in practical\napplications, while failure to replicate human behavior renders LLMs\nineffective for social simulations. Here, we address this gap by developing a\ndigital twin of game-theoretic experiments and introducing a systematic\nprompting and probing framework for machine-behavioral evaluation. Testing\nthree open-source models (Llama, Mistral and Qwen), we find that Llama\nreproduces human cooperation patterns with high fidelity, capturing human\ndeviations from rational choice theory, while Qwen aligns closely with Nash\nequilibrium predictions. Notably, we achieved population-level behavioral\nreplication without persona-based prompting, simplifying the simulation\nprocess. Extending beyond the original human-tested games, we generate and\npreregister testable hypotheses for novel game configurations outside the\noriginal parameter grid. Our findings demonstrate that appropriately calibrated\nLLMs can replicate aggregate human behavioral patterns and enable systematic\nexploration of unexplored experimental spaces, offering a complementary\napproach to traditional research in the social and behavioral sciences that\ngenerates new empirical predictions about human social decision-making.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.GT",
        "cs.MA"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04500v1",
        "pdf": "http://arxiv.org/pdf/2511.04500v1"
      },
      "arxiv_id": "2511.04500v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04499v1",
      "title": "Decoding Emergent Big Five Traits in Large Language Models: Temperature-Dependent Expression and Architectural Clustering",
      "authors": [
        "Christos-Nikolaos Zacharopoulos",
        "Revekka Kyriakoglou"
      ],
      "abstract": "As Large Language Models (LLMs) become integral to human-centered\napplications, understanding their personality-like behaviors is increasingly\nimportant for responsible development and deployment. This paper systematically\nevaluates six LLMs, applying the Big Five Inventory-2 (BFI-2) framework, to\nassess trait expressions under varying sampling temperatures. We find\nsignificant differences across four of the five personality dimensions, with\nNeuroticism and Extraversion susceptible to temperature adjustments. Further,\nhierarchical clustering reveals distinct model clusters, suggesting that\narchitectural features may predispose certain models toward stable trait\nprofiles. Taken together, these results offer new insights into the emergence\nof personality-like patterns in LLMs and provide a new perspective on model\ntuning, selection, and the ethical governance of AI systems. We share the data\nand code for this analysis here:\nhttps://osf.io/bsvzc/?view_only=6672219bede24b4e875097426dc3fac1",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04499v1",
        "pdf": "http://arxiv.org/pdf/2511.04499v1"
      },
      "arxiv_id": "2511.04499v1",
      "comment": "Accepted at IJCNLP-AACL 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04495v1",
      "title": "OUNLP at TSAR 2025 Shared Task: Multi-Round Text Simplifier via Code Generation",
      "authors": [
        "Cuong Huynh",
        "Jie Cao"
      ],
      "abstract": "This paper describes the OUNLP system submitted to the TSAR-2025 Shared Task\n(Alva-Manchego et al., 2025), designed for readability-controlled text\nsimplification using LLM-prompting-based generation. Based on the analysis of\nprompt-based text simplification methods, we discovered an interesting finding\nthat text simplification performance is highly related to the gap between the\nsource CEFR (Arase et al., 2022) level and the target CEFR level. Inspired by\nthis finding, we propose two multi-round simplification methods and generate\nthem via GPT-4o: rule-based simplification (MRS-Rule) and jointly rule-based\nLLM simplification (MRS-Joint). Our submitted systems ranked 7 out of 20 teams.\nLater improvements with MRS-Joint show that taking the LLM simplified\ncandidates as the starting point could further boost the multi-round\nsimplification performance.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04495v1",
        "pdf": "http://arxiv.org/pdf/2511.04495v1"
      },
      "arxiv_id": "2511.04495v1",
      "comment": "Accepted to TSAR 2025 Workshop at EMNLP2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04494v1",
      "title": "Distribution-Aware Tensor Decomposition for Compression of Convolutional Neural Networks",
      "authors": [
        "Alper Kalle",
        "Theo Rudkiewicz",
        "Mohamed-Oumar Ouerfelli",
        "Mohamed Tamaazousti"
      ],
      "abstract": "Neural networks are widely used for image-related tasks but typically demand\nconsiderable computing power. Once a network has been trained, however, its\nmemory- and compute-footprint can be reduced by compression. In this work, we\nfocus on compression through tensorization and low-rank representations.\nWhereas classical approaches search for a low-rank approximation by minimizing\nan isotropic norm such as the Frobenius norm in weight-space, we use\ndata-informed norms that measure the error in function space. Concretely, we\nminimize the change in the layer's output distribution, which can be expressed\nas $\\lVert (W - \\widetilde{W}) \\Sigma^{1/2}\\rVert_F$ where $\\Sigma^{1/2}$ is\nthe square root of the covariance matrix of the layer's input and $W$,\n$\\widetilde{W}$ are the original and compressed weights. We propose new\nalternating least square algorithms for the two most common tensor\ndecompositions (Tucker-2 and CPD) that directly optimize the new norm. Unlike\nconventional compression pipelines, which almost always require\npost-compression fine-tuning, our data-informed approach often achieves\ncompetitive accuracy without any fine-tuning. We further show that the same\ncovariance-based norm can be transferred from one dataset to another with only\na minor accuracy drop, enabling compression even when the original training\ndataset is unavailable. Experiments on several CNN architectures (ResNet-18/50,\nand GoogLeNet) and datasets (ImageNet, FGVC-Aircraft, Cifar10, and Cifar100)\nconfirm the advantages of the proposed method.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.CV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04494v1",
        "pdf": "http://arxiv.org/pdf/2511.04494v1"
      },
      "arxiv_id": "2511.04494v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04491v1",
      "title": "RUST-BENCH: Benchmarking LLM Reasoning on Unstructured Text within Structured Tables",
      "authors": [
        "Nikhil Abhyankar",
        "Purvi Chaurasia",
        "Sanchit Kabra",
        "Ananya Srivastava",
        "Vivek Gupta",
        "Chandan K. Reddy"
      ],
      "abstract": "Existing tabular reasoning benchmarks mostly test models on small, uniform\ntables, underrepresenting the complexity of real-world data and giving an\nincomplete view of Large Language Models' (LLMs) reasoning abilities. Real\ntables are long, heterogeneous, and domain-specific, mixing structured fields\nwith free text and requiring multi-hop reasoning across thousands of tokens. To\naddress this gap, we introduce RUST-BENCH, a benchmark of 7966 questions from\n2031 real-world tables spanning two domains: i) RB-Science (NSF grant records)\nand ii) RB-Sports (NBA statistics). Unlike prior work, RUST-BENCH evaluates\nLLMs jointly across scale, heterogeneity, domain specificity, and reasoning\ncomplexity. Experiments with open-source and proprietary models show that LLMs\nstruggle with heterogeneous schemas and complex multi-hop inference, revealing\npersistent weaknesses in current architectures and prompting strategies.\nRUST-BENCH establishes a challenging new testbed for advancing tabular\nreasoning research.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.DB",
        "cs.IR",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04491v1",
        "pdf": "http://arxiv.org/pdf/2511.04491v1"
      },
      "arxiv_id": "2511.04491v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04485v1",
      "title": "Q3R: Quadratic Reweighted Rank Regularizer for Effective Low-Rank Training",
      "authors": [
        "Ipsita Ghosh",
        "Ethan Nguyen",
        "Christian Kümmerle"
      ],
      "abstract": "Parameter-efficient training, based on low-rank optimization, has become a\nhighly successful tool for fine-tuning large deep-learning models. However,\nthese methods fail at low-rank pre-training tasks where maintaining the\nlow-rank structure and the objective remains a challenging task. We propose the\nQuadratic Reweighted Rank Regularizer dubbed Q3R, which leads to a novel\nlow-rank inducing training strategy inspired by the iteratively reweighted\nleast squares (IRLS) framework. Q3R is based on a quadratic regularizer term\nwhich majorizes a smoothed log determinant serving as rank surrogate objective.\nUnlike other low-rank training techniques, Q3R is able to train weight matrices\nwith prescribed, low target ranks of models that achieve comparable predictive\nperformance as dense models, with small computational overhead, while remaining\nfully compatible with existing architectures. For example, we demonstrated one\nexperiment where we are able to truncate $60\\%$ and $80\\%$ of the parameters of\na ViT-Tiny model with $~1.3\\%$ and $~4\\%$ accuracy drop in CIFAR-10 performance\nrespectively. The efficacy of Q3R is confirmed on Transformers across both\nimage and language tasks, including for low-rank fine-tuning.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI",
        "math.OC"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04485v1",
        "pdf": "http://arxiv.org/pdf/2511.04485v1"
      },
      "arxiv_id": "2511.04485v1",
      "comment": "",
      "journal_ref": "39th Conference on Neural Information Processing Systems (NeurIPS\n  2025)",
      "has_code": false
    },
    {
      "id": "2511.04484v1",
      "title": "Online Algorithms for Repeated Optimal Stopping: Achieving Both Competitive Ratio and Regret Bounds",
      "authors": [
        "Tsubasa Harada",
        "Yasushi Kawase",
        "Hanna Sumita"
      ],
      "abstract": "We study the repeated optimal stopping problem, which generalizes the\nclassical optimal stopping problem with an unknown distribution to a setting\nwhere the same problem is solved repeatedly over $T$ rounds. In this framework,\nwe aim to design algorithms that guarantee a competitive ratio in each round\nwhile also achieving sublinear regret across all rounds.\n  Our primary contribution is a general algorithmic framework that achieves\nthese objectives simultaneously for a wide array of repeated optimal stopping\nproblems. The core idea is to dynamically select an algorithm for each round,\nchoosing between two candidates: (1) an empirically optimal algorithm derived\nfrom the history of observations, and (2) a sample-based algorithm with a\nproven competitive ratio guarantee. Based on this approach, we design an\nalgorithm that performs no worse than the baseline sample-based algorithm in\nevery round, while ensuring that the total regret is bounded by\n$\\tilde{O}(\\sqrt{T})$.\n  We demonstrate the broad applicability of our framework to canonical\nproblems, including the prophet inequality, the secretary problem, and their\nvariants under adversarial, random, and i.i.d. input models. For example, for\nthe repeated prophet inequality problem, our method achieves a\n$1/2$-competitive ratio from the second round on and an $\\tilde{O}(\\sqrt{T})$\nregret. Furthermore, we establish a regret lower bound of $\\Omega(\\sqrt{T})$\neven in the i.i.d. model, confirming that our algorithm's performance is almost\noptimal with respect to the number of rounds.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.DS",
        "cs.LG"
      ],
      "primary_category": "cs.DS",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04484v1",
        "pdf": "http://arxiv.org/pdf/2511.04484v1"
      },
      "arxiv_id": "2511.04484v1",
      "comment": "33 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04481v1",
      "title": "Promoting Sustainable Web Agents: Benchmarking and Estimating Energy Consumption through Empirical and Theoretical Analysis",
      "authors": [
        "Lars Krupp",
        "Daniel Geißler",
        "Vishal Banwari",
        "Paul Lukowicz",
        "Jakob Karolus"
      ],
      "abstract": "Web agents, like OpenAI's Operator and Google's Project Mariner, are powerful\nagentic systems pushing the boundaries of Large Language Models (LLM). They can\nautonomously interact with the internet at the user's behest, such as\nnavigating websites, filling search masks, and comparing price lists. Though\nweb agent research is thriving, induced sustainability issues remain largely\nunexplored. To highlight the urgency of this issue, we provide an initial\nexploration of the energy and $CO_2$ cost associated with web agents from both\na theoretical -via estimation- and an empirical perspective -by benchmarking.\nOur results show how different philosophies in web agent creation can severely\nimpact the associated expended energy, and that more energy consumed does not\nnecessarily equate to better results. We highlight a lack of transparency\nregarding disclosing model parameters and processes used for some web agents as\na limiting factor when estimating energy consumption. Our work contributes\ntowards a change in thinking of how we evaluate web agents, advocating for\ndedicated metrics measuring energy consumption in benchmarks.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04481v1",
        "pdf": "http://arxiv.org/pdf/2511.04481v1"
      },
      "arxiv_id": "2511.04481v1",
      "comment": "Accepted by AAAI 2026 AISI",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04478v1",
      "title": "Generate, Evaluate, Iterate: Synthetic Data for Human-in-the-Loop Refinement of LLM Judges",
      "authors": [
        "Hyo Jin Do",
        "Zahra Ashktorab",
        "Jasmina Gajcin",
        "Erik Miehling",
        "Martín Santillán Cooper",
        "Qian Pan",
        "Elizabeth M. Daly",
        "Werner Geyer"
      ],
      "abstract": "The LLM-as-a-judge paradigm enables flexible, user-defined evaluation, but\nits effectiveness is often limited by the scarcity of diverse, representative\ndata for refining criteria. We present a tool that integrates synthetic data\ngeneration into the LLM-as-a-judge workflow, empowering users to create\ntailored and challenging test cases with configurable domains, personas,\nlengths, and desired outcomes, including borderline cases. The tool also\nsupports AI-assisted inline editing of existing test cases. To enhance\ntransparency and interpretability, it reveals the prompts and explanations\nbehind each generation. In a user study (N=24), 83% of participants preferred\nthe tool over manually creating or selecting test cases, as it allowed them to\nrapidly generate diverse synthetic data without additional workload. The\ngenerated synthetic data proved as effective as hand-crafted data for both\nrefining evaluation criteria and aligning with human preferences. These\nfindings highlight synthetic data as a promising alternative, particularly in\ncontexts where efficiency and scalability are critical.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.HC",
        "cs.AI"
      ],
      "primary_category": "cs.HC",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04478v1",
        "pdf": "http://arxiv.org/pdf/2511.04478v1"
      },
      "arxiv_id": "2511.04478v1",
      "comment": "29 pages, 4 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04474v1",
      "title": "Landslide Hazard Mapping with Geospatial Foundation Models: Geographical Generalizability, Data Scarcity, and Band Adaptability",
      "authors": [
        "Wenwen Li",
        "Sizhe Wang",
        "Hyunho Lee",
        "Chenyan Lu",
        "Sujit Roy",
        "Rahul Ramachandran",
        "Chia-Yu Hsu"
      ],
      "abstract": "Landslides cause severe damage to lives, infrastructure, and the environment,\nmaking accurate and timely mapping essential for disaster preparedness and\nresponse. However, conventional deep learning models often struggle when\napplied across different sensors, regions, or under conditions of limited\ntraining data. To address these challenges, we present a three-axis analytical\nframework of sensor, label, and domain for adapting geospatial foundation\nmodels (GeoFMs), focusing on Prithvi-EO-2.0 for landslide mapping. Through a\nseries of experiments, we show that it consistently outperforms task-specific\nCNNs (U-Net, U-Net++), vision transformers (Segformer, SwinV2-B), and other\nGeoFMs (TerraMind, SatMAE). The model, built on global pretraining,\nself-supervision, and adaptable fine-tuning, proved resilient to spectral\nvariation, maintained accuracy under label scarcity, and generalized more\nreliably across diverse datasets and geographic settings. Alongside these\nstrengths, we also highlight remaining challenges such as computational cost\nand the limited availability of reusable AI-ready training data for landslide\nresearch. Overall, our study positions GeoFMs as a step toward more robust and\nscalable approaches for landslide risk reduction and environmental monitoring.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04474v1",
        "pdf": "http://arxiv.org/pdf/2511.04474v1"
      },
      "arxiv_id": "2511.04474v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04473v1",
      "title": "Ground-Truth Subgraphs for Better Training and Evaluation of Knowledge Graph Augmented LLMs",
      "authors": [
        "Alberto Cattaneo",
        "Carlo Luschi",
        "Daniel Justus"
      ],
      "abstract": "Retrieval of information from graph-structured knowledge bases represents a\npromising direction for improving the factuality of LLMs. While various\nsolutions have been proposed, a comparison of methods is difficult due to the\nlack of challenging QA datasets with ground-truth targets for graph retrieval.\nWe present SynthKGQA, a framework for generating high-quality synthetic\nKnowledge Graph Question Answering datasets from any Knowledge Graph, providing\nthe full set of ground-truth facts in the KG to reason over each question. We\nshow how, in addition to enabling more informative benchmarking of KG\nretrievers, the data produced with SynthKGQA also allows us to train better\nmodels. We apply SynthKGQA to Wikidata to generate GTSQA, a new dataset\ndesigned to test zero-shot generalization abilities of KG retrievers with\nrespect to unseen graph structures and relation types, and benchmark popular\nsolutions for KG-augmented LLMs on it.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CL",
        "cs.IR"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04473v1",
        "pdf": "http://arxiv.org/pdf/2511.04473v1"
      },
      "arxiv_id": "2511.04473v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04469v1",
      "title": "Towards Causal Market Simulators",
      "authors": [
        "Dennis Thumm",
        "Luis Ontaneda Mijares"
      ],
      "abstract": "Market generators using deep generative models have shown promise for\nsynthetic financial data generation, but existing approaches lack causal\nreasoning capabilities essential for counterfactual analysis and risk\nassessment. We propose a Time-series Neural Causal Model VAE (TNCM-VAE) that\ncombines variational autoencoders with structural causal models to generate\ncounterfactual financial time series while preserving both temporal\ndependencies and causal relationships. Our approach enforces causal constraints\nthrough directed acyclic graphs in the decoder architecture and employs the\ncausal Wasserstein distance for training. We validate our method on synthetic\nautoregressive models inspired by the Ornstein-Uhlenbeck process, demonstrating\nsuperior performance in counterfactual probability estimation with L1 distances\nas low as 0.03-0.10 compared to ground truth. The model enables financial\nstress testing, scenario analysis, and enhanced backtesting by generating\nplausible counterfactual market trajectories that respect underlying causal\nmechanisms.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "q-fin.CP",
        "stat.OT"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04469v1",
        "pdf": "http://arxiv.org/pdf/2511.04469v1"
      },
      "arxiv_id": "2511.04469v1",
      "comment": "ICAIF 2025 Workshop on Rethinking Financial Time-Series",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04465v1",
      "title": "Fraud-Proof Revenue Division on Subscription Platforms",
      "authors": [
        "Abheek Ghosh",
        "Tzeh Yuan Neoh",
        "Nicholas Teh",
        "Giannis Tyrovolas"
      ],
      "abstract": "We study a model of subscription-based platforms where users pay a fixed fee\nfor unlimited access to content, and creators receive a share of the revenue.\nExisting approaches to detecting fraud predominantly rely on machine learning\nmethods, engaging in an ongoing arms race with bad actors. We explore revenue\ndivision mechanisms that inherently disincentivize manipulation. We formalize\nthree types of manipulation-resistance axioms and examine which existing rules\nsatisfy these. We show that a mechanism widely used by streaming platforms, not\nonly fails to prevent fraud, but also makes detecting manipulation\ncomputationally intractable. We also introduce a novel rule, ScaledUserProp,\nthat satisfies all three manipulation-resistance axioms. Finally, experiments\nwith both real-world and synthetic streaming data support ScaledUserProp as a\nfairer alternative compared to existing rules.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.GT",
        "cs.AI",
        "cs.LG",
        "econ.TH"
      ],
      "primary_category": "cs.GT",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04465v1",
        "pdf": "http://arxiv.org/pdf/2511.04465v1"
      },
      "arxiv_id": "2511.04465v1",
      "comment": "Appears in the 42nd International Conference on Machine Learning\n  (ICML), 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04464v1",
      "title": "Beyond Shortest Path: Agentic Vehicular Routing with Semantic Context",
      "authors": [
        "Carnot Braun",
        "Rafael O. Jarczewski",
        "Gabriel U. Talasso",
        "Leandro A. Villas",
        "Allan M. de Souza"
      ],
      "abstract": "Traditional vehicle routing systems efficiently optimize singular metrics\nlike time or distance, and when considering multiple metrics, they need more\nprocesses to optimize . However, they lack the capability to interpret and\nintegrate the complex, semantic, and dynamic contexts of human drivers, such as\nmulti-step tasks, situational constraints, or urgent needs. This paper\nintroduces and evaluates PAVe (Personalized Agentic Vehicular Routing), a\nhybrid agentic assistant designed to augment classical pathfinding algorithms\nwith contextual reasoning. Our approach employs a Large Language Model (LLM)\nagent that operates on a candidate set of routes generated by a multi-objective\n(time, CO2) Dijkstra algorithm. The agent evaluates these options against\nuser-provided tasks, preferences, and avoidance rules by leveraging a\npre-processed geospatial cache of urban Points of Interest (POIs). In a\nbenchmark of realistic urban scenarios, PAVe successfully used complex user\nintent into appropriate route modifications, achieving over 88% accuracy in its\ninitial route selections with a local model. We conclude that combining\nclassical routing algorithms with an LLM-based semantic reasoning layer is a\nrobust and effective approach for creating personalized, adaptive, and scalable\nsolutions for urban mobility optimization.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04464v1",
        "pdf": "http://arxiv.org/pdf/2511.04464v1"
      },
      "arxiv_id": "2511.04464v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04461v1",
      "title": "Data-driven uncertainty-aware seakeeping prediction of the Delft 372 catamaran using ensemble Hankel dynamic mode decomposition",
      "authors": [
        "Giorgio Palma",
        "Andrea Serani",
        "Matteo Diez"
      ],
      "abstract": "In this study, we present and validate an ensemble-based Hankel Dynamic Mode\nDecomposition with control (HDMDc) for uncertainty-aware seakeeping predictions\nof a high-speed catamaran, namely the Delft 372 model. Experimental\nmeasurements (time histories) of wave elevation at the longitudinal center of\ngravity, heave, pitch, notional flight-deck velocity, notional bridge\nacceleration, and total resistance were collected from irregular wave basin\ntests on a 1:33.3 scale replica of the Delft 372 model under sea state 5\nconditions at Fr = 0.425, and organized into training, validation, and test\nsets. The HDMDc algorithm constructs an equation-free linear reduced-order\nmodel of the seakeeping vessel by augmenting states and inputs with their\ntime-lagged copies to capture nonlinear and memory effects. Two ensembling\nstrategies, namely Bayesian HDMDc (BHDMDc), which samples hyperparameters\nconsidered stochastic variables with prior distribution to produce posterior\nmean forecasts with confidence intervals, and Frequentist HDMDc (FHDMDc), which\naggregates multiple model obtained over data subsets, are compared in providing\nseakeeping prediction and uncertainty quantification. The FHDMDc approach is\nfound to improve the accuracy of the predictions compared to the deterministic\ncounterpart, also providing robust uncertainty estimation; whereas the\napplication of BHDMDc to the present test case is not found beneficial in\ncomparison to the deterministic model. FHDMDc-derived probability density\nfunctions for the motions closely match both experimental data and URANS\nresults, demonstrating reliable and computationally efficient seakeeping\nprediction for design and operational support.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "eess.SY",
        "cs.CE",
        "cs.LG",
        "cs.SY"
      ],
      "primary_category": "eess.SY",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04461v1",
        "pdf": "http://arxiv.org/pdf/2511.04461v1"
      },
      "arxiv_id": "2511.04461v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04460v1",
      "title": "V-Thinker: Interactive Thinking with Images",
      "authors": [
        "Runqi Qiao",
        "Qiuna Tan",
        "Minghan Yang",
        "Guanting Dong",
        "Peiqing Yang",
        "Shiqiang Lang",
        "Enhui Wan",
        "Xiaowan Wang",
        "Yida Xu",
        "Lan Yang",
        "Chong Sun",
        "Chen Li",
        "Honggang Zhang"
      ],
      "abstract": "Empowering Large Multimodal Models (LMMs) to deeply integrate image\ninteraction with long-horizon reasoning capabilities remains a long-standing\nchallenge in this field. Recent advances in vision-centric reasoning explore a\npromising \"Thinking with Images\" paradigm for LMMs, marking a shift from\nimage-assisted reasoning to image-interactive thinking. While this milestone\nenables models to focus on fine-grained image regions, progress remains\nconstrained by limited visual tool spaces and task-specific workflow designs.\nTo bridge this gap, we present V-Thinker, a general-purpose multimodal\nreasoning assistant that enables interactive, vision-centric thinking through\nend-to-end reinforcement learning. V-Thinker comprises two key components: (1)\na Data Evolution Flywheel that automatically synthesizes, evolves, and verifies\ninteractive reasoning datasets across three dimensions-diversity, quality, and\ndifficulty; and (2) a Visual Progressive Training Curriculum that first aligns\nperception via point-level supervision, then integrates interactive reasoning\nthrough a two-stage reinforcement learning framework. Furthermore, we introduce\nVTBench, an expert-verified benchmark targeting vision-centric interactive\nreasoning tasks. Extensive experiments demonstrate that V-Thinker consistently\noutperforms strong LMM-based baselines in both general and interactive\nreasoning scenarios, providing valuable insights for advancing\nimage-interactive reasoning applications.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04460v1",
        "pdf": "http://arxiv.org/pdf/2511.04460v1"
      },
      "arxiv_id": "2511.04460v1",
      "comment": "Working in progress",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04456v1",
      "title": "Federated Stochastic Minimax Optimization under Heavy-Tailed Noises",
      "authors": [
        "Xinwen Zhang",
        "Hongchang Gao"
      ],
      "abstract": "Heavy-tailed noise has attracted growing attention in nonconvex stochastic\noptimization, as numerous empirical studies suggest it offers a more realistic\nassumption than standard bounded variance assumption. In this work, we\ninvestigate nonconvex-PL minimax optimization under heavy-tailed gradient noise\nin federated learning. We propose two novel algorithms: Fed-NSGDA-M, which\nintegrates normalized gradients, and FedMuon-DA, which leverages the Muon\noptimizer for local updates. Both algorithms are designed to effectively\naddress heavy-tailed noise in federated minimax optimization, under a milder\ncondition. We theoretically establish that both algorithms achieve a\nconvergence rate of $O({1}/{(TNp)^{\\frac{s-1}{2s}}})$. To the best of our\nknowledge, these are the first federated minimax optimization algorithms with\nrigorous theoretical guarantees under heavy-tailed noise. Extensive experiments\nfurther validate their effectiveness.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04456v1",
        "pdf": "http://arxiv.org/pdf/2511.04456v1"
      },
      "arxiv_id": "2511.04456v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04454v1",
      "title": "Fitting Reinforcement Learning Model to Behavioral Data under Bandits",
      "authors": [
        "Hao Zhu",
        "Jasper Hoffmann",
        "Baohe Zhang",
        "Joschka Boedecker"
      ],
      "abstract": "We consider the problem of fitting a reinforcement learning (RL) model to\nsome given behavioral data under a multi-armed bandit environment. These models\nhave received much attention in recent years for characterizing human and\nanimal decision making behavior. We provide a generic mathematical optimization\nproblem formulation for the fitting problem of a wide range of RL models that\nappear frequently in scientific research applications, followed by a detailed\ntheoretical analysis of its convexity properties. Based on the theoretical\nresults, we introduce a novel solution method for the fitting problem of RL\nmodels based on convex relaxation and optimization. Our method is then\nevaluated in several simulated bandit environments to compare with some\nbenchmark methods that appear in the literature. Numerical results indicate\nthat our method achieves comparable performance to the state-of-the-art, while\nsignificantly reducing computation time. We also provide an open-source Python\npackage for our proposed method to empower researchers to apply it in the\nanalysis of their datasets directly, without prior knowledge of convex\noptimization.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CE",
        "cs.LG",
        "math.OC",
        "q-bio.NC",
        "90C25, 90C59, 90C90"
      ],
      "primary_category": "cs.CE",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04454v1",
        "pdf": "http://arxiv.org/pdf/2511.04454v1"
      },
      "arxiv_id": "2511.04454v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04451v1",
      "title": "Deep Dictionary-Free Method for Identifying Linear Model of Nonlinear System with Input Delay",
      "authors": [
        "Patrik Valábek",
        "Marek Wadinger",
        "Michal Kvasnica",
        "Martin Klaučo"
      ],
      "abstract": "Nonlinear dynamical systems with input delays pose significant challenges for\nprediction, estimation, and control due to their inherent complexity and the\nimpact of delays on system behavior. Traditional linear control techniques\noften fail in these contexts, necessitating innovative approaches. This paper\nintroduces a novel approach to approximate the Koopman operator using an\nLSTM-enhanced Deep Koopman model, enabling linear representations of nonlinear\nsystems with time delays. By incorporating Long Short-Term Memory (LSTM)\nlayers, the proposed framework captures historical dependencies and efficiently\nencodes time-delayed system dynamics into a latent space. Unlike traditional\nextended Dynamic Mode Decomposition (eDMD) approaches that rely on predefined\ndictionaries, the LSTM-enhanced Deep Koopman model is dictionary-free, which\nmitigates the problems with the underlying dynamics being known and\nincorporated into the dictionary. Quantitative comparisons with extended eDMD\non a simulated system demonstrate highly significant performance gains in\nprediction accuracy in cases where the true nonlinear dynamics are unknown and\nachieve comparable results to eDMD with known dynamics of a system.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "eess.SY",
        "cs.AI",
        "cs.LG",
        "cs.SY"
      ],
      "primary_category": "eess.SY",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04451v1",
        "pdf": "http://arxiv.org/pdf/2511.04451v1"
      },
      "arxiv_id": "2511.04451v1",
      "comment": "",
      "journal_ref": "In: 2025 25th International Conference on Process Control (PC).\n  IEEE, 2025. p. 1-6",
      "has_code": false
    },
    {
      "id": "2511.04450v1",
      "title": "Solving Convex Partition Visual Jigsaw Puzzles",
      "authors": [
        "Yaniv Ohayon",
        "Ofir Itzhak Shahar",
        "Ohad Ben-Shahar"
      ],
      "abstract": "Jigsaw puzzle solving requires the rearrangement of unordered pieces into\ntheir original pose in order to reconstruct a coherent whole, often an image,\nand is known to be an intractable problem. While the possible impact of\nautomatic puzzle solvers can be disruptive in various application domains, most\nof the literature has focused on developing solvers for square jigsaw puzzles,\nseverely limiting their practical use. In this work, we significantly expand\nthe types of puzzles handled computationally, focusing on what is known as\nConvex Partitions, a major subset of polygonal puzzles whose pieces are convex.\nWe utilize both geometrical and pictorial compatibilities, introduce a greedy\nsolver, and report several performance measures next to the first benchmark\ndataset of such puzzles.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04450v1",
        "pdf": "http://arxiv.org/pdf/2511.04450v1"
      },
      "arxiv_id": "2511.04450v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04445v1",
      "title": "ForecastGAN: A Decomposition-Based Adversarial Framework for Multi-Horizon Time Series Forecasting",
      "authors": [
        "Syeda Sitara Wishal Fatima",
        "Afshin Rahimi"
      ],
      "abstract": "Time series forecasting is essential across domains from finance to supply\nchain management. This paper introduces ForecastGAN, a novel decomposition\nbased adversarial framework addressing limitations in existing approaches for\nmulti-horizon predictions. Although transformer models excel in long-term\nforecasting, they often underperform in short-term scenarios and typically\nignore categorical features. ForecastGAN operates through three integrated\nmodules: a Decomposition Module that extracts seasonality and trend components;\na Model Selection Module that identifies optimal neural network configurations\nbased on forecasting horizon; and an Adversarial Training Module that enhances\nprediction robustness through Conditional Generative Adversarial Network\ntraining. Unlike conventional approaches, ForecastGAN effectively integrates\nboth numerical and categorical features. We validate our framework on eleven\nbenchmark multivariate time series datasets that span various forecasting\nhorizons. The results show that ForecastGAN consistently outperforms\nstate-of-the-art transformer models for short-term forecasting while remaining\ncompetitive for long-term horizons. This research establishes a more\ngeneralizable approach to time series forecasting that adapts to specific\ncontexts while maintaining strong performance across diverse data\ncharacteristics without extensive hyperparameter tuning.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04445v1",
        "pdf": "http://arxiv.org/pdf/2511.04445v1"
      },
      "arxiv_id": "2511.04445v1",
      "comment": "Portions of this work were previously published in the author's\n  Master's thesis at University of Windsor (2024)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04439v1",
      "title": "The Peril of Preference: Why GRPO fails on Ordinal Rewards",
      "authors": [
        "Anisha Garg",
        "Ganesh Venkatesh"
      ],
      "abstract": "Group-relative Policy Optimization's (GRPO) simplicity makes it highly\ndesirable for adapting LLMs to become experts at specific tasks. But this\nsimplicity also makes it ill-specified as we seek to enhance RL training with\nricher, non-binary feedback. When using ordinal rewards to give partial credit,\nGRPO's simplicity starts to hurt, as its group-average baseline often assigns a\npositive advantage to failed trajectories and reinforces incorrect behavior.\n  We introduce Correctness Relative Policy Optimization (CoRPO), a new\nformulation that solves this flaw. CoRPO uses an adaptive baseline that\nenforces a minimum quality threshold, ensuring failed solutions are never\npositively reinforced. Once the policy consistently meets this threshold, the\nbaseline automatically transitions to a relative preference mode, pushing the\nmodel to find optimal solutions rather than just \"acceptable\" ones. We\nempirically validate CoRPO on a code verification task, where it demonstrates\nmore stable convergence and better out-of-domain generalization.\n  This work represents a critical step in our broader research program to\nenable LLMs to learn genuinely new capabilities through reinforcement learning.\nWe achieve this by enabling LLMs to learn from rich, multi-dimensional feedback\n- progressing from binary to ordinal rewards in this work, and onward to\ndenser, per-step supervision.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04439v1",
        "pdf": "http://arxiv.org/pdf/2511.04439v1"
      },
      "arxiv_id": "2511.04439v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04437v1",
      "title": "Deep Koopman Economic Model Predictive Control of a Pasteurisation Unit",
      "authors": [
        "Patrik Valábek",
        "Michaela Horváthová",
        "Martin Klaučo"
      ],
      "abstract": "This paper presents a deep Koopman-based Economic Model Predictive Control\n(EMPC) for efficient operation of a laboratory-scale pasteurization unit (PU).\nThe method uses Koopman operator theory to transform the complex, nonlinear\nsystem dynamics into a linear representation, enabling the application of\nconvex optimization while representing the complex PU accurately. The deep\nKoopman model utilizes neural networks to learn the linear dynamics from\nexperimental data, achieving a 45% improvement in open-loop prediction accuracy\nover conventional N4SID subspace identification. Both analyzed models were\nemployed in the EMPC formulation that includes interpretable economic costs,\nsuch as energy consumption, material losses due to inadequate pasteurization,\nand actuator wear. The feasibility of EMPC is ensured using slack variables.\nThe deep Koopman EMPC and N4SID EMPC are numerically validated on a nonlinear\nmodel of multivariable PU under external disturbance. The disturbances include\nfeed pump fail-to-close scenario and the introduction of a cold batch to be\npastuerized. These results demonstrate that the deep Koopmand EMPC achieves a\n32% reduction in total economic cost compared to the N4SID baseline. This\nimprovement is mainly due to the reductions in material losses and energy\nconsumption. Furthermore, the steady-state operation via Koopman-based EMPC\nrequires 10.2% less electrical energy. The results highlight the practical\nadvantages of integrating deep Koopman representations with economic\noptimization to achieve resource-efficient control of thermal-intensive plants.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "eess.SY",
        "cs.AI",
        "cs.LG",
        "cs.SY"
      ],
      "primary_category": "eess.SY",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04437v1",
        "pdf": "http://arxiv.org/pdf/2511.04437v1"
      },
      "arxiv_id": "2511.04437v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04427v1",
      "title": "Speed at the Cost of Quality? The Impact of LLM Agent Assistance on Software Development",
      "authors": [
        "Hao He",
        "Courtney Miller",
        "Shyam Agarwal",
        "Christian Kästner",
        "Bogdan Vasilescu"
      ],
      "abstract": "Large language models (LLMs) have demonstrated the promise to revolutionize\nthe field of software engineering. Among other things, LLM agents are rapidly\ngaining momentum in their application to software development, with\npractitioners claiming a multifold productivity increase after adoption. Yet,\nempirical evidence is lacking around these claims. In this paper, we estimate\nthe causal effect of adopting a widely popular LLM agent assistant, namely\nCursor, on development velocity and software quality. The estimation is enabled\nby a state-of-the-art difference-in-differences design comparing\nCursor-adopting GitHub projects with a matched control group of similar GitHub\nprojects that do not use Cursor. We find that the adoption of Cursor leads to a\nsignificant, large, but transient increase in project-level development\nvelocity, along with a significant and persistent increase in static analysis\nwarnings and code complexity. Further panel generalized method of moments\nestimation reveals that the increase in static analysis warnings and code\ncomplexity acts as a major factor causing long-term velocity slowdown. Our\nstudy carries implications for software engineering practitioners, LLM agent\nassistant designers, and researchers.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.SE",
        "cs.AI"
      ],
      "primary_category": "cs.SE",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04427v1",
        "pdf": "http://arxiv.org/pdf/2511.04427v1"
      },
      "arxiv_id": "2511.04427v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04426v1",
      "title": "HideAndSeg: an AI-based tool with automated prompting for octopus segmentation in natural habitats",
      "authors": [
        "Alan de Aguiar",
        "Michaella Pereira Andrade",
        "Charles Morphy D. Santos",
        "João Paulo Gois"
      ],
      "abstract": "Analyzing octopuses in their natural habitats is challenging due to their\ncamouflage capability, rapid changes in skin texture and color, non-rigid body\ndeformations, and frequent occlusions, all of which are compounded by variable\nunderwater lighting and turbidity. Addressing the lack of large-scale annotated\ndatasets, this paper introduces HideAndSeg, a novel, minimally supervised\nAI-based tool for segmenting videos of octopuses. It establishes a quantitative\nbaseline for this task. HideAndSeg integrates SAM2 with a custom-trained\nYOLOv11 object detector. First, the user provides point coordinates to generate\nthe initial segmentation masks with SAM2. These masks serve as training data\nfor the YOLO model. After that, our approach fully automates the pipeline by\nproviding a bounding box prompt to SAM2, eliminating the need for further\nmanual intervention. We introduce two unsupervised metrics - temporal\nconsistency $DICE_t$ and new component count $NC_t$ - to quantitatively\nevaluate segmentation quality and guide mask refinement in the absence of\nground-truth data, i.e., real-world information that serves to train, validate,\nand test AI models. Results show that HideAndSeg achieves satisfactory\nperformance, reducing segmentation noise compared to the manually prompted\napproach. Our method can re-identify and segment the octopus even after periods\nof complete occlusion in natural environments, a scenario in which the manually\nprompted model fails. By reducing the need for manual analysis in real-world\nscenarios, this work provides a practical tool that paves the way for more\nefficient behavioral studies of wild cephalopods.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04426v1",
        "pdf": "http://arxiv.org/pdf/2511.04426v1"
      },
      "arxiv_id": "2511.04426v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04422v1",
      "title": "On the Equivalence of Regression and Classification",
      "authors": [
        "Jayadeva",
        "Naman Dwivedi",
        "Hari Krishnan",
        "N. M. Anoop Krishnan"
      ],
      "abstract": "A formal link between regression and classification has been tenuous. Even\nthough the margin maximization term $\\|w\\|$ is used in support vector\nregression, it has at best been justified as a regularizer. We show that a\nregression problem with $M$ samples lying on a hyperplane has a one-to-one\nequivalence with a linearly separable classification task with $2M$ samples. We\nshow that margin maximization on the equivalent classification task leads to a\ndifferent regression formulation than traditionally used. Using the\nequivalence, we demonstrate a ``regressability'' measure, that can be used to\nestimate the difficulty of regressing a dataset, without needing to first learn\na model for it. We use the equivalence to train neural networks to learn a\nlinearizing map, that transforms input variables into a space where a linear\nregressor is adequate.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CV",
        "68T05, 68T10, 68Q32",
        "I.2.6; I.5.1; I.5.2"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04422v1",
        "pdf": "http://arxiv.org/pdf/2511.04422v1"
      },
      "arxiv_id": "2511.04422v1",
      "comment": "19 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04418v1",
      "title": "The Illusion of Certainty: Uncertainty quantification for LLMs fails under ambiguity",
      "authors": [
        "Tim Tomov",
        "Dominik Fuchsgruber",
        "Tom Wollschläger",
        "Stephan Günnemann"
      ],
      "abstract": "Accurate uncertainty quantification (UQ) in Large Language Models (LLMs) is\ncritical for trustworthy deployment. While real-world language is inherently\nambiguous, reflecting aleatoric uncertainty, existing UQ methods are typically\nbenchmarked against tasks with no ambiguity. In this work, we demonstrate that\nwhile current uncertainty estimators perform well under the restrictive\nassumption of no ambiguity, they degrade to close-to-random performance on\nambiguous data. To this end, we introduce MAQA* and AmbigQA*, the first\nambiguous question-answering (QA) datasets equipped with ground-truth answer\ndistributions estimated from factual co-occurrence. We find this performance\ndeterioration to be consistent across different estimation paradigms: using the\npredictive distribution itself, internal representations throughout the model,\nand an ensemble of models. We show that this phenomenon can be theoretically\nexplained, revealing that predictive-distribution and ensemble-based estimators\nare fundamentally limited under ambiguity. Overall, our study reveals a key\nshortcoming of current UQ methods for LLMs and motivates a rethinking of\ncurrent modeling paradigms.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.CL"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04418v1",
        "pdf": "http://arxiv.org/pdf/2511.04418v1"
      },
      "arxiv_id": "2511.04418v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04403v1",
      "title": "Online Bayesian Experimental Design for Partially Observed Dynamical Systems",
      "authors": [
        "Sara Pérez-Vieites",
        "Sahel Iqbal",
        "Simo Särkkä",
        "Dominik Baumann"
      ],
      "abstract": "Bayesian experimental design (BED) provides a principled framework for\noptimizing data collection, but existing approaches do not apply to crucial\nreal-world settings such as dynamical systems with partial observability, where\nonly noisy and incomplete observations are available. These systems are\nnaturally modeled as state-space models (SSMs), where latent states mediate the\nlink between parameters and data, making the likelihood -- and thus\ninformation-theoretic objectives like the expected information gain (EIG) --\nintractable. In addition, the dynamical nature of the system requires online\nalgorithms that update posterior distributions and select designs sequentially\nin a computationally efficient manner. We address these challenges by deriving\nnew estimators of the EIG and its gradient that explicitly marginalize latent\nstates, enabling scalable stochastic optimization in nonlinear SSMs. Our\napproach leverages nested particle filters (NPFs) for efficient online\ninference with convergence guarantees. Applications to realistic models, such\nas the susceptible-infected-recovered (SIR) and a moving source location task,\nshow that our framework successfully handles both partial observability and\nonline computation.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "stat.ML",
        "cs.LG",
        "stat.CO"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04403v1",
        "pdf": "http://arxiv.org/pdf/2511.04403v1"
      },
      "arxiv_id": "2511.04403v1",
      "comment": "19 pages, 5 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04401v1",
      "title": "Spurious Correlation-Aware Embedding Regularization for Worst-Group Robustness",
      "authors": [
        "Subeen Park",
        "Joowang Kim",
        "Hakyung Lee",
        "Sunjae Yoo",
        "Kyungwoo Song"
      ],
      "abstract": "Deep learning models achieve strong performance across various domains but\noften rely on spurious correlations, making them vulnerable to distribution\nshifts. This issue is particularly severe in subpopulation shift scenarios,\nwhere models struggle in underrepresented groups. While existing methods have\nmade progress in mitigating this issue, their performance gains are still\nconstrained. They lack a rigorous theoretical framework connecting the\nembedding space representations with worst-group error. To address this\nlimitation, we propose Spurious Correlation-Aware Embedding Regularization for\nWorst-Group Robustness (SCER), a novel approach that directly regularizes\nfeature representations to suppress spurious cues. We show theoretically that\nworst-group error is influenced by how strongly the classifier relies on\nspurious versus core directions, identified from differences in group-wise mean\nembeddings across domains and classes. By imposing theoretical constraints at\nthe embedding level, SCER encourages models to focus on core features while\nreducing sensitivity to spurious patterns. Through systematic evaluation on\nmultiple vision and language, we show that SCER outperforms prior\nstate-of-the-art studies in worst-group accuracy. Our code is available at\n\\href{https://github.com/MLAI-Yonsei/SCER}{https://github.com/MLAI-Yonsei/SCER}.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04401v1",
        "pdf": "http://arxiv.org/pdf/2511.04401v1"
      },
      "arxiv_id": "2511.04401v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04394v1",
      "title": "DORAEMON: A Unified Library for Visual Object Modeling and Representation Learning at Scale",
      "authors": [
        "Ke Du",
        "Yimin Peng",
        "Chao Gao",
        "Fan Zhou",
        "Siqiao Xue"
      ],
      "abstract": "DORAEMON is an open-source PyTorch library that unifies visual object\nmodeling and representation learning across diverse scales. A single\nYAML-driven workflow covers classification, retrieval and metric learning; more\nthan 1000 pretrained backbones are exposed through a timm-compatible interface,\ntogether with modular losses, augmentations and distributed-training utilities.\nReproducible recipes match or exceed reference results on ImageNet-1K,\nMS-Celeb-1M and Stanford online products, while one-command export to ONNX or\nHuggingFace bridges research and deployment. By consolidating datasets, models,\nand training techniques into one platform, DORAEMON offers a scalable\nfoundation for rapid experimentation in visual recognition and representation\nlearning, enabling efficient transfer of research advances to real-world\napplications. The repository is available at https://github.com/wuji3/DORAEMON.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04394v1",
        "pdf": "http://arxiv.org/pdf/2511.04394v1"
      },
      "arxiv_id": "2511.04394v1",
      "comment": "code: https://github.com/wuji3/DORAEMON",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.04393v1",
      "title": "Post-Training LLMs as Better Decision-Making Agents: A Regret-Minimization Approach",
      "authors": [
        "Chanwoo Park",
        "Ziyang Chen",
        "Asuman Ozdaglar",
        "Kaiqing Zhang"
      ],
      "abstract": "Large language models (LLMs) are increasingly deployed as \"agents\" for\ndecision-making (DM) in interactive and dynamic environments. Yet, since they\nwere not originally designed for DM, recent studies show that LLMs can struggle\neven in basic online DM problems, failing to achieve low regret or an effective\nexploration-exploitation tradeoff. To address this, we introduce Iterative\nRegret-Minimization Fine-Tuning (Iterative RMFT), a post-training procedure\nthat repeatedly distills low-regret decision trajectories back into the base\nmodel. At each iteration, the model rolls out multiple decision trajectories,\nselects the k-lowest regret ones, and fine-tunes itself on them. Unlike prior\nmethods that (a) distill action sequences from known DM algorithms or (b) rely\non manually crafted chain-of-thought templates, our approach leverages the\nregret metric to elicit the model's own DM ability and reasoning rationales.\nThis reliance on model-generated reasoning avoids rigid output engineering and\nprovides more flexible, natural-language training signals. Empirical results\nshow that Iterative RMFT improves LLMs' DM performance across diverse models -\nfrom Transformers with numerical input/output, to open-weight LLMs, and\nadvanced closed-weight models like GPT-4o mini. Its flexibility in output and\nreasoning formats enables generalization across tasks with varying horizons,\naction spaces, reward processes, and natural-language contexts. Finally, we\nprovide theoretical insight showing that a single-layer Transformer under this\nparadigm can act as a no-regret learner in a simplified setting. Overall,\nIterative RMFT offers a principled and general post-training framework for\nenhancing LLMs' decision-making capabilities.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04393v1",
        "pdf": "http://arxiv.org/pdf/2511.04393v1"
      },
      "arxiv_id": "2511.04393v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04388v1",
      "title": "BoRe-Depth: Self-supervised Monocular Depth Estimation with Boundary Refinement for Embedded Systems",
      "authors": [
        "Chang Liu",
        "Juan Li",
        "Sheng Zhang",
        "Chang Liu",
        "Jie Li",
        "Xu Zhang"
      ],
      "abstract": "Depth estimation is one of the key technologies for realizing 3D perception\nin unmanned systems. Monocular depth estimation has been widely researched\nbecause of its low-cost advantage, but the existing methods face the challenges\nof poor depth estimation performance and blurred object boundaries on embedded\nsystems. In this paper, we propose a novel monocular depth estimation model,\nBoRe-Depth, which contains only 8.7M parameters. It can accurately estimate\ndepth maps on embedded systems and significantly improves boundary quality.\nFirstly, we design an Enhanced Feature Adaptive Fusion Module (EFAF) which\nadaptively fuses depth features to enhance boundary detail representation.\nSecondly, we integrate semantic knowledge into the encoder to improve the\nobject recognition and boundary perception capabilities. Finally, BoRe-Depth is\ndeployed on NVIDIA Jetson Orin, and runs efficiently at 50.7 FPS. We\ndemonstrate that the proposed model significantly outperforms previous\nlightweight models on multiple challenging datasets, and we provide detailed\nablation studies for the proposed methods. The code is available at\nhttps://github.com/liangxiansheng093/BoRe-Depth.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV",
        "cs.RO"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04388v1",
        "pdf": "http://arxiv.org/pdf/2511.04388v1"
      },
      "arxiv_id": "2511.04388v1",
      "comment": "8 pages, 5 figures, published to IROS 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04384v1",
      "title": "Multi-Task Learning for Visually Grounded Reasoning in Gastrointestinal VQA",
      "authors": [
        "Itbaan Safwan",
        "Muhammad Annas Shaikh",
        "Muhammad Haaris",
        "Ramail Khan",
        "Muhammad Atif Tahir"
      ],
      "abstract": "We present a multi-task framework for the MediaEval Medico 2025 challenge,\nleveraging a LoRA-tuned Florence-2 model for simultaneous visual question\nanswering (VQA), explanation generation, and visual grounding. The proposed\nsystem integrates three curated datasets: (1) Kvasir-VQA-x1 for question-answer\nlearning, (2) a synthetically enriched explanation dataset offering structured\nmedical reasoning, and (3) text-to-region pairs linking visual features with\nsegmentation masks. This multi-task setup enables the model to jointly learn\nvisual grounding, reasoning, and interpretation, producing responses that are\nboth accurate and interpretable. Extensive evaluation demonstrates that our\napproach substantially improves over single-task baselines in both answer\naccuracy and visual localization, highlighting the effectiveness of grounded\nmulti-task learning for medical VQA applications.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04384v1",
        "pdf": "http://arxiv.org/pdf/2511.04384v1"
      },
      "arxiv_id": "2511.04384v1",
      "comment": "This is a working paper submitted for Medico 2025: Visual Question\n  Answering (with multimodal explanations) for Gastrointestinal Imaging at\n  MediaEval 2025. 5 pages, 3 figures and 1 table",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04376v1",
      "title": "MusRec: Zero-Shot Text-to-Music Editing via Rectified Flow and Diffusion Transformers",
      "authors": [
        "Ali Boudaghi",
        "Hadi Zare"
      ],
      "abstract": "Music editing has emerged as an important and practical area of artificial\nintelligence, with applications ranging from video game and film music\nproduction to personalizing existing tracks according to user preferences.\nHowever, existing models face significant limitations, such as being restricted\nto editing synthesized music generated by their own models, requiring highly\nprecise prompts, or necessitating task-specific retraining, thus lacking true\nzero-shot capability. Leveraging recent advances in rectified flow and\ndiffusion transformers, we introduce MusRec, the first zero-shot text-to-music\nediting model capable of performing diverse editing tasks on real-world music\nefficiently and effectively. Experimental results demonstrate that our approach\noutperforms existing methods in preserving musical content, structural\nconsistency, and editing fidelity, establishing a strong foundation for\ncontrollable music editing in real-world scenarios.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.SD",
        "cs.AI",
        "cs.LG",
        "cs.MM",
        "eess.AS"
      ],
      "primary_category": "cs.SD",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04376v1",
        "pdf": "http://arxiv.org/pdf/2511.04376v1"
      },
      "arxiv_id": "2511.04376v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04361v1",
      "title": "Causal Regime Detection in Energy Markets With Augmented Time Series Structural Causal Models",
      "authors": [
        "Dennis Thumm"
      ],
      "abstract": "Energy markets exhibit complex causal relationships between weather patterns,\ngeneration technologies, and price formation, with regime changes occurring\ncontinuously rather than at discrete break points. Current approaches model\nelectricity prices without explicit causal interpretation or counterfactual\nreasoning capabilities. We introduce Augmented Time Series Causal Models\n(ATSCM) for energy markets, extending counterfactual reasoning frameworks to\nmultivariate temporal data with learned causal structure. Our approach models\nenergy systems through interpretable factors (weather, generation mix, demand\npatterns), rich grid dynamics, and observable market variables. We integrate\nneural causal discovery to learn time-varying causal graphs without requiring\nground truth DAGs. Applied to real-world electricity price data, ATSCM enables\nnovel counterfactual queries such as \"What would prices be under different\nrenewable generation scenarios?\".",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "q-fin.CP",
        "cs.LG",
        "stat.OT"
      ],
      "primary_category": "q-fin.CP",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04361v1",
        "pdf": "http://arxiv.org/pdf/2511.04361v1"
      },
      "arxiv_id": "2511.04361v1",
      "comment": "EurIPS 2025 Workshop Causality for Impact: Practical challenges for\n  real-world applications of causal methods",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04357v1",
      "title": "GraSP-VLA: Graph-based Symbolic Action Representation for Long-Horizon Planning with VLA Policies",
      "authors": [
        "Maëlic Neau",
        "Zoe Falomir",
        "Paulo E. Santos",
        "Anne-Gwenn Bosser",
        "Cédric Buche"
      ],
      "abstract": "Deploying autonomous robots that can learn new skills from demonstrations is\nan important challenge of modern robotics. Existing solutions often apply\nend-to-end imitation learning with Vision-Language Action (VLA) models or\nsymbolic approaches with Action Model Learning (AML). On the one hand, current\nVLA models are limited by the lack of high-level symbolic planning, which\nhinders their abilities in long-horizon tasks. On the other hand, symbolic\napproaches in AML lack generalization and scalability perspectives. In this\npaper we present a new neuro-symbolic approach, GraSP-VLA, a framework that\nuses a Continuous Scene Graph representation to generate a symbolic\nrepresentation of human demonstrations. This representation is used to generate\nnew planning domains during inference and serves as an orchestrator for\nlow-level VLA policies, scaling up the number of actions that can be reproduced\nin a row. Our results show that GraSP-VLA is effective for modeling symbolic\nrepresentations on the task of automatic planning domain generation from\nobservations. In addition, results on real-world experiments show the potential\nof our Continuous Scene Graph representation to orchestrate low-level VLA\npolicies in long-horizon tasks.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.RO",
        "cs.CV"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04357v1",
        "pdf": "http://arxiv.org/pdf/2511.04357v1"
      },
      "arxiv_id": "2511.04357v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04355v1",
      "title": "Where Do LLMs Still Struggle? An In-Depth Analysis of Code Generation Benchmarks",
      "authors": [
        "Amir Molzam Sharifloo",
        "Maedeh Heydari",
        "Parsa Kazerooni",
        "Daniel Maninger",
        "Mira Mezini"
      ],
      "abstract": "Large Language Models (LLMs) have achieved remarkable success in code\ngeneration, and the race to improve their performance has become a central\nfocus of AI research. Benchmarks and leaderboards are increasingly popular,\noffering quantitative rankings of LLMs. However, they provide limited insight\ninto the tasks that LLMs consistently fail to solve - information that is\ncrucial for understanding current limitations and guiding the development of\nmore capable models. To address this gap, we examined code generation tasks\nacross four popular benchmarks, identifying those that major LLMs are most\nlikely to fail. To understand the causes of these failures, we investigated\nwhether the static complexity of solution code contributes to them, followed by\na systematic inspection of 114 tasks that LLMs consistently struggled with. Our\nanalysis revealed four recurring patterns of weaknesses in LLMs, as well as\ncommon complications within benchmark tasks that most often lead to failure.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.SE",
        "cs.LG"
      ],
      "primary_category": "cs.SE",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04355v1",
        "pdf": "http://arxiv.org/pdf/2511.04355v1"
      },
      "arxiv_id": "2511.04355v1",
      "comment": "To be published in Proceedings of 2025 2nd IEEE/ACM International\n  Conference on AI-powered Software (AIware), Data & Benchmark Track",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04349v1",
      "title": "A MATLAB tutorial on deep feature extraction combined with chemometrics for analytical applications",
      "authors": [
        "Puneet Mishra",
        "Martijntje Vollebregt",
        "Yizhou Ma",
        "Maria Font-i-Furnols"
      ],
      "abstract": "Background In analytical chemistry, spatial information about materials is\ncommonly captured through imaging techniques, such as traditional color cameras\nor with advanced hyperspectral cameras and microscopes. However, efficiently\nextracting and analyzing this spatial information for exploratory and\npredictive purposes remains a challenge, especially when using traditional\nchemometric methods. Recent advances in deep learning and artificial\nintelligence have significantly enhanced image processing capabilities,\nenabling the extraction of multiscale deep features that are otherwise\nchallenging to capture with conventional image processing techniques. Despite\nthe wide availability of open-source deep learning models, adoption in\nanalytical chemistry remains limited because of the absence of structured,\nstep-by-step guidance for implementing these models.\n  Results This tutorial aims to bridge this gap by providing a step-by-step\nguide for applying deep learning approaches to extract spatial information from\nimaging data and integrating it with other data sources, such as spectral\ninformation. Importantly, the focus of this work is not on training deep\nlearning models for image processing but on using existing open source models\nto extract deep features from imaging data.\n  Significance The tutorial provides MATLAB code tutorial demonstrations,\nshowcasing the processing of imaging data from various imaging modalities\ncommonly encountered in analytical chemistry. Readers must run the tutorial\nsteps on their own datasets using the codes presented in this tutorial.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04349v1",
        "pdf": "http://arxiv.org/pdf/2511.04349v1"
      },
      "arxiv_id": "2511.04349v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04347v1",
      "title": "Evaluating the Impact of Weather-Induced Sensor Occlusion on BEVFusion for 3D Object Detection",
      "authors": [
        "Sanjay Kumar",
        "Tim Brophy",
        "Eoin Martino Grua",
        "Ganesh Sistu",
        "Valentina Donzella",
        "Ciaran Eising"
      ],
      "abstract": "Accurate 3D object detection is essential for automated vehicles to navigate\nsafely in complex real-world environments. Bird's Eye View (BEV)\nrepresentations, which project multi-sensor data into a top-down spatial\nformat, have emerged as a powerful approach for robust perception. Although\nBEV-based fusion architectures have demonstrated strong performance through\nmultimodal integration, the effects of sensor occlusions, caused by\nenvironmental conditions such as fog, haze, or physical obstructions, on 3D\ndetection accuracy remain underexplored. In this work, we investigate the\nimpact of occlusions on both camera and Light Detection and Ranging (LiDAR)\noutputs using the BEVFusion architecture, evaluated on the nuScenes dataset.\nDetection performance is measured using mean Average Precision (mAP) and the\nnuScenes Detection Score (NDS). Our results show that moderate camera\nocclusions lead to a 41.3% drop in mAP (from 35.6% to 20.9%) when detection is\nbased only on the camera. On the other hand, LiDAR sharply drops in performance\nonly under heavy occlusion, with mAP falling by 47.3% (from 64.7% to 34.1%),\nwith a severe impact on long-range detection. In fused settings, the effect\ndepends on which sensor is occluded: occluding the camera leads to a minor 4.1%\ndrop (from 68.5% to 65.7%), while occluding LiDAR results in a larger 26.8%\ndrop (to 50.1%), revealing the model's stronger reliance on LiDAR for the task\nof 3D object detection. Our results highlight the need for future research into\nocclusion-aware evaluation methods and improved sensor fusion techniques that\ncan maintain detection accuracy in the presence of partial sensor failure or\ndegradation due to adverse environmental conditions.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04347v1",
        "pdf": "http://arxiv.org/pdf/2511.04347v1"
      },
      "arxiv_id": "2511.04347v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04344v1",
      "title": "Comparative Study of CNN Architectures for Binary Classification of Horses and Motorcycles in the VOC 2008 Dataset",
      "authors": [
        "Muhammad Annas Shaikh",
        "Hamza Zaman",
        "Arbaz Asif"
      ],
      "abstract": "This paper presents a comprehensive evaluation of nine convolutional neural\nnetwork architectures for binary classification of horses and motorcycles in\nthe VOC 2008 dataset. We address the significant class imbalance problem by\nimplementing minority-class augmentation techniques. Our experiments compare\nmodern architectures including ResNet-50, ConvNeXt-Tiny, DenseNet-121, and\nVision Transformer across multiple performance metrics. Results demonstrate\nsubstantial performance variations, with ConvNeXt-Tiny achieving the highest\nAverage Precision (AP) of 95.53% for horse detection and 89.12% for motorcycle\ndetection. We observe that data augmentation significantly improves minority\nclass detection, particularly benefiting deeper architectures. This study\nprovides insights into architecture selection for imbalanced binary\nclassification tasks and quantifies the impact of data augmentation strategies\nin mitigating class imbalance issues in object detection.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04344v1",
        "pdf": "http://arxiv.org/pdf/2511.04344v1"
      },
      "arxiv_id": "2511.04344v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04341v1",
      "title": "Monitor-Generate-Verify (MGV):Formalising Metacognitive Theory for Language Model Reasoning",
      "authors": [
        "Nick Oh",
        "Fernand Gobet"
      ],
      "abstract": "Test-time reasoning architectures such as those following the Generate-Verify\nparadigm -- where a model iteratively refines or verifies its own generated\noutputs -- prioritise generation and verification but exclude the monitoring\nprocesses that determine when and how reasoning should begin. This omission may\ncontribute to the prefix dominance trap, in which models commit early to\nsuboptimal reasoning paths and seldom recover, yielding roughly 20% accuracy\nloss. We address this architectural gap by formalising Flavell's and Nelson and\nNarens' metacognitive theories into computational specifications, proposing the\nMonitor-Generate-Verify (MGV) framework. MGV extends the Generate-Verify\nparadigm by adding explicit monitoring that captures metacognitive experiences\n(from difficulty assessments to confidence judgements) before generation begins\nand refines future monitoring through verification feedback. Though we present\nno empirical validation, this work provides the first systematic computational\ntranslation of foundational metacognitive theories, offering a principled\nvocabulary for understanding reasoning system failures and suggesting specific\narchitectural interventions for future test-time reasoning designs.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04341v1",
        "pdf": "http://arxiv.org/pdf/2511.04341v1"
      },
      "arxiv_id": "2511.04341v1",
      "comment": "To-be presented at the Workshop on the Foundations of Reasoning in\n  Language Models at NeurIPS 2025 (non-archival)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04334v1",
      "title": "Submanifold Sparse Convolutional Networks for Automated 3D Segmentation of Kidneys and Kidney Tumours in Computed Tomography",
      "authors": [
        "Saúl Alonso-Monsalve",
        "Leigh H. Whitehead",
        "Adam Aurisano",
        "Lorena Escudero Sanchez"
      ],
      "abstract": "The accurate delineation of tumours in radiological images like Computed\nTomography is a very specialised and time-consuming task, and currently a\nbottleneck preventing quantitative analyses to be performed routinely in the\nclinical setting. For this reason, developing methods for the automated\nsegmentation of tumours in medical imaging is of the utmost importance and has\ndriven significant efforts in recent years. However, challenges regarding the\nimpracticality of 3D scans, given the large amount of voxels to be analysed,\nusually requires the downsampling of such images or using patches thereof when\napplying traditional convolutional neural networks. To overcome this problem,\nin this paper we propose a new methodology that uses, divided into two stages,\nvoxel sparsification and submanifold sparse convolutional networks. This method\nallows segmentations to be performed with high-resolution inputs and a native\n3D model architecture, obtaining state-of-the-art accuracies while\nsignificantly reducing the computational resources needed in terms of GPU\nmemory and time. We studied the deployment of this methodology in the context\nof Computed Tomography images of renal cancer patients from the KiTS23\nchallenge, and our method achieved results competitive with the challenge\nwinners, with Dice similarity coefficients of 95.8% for kidneys + masses, 85.7%\nfor tumours + cysts, and 80.3% for tumours alone. Crucially, our method also\noffers significant computational improvements, achieving up to a 60% reduction\nin inference time and up to a 75\\% reduction in VRAM usage compared to an\nequivalent dense architecture, across both CPU and various GPU cards tested.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04334v1",
        "pdf": "http://arxiv.org/pdf/2511.04334v1"
      },
      "arxiv_id": "2511.04334v1",
      "comment": "12 pages, 5 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04333v1",
      "title": "LUME-DBN: Full Bayesian Learning of DBNs from Incomplete data in Intensive Care",
      "authors": [
        "Federico Pirola",
        "Fabio Stella",
        "Marco Grzegorczyk"
      ],
      "abstract": "Dynamic Bayesian networks (DBNs) are increasingly used in healthcare due to\ntheir ability to model complex temporal relationships in patient data while\nmaintaining interpretability, an essential feature for clinical\ndecision-making. However, existing approaches to handling missing data in\nlongitudinal clinical datasets are largely derived from static Bayesian\nnetworks literature, failing to properly account for the temporal nature of the\ndata. This gap limits the ability to quantify uncertainty over time, which is\nparticularly critical in settings such as intensive care, where understanding\nthe temporal dynamics is fundamental for model trustworthiness and\napplicability across diverse patient groups. Despite the potential of DBNs, a\nfull Bayesian framework that integrates missing data handling remains\nunderdeveloped. In this work, we propose a novel Gibbs sampling-based method\nfor learning DBNs from incomplete data. Our method treats each missing value as\nan unknown parameter following a Gaussian distribution. At each iteration, the\nunobserved values are sampled from their full conditional distributions,\nallowing for principled imputation and uncertainty estimation. We evaluate our\nmethod on both simulated datasets and real-world intensive care data from\ncritically ill patients. Compared to standard model-agnostic techniques such as\nMICE, our Bayesian approach demonstrates superior reconstruction accuracy and\nconvergence properties. These results highlight the clinical relevance of\nincorporating full Bayesian inference in temporal models, providing more\nreliable imputations and offering deeper insight into model behavior. Our\napproach supports safer and more informed clinical decision-making,\nparticularly in settings where missing data are frequent and potentially\nimpactful.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04333v1",
        "pdf": "http://arxiv.org/pdf/2511.04333v1"
      },
      "arxiv_id": "2511.04333v1",
      "comment": "27 pages, 8 figures, 3 tables, presented at HC@AIxIA + HYDRA 2025\n  Workshop located at ECAI 2025 Conference",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04332v1",
      "title": "Differentially Private In-Context Learning with Nearest Neighbor Search",
      "authors": [
        "Antti Koskela",
        "Tejas Kulkarni",
        "Laith Zumot"
      ],
      "abstract": "Differentially private in-context learning (DP-ICL) has recently become an\nactive research topic due to the inherent privacy risks of in-context learning.\nHowever, existing approaches overlook a critical component of modern large\nlanguage model (LLM) pipelines: the similarity search used to retrieve relevant\ncontext data. In this work, we introduce a DP framework for in-context learning\nthat integrates nearest neighbor search of relevant examples in a privacy-aware\nmanner. Our method outperforms existing baselines by a substantial margin\nacross all evaluated benchmarks, achieving more favorable privacy-utility\ntrade-offs. To achieve this, we employ nearest neighbor retrieval from a\ndatabase of context data, combined with a privacy filter that tracks the\ncumulative privacy cost of selected samples to ensure adherence to a central\ndifferential privacy budget. Experimental results on text classification and\ndocument question answering show a clear advantage of the proposed method over\nexisting baselines.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CR"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04332v1",
        "pdf": "http://arxiv.org/pdf/2511.04332v1"
      },
      "arxiv_id": "2511.04332v1",
      "comment": "NeurIPS Lock-LLM Workshop 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.04328v1",
      "title": "RxSafeBench: Identifying Medication Safety Issues of Large Language Models in Simulated Consultation",
      "authors": [
        "Jiahao Zhao",
        "Luxin Xu",
        "Minghuan Tan",
        "Lichao Zhang",
        "Ahmadreza Argha",
        "Hamid Alinejad-Rokny",
        "Min Yang"
      ],
      "abstract": "Numerous medical systems powered by Large Language Models (LLMs) have\nachieved remarkable progress in diverse healthcare tasks. However, research on\ntheir medication safety remains limited due to the lack of real world datasets,\nconstrained by privacy and accessibility issues. Moreover, evaluation of LLMs\nin realistic clinical consultation settings, particularly regarding medication\nsafety, is still underexplored. To address these gaps, we propose a framework\nthat simulates and evaluates clinical consultations to systematically assess\nthe medication safety capabilities of LLMs. Within this framework, we generate\ninquiry diagnosis dialogues with embedded medication risks and construct a\ndedicated medication safety database, RxRisk DB, containing 6,725\ncontraindications, 28,781 drug interactions, and 14,906 indication-drug pairs.\nA two-stage filtering strategy ensures clinical realism and professional\nquality, resulting in the benchmark RxSafeBench with 2,443 high-quality\nconsultation scenarios. We evaluate leading open-source and proprietary LLMs\nusing structured multiple choice questions that test their ability to recommend\nsafe medications under simulated patient contexts. Results show that current\nLLMs struggle to integrate contraindication and interaction knowledge,\nespecially when risks are implied rather than explicit. Our findings highlight\nkey challenges in ensuring medication safety in LLM-based systems and provide\ninsights into improving reliability through better prompting and task-specific\ntuning. RxSafeBench offers the first comprehensive benchmark for evaluating\nmedication safety in LLMs, advancing safer and more trustworthy AI-driven\nclinical decision support.",
      "published": "2025-11-06",
      "updated": "2025-11-06",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.04328v1",
        "pdf": "http://arxiv.org/pdf/2511.04328v1"
      },
      "arxiv_id": "2511.04328v1",
      "comment": "To appear in BIBM2025",
      "journal_ref": "",
      "has_code": false
    }
  ]
}