{
  "fetched_at": "2025-11-28T00:25:05.746491",
  "total_papers": 100,
  "papers": [
    {
      "id": "2511.21692v1",
      "title": "Revisiting Generalization Across Difficulty Levels: It's Not So Easy",
      "authors": [
        "Yeganeh Kordi",
        "Nihal V. Nayak",
        "Max Zuo",
        "Ilana Nguyen",
        "Stephen H. Bach"
      ],
      "abstract": "We investigate how well large language models (LLMs) generalize across different task difficulties, a key question for effective data curation and evaluation. Existing research is mixed regarding whether training on easier or harder data leads to better results, and whether those gains come on easier or harder test data. We address this question by conducting a systematic evaluation of LLMs' generalization across models, datasets, and fine-grained groups of example difficulty. We rank examples in six datasets using the outputs of thousands of different LLMs and Item Response Theory (IRT), a well-established difficulty metric in educational testing. Unlike prior work, our difficulty ratings are therefore determined solely by the abilities of many different LLMs, excluding human opinions of difficulty. With a more objective, larger-scale, and finer-grained analysis, we show that cross-difficulty generalization is often limited; training on either easy or hard data cannot achieve consistent improvements across the full range of difficulties. These results show the importance of having a range of difficulties in both training and evaluation data for LLMs, and that taking shortcuts with respect to difficulty is risky.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21692v1",
        "pdf": "https://arxiv.org/pdf/2511.21692v1"
      },
      "arxiv_id": "2511.21692v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21691v1",
      "title": "Canvas-to-Image: Compositional Image Generation with Multimodal Controls",
      "authors": [
        "Yusuf Dalva",
        "Guocheng Gordon Qian",
        "Maya Goldenberg",
        "Tsai-Shien Chen",
        "Kfir Aberman",
        "Sergey Tulyakov",
        "Pinar Yanardag",
        "Kuan-Chieh Jackson Wang"
      ],
      "abstract": "While modern diffusion models excel at generating high-quality and diverse images, they still struggle with high-fidelity compositional and multimodal control, particularly when users simultaneously specify text prompts, subject references, spatial arrangements, pose constraints, and layout annotations. We introduce Canvas-to-Image, a unified framework that consolidates these heterogeneous controls into a single canvas interface, enabling users to generate images that faithfully reflect their intent. Our key idea is to encode diverse control signals into a single composite canvas image that the model can directly interpret for integrated visual-spatial reasoning. We further curate a suite of multi-task datasets and propose a Multi-Task Canvas Training strategy that optimizes the diffusion model to jointly understand and integrate heterogeneous controls into text-to-image generation within a unified learning paradigm. This joint training enables Canvas-to-Image to reason across multiple control modalities rather than relying on task-specific heuristics, and it generalizes well to multi-control scenarios during inference. Extensive experiments show that Canvas-to-Image significantly outperforms state-of-the-art methods in identity preservation and control adherence across challenging benchmarks, including multi-person composition, pose-controlled composition, layout-constrained generation, and multi-control generation.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21691v1",
        "pdf": "https://arxiv.org/pdf/2511.21691v1"
      },
      "arxiv_id": "2511.21691v1",
      "comment": "24 pages; webpage: https://snap-research.github.io/canvas-to-image/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.21690v1",
      "title": "TraceGen: World Modeling in 3D Trace Space Enables Learning from Cross-Embodiment Videos",
      "authors": [
        "Seungjae Lee",
        "Yoonkyo Jung",
        "Inkook Chun",
        "Yao-Chih Lee",
        "Zikui Cai",
        "Hongjia Huang",
        "Aayush Talreja",
        "Tan Dat Dao",
        "Yongyuan Liang",
        "Jia-Bin Huang",
        "Furong Huang"
      ],
      "abstract": "Learning new robot tasks on new platforms and in new scenes from only a handful of demonstrations remains challenging. While videos of other embodiments - humans and different robots - are abundant, differences in embodiment, camera, and environment hinder their direct use. We address the small-data problem by introducing a unifying, symbolic representation - a compact 3D \"trace-space\" of scene-level trajectories - that enables learning from cross-embodiment, cross-environment, and cross-task videos. We present TraceGen, a world model that predicts future motion in trace-space rather than pixel space, abstracting away appearance while retaining the geometric structure needed for manipulation. To train TraceGen at scale, we develop TraceForge, a data pipeline that transforms heterogeneous human and robot videos into consistent 3D traces, yielding a corpus of 123K videos and 1.8M observation-trace-language triplets. Pretraining on this corpus produces a transferable 3D motion prior that adapts efficiently: with just five target robot videos, TraceGen attains 80% success across four tasks while offering 50-600x faster inference than state-of-the-art video-based world models. In the more challenging case where only five uncalibrated human demonstration videos captured on a handheld phone are available, it still reaches 67.5% success on a real robot, highlighting TraceGen's ability to adapt across embodiments without relying on object detectors or heavy pixel-space generation.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.RO",
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21690v1",
        "pdf": "https://arxiv.org/pdf/2511.21690v1"
      },
      "arxiv_id": "2511.21690v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21689v1",
      "title": "ToolOrchestra: Elevating Intelligence via Efficient Model and Tool Orchestration",
      "authors": [
        "Hongjin Su",
        "Shizhe Diao",
        "Ximing Lu",
        "Mingjie Liu",
        "Jiacheng Xu",
        "Xin Dong",
        "Yonggan Fu",
        "Peter Belcak",
        "Hanrong Ye",
        "Hongxu Yin",
        "Yi Dong",
        "Evelina Bakhturina",
        "Tao Yu",
        "Yejin Choi",
        "Jan Kautz",
        "Pavlo Molchanov"
      ],
      "abstract": "Large language models are powerful generalists, yet solving deep and complex problems such as those of the Humanity's Last Exam (HLE) remains both conceptually challenging and computationally expensive. We show that small orchestrators managing other models and a variety of tools can both push the upper bound of intelligence and improve efficiency in solving difficult agentic tasks. We introduce ToolOrchestra, a method for training small orchestrators that coordinate intelligent tools. ToolOrchestra explicitly uses reinforcement learning with outcome-, efficiency-, and user-preference-aware rewards. Using ToolOrchestra, we produce Orchestrator, an 8B model that achieves higher accuracy at lower cost than previous tool-use agents while aligning with user preferences on which tools are to be used for a given query. On HLE, Orchestrator achieves a score of 37.1%, outperforming GPT-5 (35.1%) while being 2.5x more efficient. On tau2-Bench and FRAMES, Orchestrator surpasses GPT-5 by a wide margin while using only about 30% of the cost. Extensive analysis shows that Orchestrator achieves the best trade-off between performance and cost under multiple metrics, and generalizes robustly to unseen tools. These results demonstrate that composing diverse tools with a lightweight orchestration model is both more efficient and more effective than existing methods, paving the way for practical and scalable tool-augmented reasoning systems.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG",
        "cs.MA"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21689v1",
        "pdf": "https://arxiv.org/pdf/2511.21689v1"
      },
      "arxiv_id": "2511.21689v1",
      "comment": "21 pages, 6 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21688v1",
      "title": "G$^2$VLM: Geometry Grounded Vision Language Model with Unified 3D Reconstruction and Spatial Reasoning",
      "authors": [
        "Wenbo Hu",
        "Jingli Lin",
        "Yilin Long",
        "Yunlong Ran",
        "Lihan Jiang",
        "Yifan Wang",
        "Chenming Zhu",
        "Runsen Xu",
        "Tai Wang",
        "Jiangmiao Pang"
      ],
      "abstract": "Vision-Language Models (VLMs) still lack robustness in spatial intelligence, demonstrating poor performance on spatial understanding and reasoning tasks. We attribute this gap to the absence of a visual geometry learning process capable of reconstructing 3D space from 2D images. We present G$^2$VLM, a geometry grounded vision-language model that bridges two fundamental aspects of spatial intelligence: spatial 3D reconstruction and spatial understanding. G$^2$VLM natively leverages learned 3D visual geometry features to directly predict 3D attributes and enhance spatial reasoning tasks via in-context learning and interleaved reasoning. Our unified design is highly scalable for spatial understanding: it trains on abundant multi-view image and video data, while simultaneously leveraging the benefits of 3D visual priors that are typically only derived from hard-to-collect annotations. Experimental results demonstrate G$^2$VLM is proficient in both tasks, achieving comparable results to state-of-the-art feed-forward 3D reconstruction models and achieving better or competitive results across spatial understanding and reasoning tasks. By unifying a semantically strong VLM with low-level 3D vision tasks, we hope G$^2$VLM can serve as a strong baseline for the community and unlock more future applications, such as 3D scene editing.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21688v1",
        "pdf": "https://arxiv.org/pdf/2511.21688v1"
      },
      "arxiv_id": "2511.21688v1",
      "comment": "code are released at https://github.com/InternRobotics/G2VLM",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.21686v1",
      "title": "Matrix: Peer-to-Peer Multi-Agent Synthetic Data Generation Framework",
      "authors": [
        "Dong Wang",
        "Yang Li",
        "Ansong Ni",
        "Ching-Feng Yeh",
        "Youssef Emad",
        "Xinjie Lei",
        "Liam Robbins",
        "Karthik Padthe",
        "Hu Xu",
        "Xian Li",
        "Asli Celikyilmaz",
        "Ramya Raghavendra",
        "Lifei Huang",
        "Carole-Jean Wu",
        "Shang-Wen Li"
      ],
      "abstract": "Synthetic data has become increasingly important for training large language models, especially when real data is scarce, expensive, or privacy-sensitive. Many such generation tasks require coordinated multi-agent workflows, where specialized agents collaborate to produce data that is higher quality, more diverse, and structurally richer. However, existing frameworks for multi-agent synthesis often depend on a centralized orchestrator, creating scalability bottlenecks, or are hardcoded for specific domains, limiting flexibility. We present \\textbf{Matrix}, a decentralized framework that represents both control and data flow as serialized messages passed through distributed queues. This peer-to-peer design eliminates the central orchestrator. Each task progresses independently through lightweight agents, while compute-intensive operations, such as LLM inference or containerized environments, are handled by distributed services. Built on Ray, Matrix scales to tens of thousands of concurrent agentic workflows and provides a modular, configurable design that enables easy adaptation to a wide range of data generation workflows. We evaluate Matrix across diverse synthesis scenarios, such as multi-agent collaborative dialogue, web-based reasoning data extraction, and tool-use trajectory generation in customer service environments. In all cases, Matrix achieves $2$--$15\\times$ higher data generation throughput under identical hardware resources, without compromising output quality.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21686v1",
        "pdf": "https://arxiv.org/pdf/2511.21686v1"
      },
      "arxiv_id": "2511.21686v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21681v1",
      "title": "Seeing without Pixels: Perception from Camera Trajectories",
      "authors": [
        "Zihui Xue",
        "Kristen Grauman",
        "Dima Damen",
        "Andrew Zisserman",
        "Tengda Han"
      ],
      "abstract": "Can one perceive a video's content without seeing its pixels, just from the camera trajectory-the path it carves through space? This paper is the first to systematically investigate this seemingly implausible question. Towards this end, we propose a contrastive learning framework to train CamFormer, a dedicated encoder that projects camera pose trajectories into a joint embedding space, aligning them with natural language. We find that, contrary to its apparent simplicity, the camera trajectory is a remarkably informative signal to uncover video content. In other words, \"how you move\" can indeed reveal \"what you are doing\" (egocentric) or \"observing\" (exocentric). We demonstrate the versatility of our learned CamFormer embeddings on a diverse suite of downstream tasks, ranging from cross-modal alignment to classification and temporal analysis. Importantly, our representations are robust across diverse camera pose estimation methods, including both high-fidelity multi-sensored and standard RGB-only estimators. Our findings establish camera trajectory as a lightweight, robust, and versatile modality for perceiving video content.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21681v1",
        "pdf": "https://arxiv.org/pdf/2511.21681v1"
      },
      "arxiv_id": "2511.21681v1",
      "comment": "Project website: https://sites.google.com/view/seeing-without-pixels",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21678v1",
      "title": "Agentic Learner with Grow-and-Refine Multimodal Semantic Memory",
      "authors": [
        "Weihao Bo",
        "Shan Zhang",
        "Yanpeng Sun",
        "Jingjing Wu",
        "Qunyi Xie",
        "Xiao Tan",
        "Kunbin Chen",
        "Wei He",
        "Xiaofan Li",
        "Na Zhao",
        "Jingdong Wang",
        "Zechao Li"
      ],
      "abstract": "MLLMs exhibit strong reasoning on isolated queries, yet they operate de novo -- solving each problem independently and often repeating the same mistakes. Existing memory-augmented agents mainly store past trajectories for reuse. However, trajectory-based memory suffers from brevity bias, gradually losing essential domain knowledge. More critically, even in truly multimodal problem-solving settings, it records only a single-modality trace of past behavior, failing to preserve how visual attention and logical reasoning jointly contributed to the solution. This is fundamentally misaligned with human cognition: semantic memory is both multimodal and integrated, preserving visual and abstract knowledge through coordinated but distinct representational streams. We thus introduce ViLoMem, a dual-stream memory framework that constructs compact, schema-based memory. It separately encodes visual distraction patterns and logical reasoning errors, enabling MLLMs to learn from their successful and failed experiences. Following a grow-and-refine principle, the system incrementally accumulates and updates multimodal semantic knowledge -- preserving stable, generalizable strategies while avoiding catastrophic forgetting. Across six multimodal benchmarks, ViLoMem consistently improves pass@1 accuracy and substantially reduces repeated visual and logical errors. Ablations confirm the necessity of dual-stream memory with explicit distraction--hallucination separation, demonstrating the value of error-aware multimodal memory for lifelong and cross-domain agentic learning. Our project page will be available at https://weihao-bo.github.io/ViLoMeo-page.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21678v1",
        "pdf": "https://arxiv.org/pdf/2511.21678v1"
      },
      "arxiv_id": "2511.21678v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21675v1",
      "title": "On Evolution-Based Models for Experimentation Under Interference",
      "authors": [
        "Sadegh Shirani",
        "Mohsen Bayati"
      ],
      "abstract": "Causal effect estimation in networked systems is central to data-driven decision making. In such settings, interventions on one unit can spill over to others, and in complex physical or social systems, the interaction pathways driving these interference structures remain largely unobserved. We argue that for identifying population-level causal effects, it is not necessary to recover the exact network structure; instead, it suffices to characterize how those interactions contribute to the evolution of outcomes. Building on this principle, we study an evolution-based approach that investigates how outcomes change across observation rounds in response to interventions, hence compensating for missing network information. Using an exposure-mapping perspective, we give an axiomatic characterization of when the empirical distribution of outcomes follows a low-dimensional recursive equation, and identify minimal structural conditions under which such evolution mappings exist. We frame this as a distributional counterpart to difference-in-differences. Rather than assuming parallel paths for individual units, it exploits parallel evolution patterns across treatment scenarios to estimate counterfactual trajectories. A key insight is that treatment randomization plays a role beyond eliminating latent confounding; it induces an implicit sampling from hidden interference channels, enabling consistent learning about heterogeneous spillover effects. We highlight causal message passing as an instantiation of this method in dense networks while extending to more general interference structures, including influencer networks where a small set of units drives most spillovers. Finally, we discuss the limits of this approach, showing that strong temporal trends or endogenous interference can undermine identification.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "stat.ML",
        "cs.LG",
        "cs.SI",
        "econ.EM"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21675v1",
        "pdf": "https://arxiv.org/pdf/2511.21675v1"
      },
      "arxiv_id": "2511.21675v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21673v1",
      "title": "Revolutionizing Glioma Segmentation & Grading Using 3D MRI - Guided Hybrid Deep Learning Models",
      "authors": [
        "Pandiyaraju V",
        "Sreya Mynampati",
        "Abishek Karthik",
        "Poovarasan L",
        "D. Saraswathi"
      ],
      "abstract": "Gliomas are brain tumor types that have a high mortality rate which means early and accurate diagnosis is important for therapeutic intervention for the tumors. To address this difficulty, the proposed research will develop a hybrid deep learning model which integrates U-Net based segmentation and a hybrid DenseNet-VGG classification network with multihead attention and spatial-channel attention capabilities. The segmentation model will precisely demarcate the tumors in a 3D volume of MRI data guided by spatial and contextual information. The classification network which combines a branch of both DenseNet and VGG, will incorporate the demarcated tumor on which features with attention mechanisms would be focused on clinically relevant features. High-dimensional 3D MRI data could successfully be utilized in the model through preprocessing steps which are normalization, resampling, and data augmentation. Through a variety of measures the framework is evaluated: measures of performance in segmentation are Dice coefficient and Mean Intersection over Union (IoU) and measures of performance in classification are accuracy precision, recall, and F1-score. The hybrid framework that has been proposed has demonstrated through physical testing that it has the capability of obtaining a Dice coefficient of 98% in tumor segmentation, and 99% on classification accuracy, outperforming traditional CNN models and attention-free methods. Utilizing multi-head attention mechanisms enhances notions of priority in aspects of the tumor that are clinically significant, and enhances interpretability and accuracy. The results suggest a great potential of the framework in facilitating the timely and reliable diagnosis and grading of glioma by clinicians is promising, allowing for better planning of patient treatment.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21673v1",
        "pdf": "https://arxiv.org/pdf/2511.21673v1"
      },
      "arxiv_id": "2511.21673v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21669v1",
      "title": "DSD: A Distributed Speculative Decoding Solution for Edge-Cloud Agile Large Model Serving",
      "authors": [
        "Fengze Yu",
        "Leshu Li",
        "Brad McDanel",
        "Saiqian Zhang"
      ],
      "abstract": "Large language model (LLM) inference often suffers from high decoding latency and limited scalability across heterogeneous edge-cloud environments. Existing speculative decoding (SD) techniques accelerate token generation but remain confined to single-node execution. We propose DSD, a distributed speculative decoding framework that extends SD to multi-device deployments through coordinated draft-target execution. Given the lack of prior work on simulating this paradigm, we first introduce DSD-Sim, a discrete-event simulator that captures network, batching, and scheduling dynamics. Building on insights from DSD-Sim, we further design an Adaptive Window Control (AWC) policy that dynamically adjusts speculation window size to optimize throughput. Experiments across diverse workloads show that DSD achieves up to 1.1x speedup and 9.7% higher throughput over existing SD baselines, enabling agile and scalable LLM serving across edge and cloud.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.DC"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21669v1",
        "pdf": "https://arxiv.org/pdf/2511.21669v1"
      },
      "arxiv_id": "2511.21669v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21668v1",
      "title": "Through the telecom lens: Are all training samples important?",
      "authors": [
        "Shruti Bothe",
        "Illyyne Saffar",
        "Aurelie Boisbunon",
        "Hasan Farooq",
        "Julien Forgeat",
        "Md Moin Uddin Chowdhury"
      ],
      "abstract": "The rise of AI in telecommunications, from optimizing Radio Access Networks to managing user experience, has sharply increased data volumes and training demands. Telecom data is often noisy, high-dimensional, costly to store, process, and label. Despite Ai's critical role, standard workflows still assume all training samples contribute equally. On the other hand, next generation systems require AI models that are accurate, efficient, and sustainable.The paper questions the assumptions of equal importance by focusing on applying and analyzing the roles of individual samples in telecom training and assessing whether the proposed model optimizes computation and energy use. we perform sample-level gradient analysis across epochs to identify patterns of influence and redundancy in model learning. Based on this, we propose a sample importance framework thats electively prioritizes impactful data and reduces computation without compromising accuracy. Experiments on three real-world telecom datasets show that our method [reserves performance while reducing data needs and computational overhead while advancing the goals of sustainable AI in telecommunications.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21668v1",
        "pdf": "https://arxiv.org/pdf/2511.21668v1"
      },
      "arxiv_id": "2511.21668v1",
      "comment": "8pages, 1 table, 8 figures",
      "journal_ref": "39th Conference on Neural Information Processing Systems (NeurIPS 2025) Workshop: AI and ML for Next-Generation Wireless Communications and Networking (AI4NextG)",
      "has_code": false
    },
    {
      "id": "2511.21667v1",
      "title": "Escaping the Verifier: Learning to Reason via Demonstrations",
      "authors": [
        "Locke Cai",
        "Ivan Provilkov"
      ],
      "abstract": "Training Large Language Models (LLMs) to reason often relies on Reinforcement Learning (RL) with task-specific verifiers. However, many real-world reasoning-intensive tasks lack verifiers, despite offering abundant expert demonstrations that remain under-utilized for reasoning-focused training. We introduce RARO (Relativistic Adversarial Reasoning Optimization) that learns strong reasoning capabilities from only expert demonstrations via Inverse Reinforcement Learning. Our method sets up an adversarial interaction between a policy (generator) and a relativistic critic (discriminator): the policy learns to mimic expert answers, while the critic learns to compare and distinguish between policy and expert answers. Our method trains both the policy and the critic jointly and continuously via RL, and we identify the key stabilization techniques required for robust learning. Empirically, RARO significantly outperforms strong verifier-free baselines on all of our evaluation tasks -- Countdown, DeepMath, and Poetry Writing -- and enjoys the same robust scaling trends as RL on verifiable tasks. These results demonstrate that our method effectively elicits strong reasoning performance from expert demonstrations alone, enabling robust reasoning learning even when task-specific verifiers are unavailable.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21667v1",
        "pdf": "https://arxiv.org/pdf/2511.21667v1"
      },
      "arxiv_id": "2511.21667v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21666v1",
      "title": "Uncertainty Quantification for Visual Object Pose Estimation",
      "authors": [
        "Lorenzo Shaikewitz",
        "Charis Georgiou",
        "Luca Carlone"
      ],
      "abstract": "Quantifying the uncertainty of an object's pose estimate is essential for robust control and planning. Although pose estimation is a well-studied robotics problem, attaching statistically rigorous uncertainty is not well understood without strict distributional assumptions. We develop distribution-free pose uncertainty bounds about a given pose estimate in the monocular setting. Our pose uncertainty only requires high probability noise bounds on pixel detections of 2D semantic keypoints on a known object. This noise model induces an implicit, non-convex set of pose uncertainty constraints. Our key contribution is SLUE (S-Lemma Uncertainty Estimation), a convex program to reduce this set to a single ellipsoidal uncertainty bound that is guaranteed to contain the true object pose with high probability. SLUE solves a relaxation of the minimum volume bounding ellipsoid problem inspired by the celebrated S-lemma. It requires no initial guess of the bound's shape or size and is guaranteed to contain the true object pose with high probability. For tighter uncertainty bounds at the same confidence, we extend SLUE to a sum-of-squares relaxation hierarchy which is guaranteed to converge to the minimum volume ellipsoidal uncertainty bound for a given set of keypoint constraints. We show this pose uncertainty bound can easily be projected to independent translation and axis-angle orientation bounds. We evaluate SLUE on two pose estimation datasets and a real-world drone tracking scenario. Compared to prior work, SLUE generates substantially smaller translation bounds and competitive orientation bounds. We release code at https://github.com/MIT-SPARK/PoseUncertaintySets.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.RO",
        "cs.CV"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21666v1",
        "pdf": "https://arxiv.org/pdf/2511.21666v1"
      },
      "arxiv_id": "2511.21666v1",
      "comment": "18 pages, 9 figures. Code available: https://github.com/MIT-SPARK/PoseUncertaintySets",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.21663v1",
      "title": "Attention-Guided Patch-Wise Sparse Adversarial Attacks on Vision-Language-Action Models",
      "authors": [
        "Naifu Zhang",
        "Wei Tao",
        "Xi Xiao",
        "Qianpu Sun",
        "Yuxin Zheng",
        "Wentao Mo",
        "Peiqiang Wang",
        "Nan Zhang"
      ],
      "abstract": "In recent years, Vision-Language-Action (VLA) models in embodied intelligence have developed rapidly. However, existing adversarial attack methods require costly end-to-end training and often generate noticeable perturbation patches. To address these limitations, we propose ADVLA, a framework that directly applies adversarial perturbations on features projected from the visual encoder into the textual feature space. ADVLA efficiently disrupts downstream action predictions under low-amplitude constraints, and attention guidance allows the perturbations to be both focused and sparse. We introduce three strategies that enhance sensitivity, enforce sparsity, and concentrate perturbations. Experiments demonstrate that under an $L_{\\infty}=4/255$ constraint, ADVLA combined with Top-K masking modifies less than 10% of the patches while achieving an attack success rate of nearly 100%. The perturbations are concentrated on critical regions, remain almost imperceptible in the overall image, and a single-step iteration takes only about 0.06 seconds, significantly outperforming conventional patch-based attacks. In summary, ADVLA effectively weakens downstream action predictions of VLA models under low-amplitude and locally sparse conditions, avoiding the high training costs and conspicuous perturbations of traditional patch attacks, and demonstrates unique effectiveness and practical value for attacking VLA feature spaces.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21663v1",
        "pdf": "https://arxiv.org/pdf/2511.21663v1"
      },
      "arxiv_id": "2511.21663v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21662v1",
      "title": "Multi-Crit: Benchmarking Multimodal Judges on Pluralistic Criteria-Following",
      "authors": [
        "Tianyi Xiong",
        "Yi Ge",
        "Ming Li",
        "Zuolong Zhang",
        "Pranav Kulkarni",
        "Kaishen Wang",
        "Qi He",
        "Zeying Zhu",
        "Chenxi Liu",
        "Ruibo Chen",
        "Tong Zheng",
        "Yanshuo Chen",
        "Xiyao Wang",
        "Renrui Zhang",
        "Wenhu Chen",
        "Heng Huang"
      ],
      "abstract": "Large multimodal models (LMMs) are increasingly adopted as judges in multimodal evaluation systems due to their strong instruction following and consistency with human preferences. However, their ability to follow diverse, fine-grained evaluation criteria remains underexplored. We develop Multi-Crit, a benchmark for evaluating multimodal judges on their capacity to follow pluralistic criteria and produce reliable criterion-level judgments. Covering both open-ended generation and verifiable reasoning tasks, Multi-Crit is built through a rigorous data curation pipeline that gathers challenging response pairs with multi-criterion human annotations. It further introduces three novel metrics for systematically assessing pluralistic adherence, criterion-switching flexibility, and the ability to recognize criterion-level preference conflicts. Comprehensive analysis of 25 LMMs reveals that 1) proprietary models still struggle to maintain consistent adherence to pluralistic criteria--especially in open-ended evaluation; 2) open-source models lag further behind in flexibly following diverse criteria; and 3) critic fine-tuning with holistic judgment signals enhances visual grounding but fails to generalize to pluralistic criterion-level judgment. Additional analyses on reasoning fine-tuning, test-time scaling, and boundary consistency between open-source and proprietary models further probe the limits of current multimodal judges. As a pioneering study, Multi-Crit lays the foundation for building reliable and steerable multimodal AI evaluation.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21662v1",
        "pdf": "https://arxiv.org/pdf/2511.21662v1"
      },
      "arxiv_id": "2511.21662v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21654v1",
      "title": "EvilGenie: A Reward Hacking Benchmark",
      "authors": [
        "Jonathan Gabor",
        "Jayson Lynch",
        "Jonathan Rosenfeld"
      ],
      "abstract": "We introduce EvilGenie, a benchmark for reward hacking in programming settings. We source problems from LiveCodeBench and create an environment in which agents can easily reward hack, such as by hardcoding test cases or editing the testing files. We measure reward hacking in three ways: held out unit tests, LLM judges, and test file edit detection. We verify these methods against human review and each other. We find the LLM judge to be highly effective at detecting reward hacking in unambiguous cases, and observe only minimal improvement from the use of held out test cases. In addition to testing many models using Inspect's basic_agent scaffold, we also measure reward hacking rates for three popular proprietary coding agents: OpenAI's Codex, Anthropic's Claude Code, and Google's Gemini CLI Using GPT-5, Claude Sonnet 4, and Gemini 2.5 Pro, respectively. We observe explicit reward hacking by both Codex and Claude Code, and misaligned behavior by all three agents. Our codebase can be found at https://github.com/JonathanGabor/EvilGenie.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21654v1",
        "pdf": "https://arxiv.org/pdf/2511.21654v1"
      },
      "arxiv_id": "2511.21654v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21653v1",
      "title": "CaFlow: Enhancing Long-Term Action Quality Assessment with Causal Counterfactual Flow",
      "authors": [
        "Ruisheng Han",
        "Kanglei Zhou",
        "Shuang Chen",
        "Amir Atapour-Abarghouei",
        "Hubert P. H. Shum"
      ],
      "abstract": "Action Quality Assessment (AQA) predicts fine-grained execution scores from action videos and is widely applied in sports, rehabilitation, and skill evaluation. Long-term AQA, as in figure skating or rhythmic gymnastics, is especially challenging since it requires modeling extended temporal dynamics while remaining robust to contextual confounders. Existing approaches either depend on costly annotations or rely on unidirectional temporal modeling, making them vulnerable to spurious correlations and unstable long-term representations. To this end, we propose CaFlow, a unified framework that integrates counterfactual de-confounding with bidirectional time-conditioned flow. The Causal Counterfactual Regularization (CCR) module disentangles causal and confounding features in a self-supervised manner and enforces causal robustness through counterfactual interventions, while the BiT-Flow module models forward and backward dynamics with a cycle-consistency constraint to produce smoother and more coherent representations. Extensive experiments on multiple long-term AQA benchmarks demonstrate that CaFlow achieves state-of-the-art performance. Code is available at https://github.com/Harrison21/CaFlow",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21653v1",
        "pdf": "https://arxiv.org/pdf/2511.21653v1"
      },
      "arxiv_id": "2511.21653v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21652v1",
      "title": "Continual Error Correction on Low-Resource Devices",
      "authors": [
        "Kirill Paramonov",
        "Mete Ozay",
        "Aristeidis Mystakidis",
        "Nikolaos Tsalikidis",
        "Dimitrios Sotos",
        "Anastasios Drosou",
        "Dimitrios Tzovaras",
        "Hyunjun Kim",
        "Kiseok Chang",
        "Sangdok Mo",
        "Namwoong Kim",
        "Woojong Yoo",
        "Jijoong Moon",
        "Umberto Michieli"
      ],
      "abstract": "The proliferation of AI models in everyday devices has highlighted a critical challenge: prediction errors that degrade user experience. While existing solutions focus on error detection, they rarely provide efficient correction mechanisms, especially for resource-constrained devices. We present a novel system enabling users to correct AI misclassifications through few-shot learning, requiring minimal computational resources and storage. Our approach combines server-side foundation model training with on-device prototype-based classification, enabling efficient error correction through prototype updates rather than model retraining. The system consists of two key components: (1) a server-side pipeline that leverages knowledge distillation to transfer robust feature representations from foundation models to device-compatible architectures, and (2) a device-side mechanism that enables ultra-efficient error correction through prototype adaptation. We demonstrate our system's effectiveness on both image classification and object detection tasks, achieving over 50% error correction in one-shot scenarios on Food-101 and Flowers-102 datasets while maintaining minimal forgetting (less than 0.02%) and negligible computational overhead. Our implementation, validated through an Android demonstration app, proves the system's practicality in real-world scenarios.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21652v1",
        "pdf": "https://arxiv.org/pdf/2511.21652v1"
      },
      "arxiv_id": "2511.21652v1",
      "comment": "ACM MMSys 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21638v1",
      "title": "Aligning LLMs Toward Multi-Turn Conversational Outcomes Using Iterative PPO",
      "authors": [
        "Daniel R. Jiang",
        "Jalaj Bhandari",
        "Yukai Yang",
        "Rémi Munos",
        "Tyler Lu"
      ],
      "abstract": "Optimizing large language models (LLMs) for multi-turn conversational outcomes remains a significant challenge, especially in goal-oriented settings like AI marketing or sales agents who facilitate transactions via messaging platforms. The difficulty stems from sparse, long-horizon rewards and the discrepancy between response-level planning and token-level generation. In this technical note, we propose a formal reduction of the multi-turn RL problem into a sequence of single-turn RLHF-style problems. This is achieved by setting a learned multi-turn Q-function as the reward model for the single-turn problem. We demonstrate and prove a key insight: solving this single-turn RL problem with standard token-level PPO is equivalent to a policy improvement step within the multi-turn problem. This insight naturally leads to Iterative PPO, a batch online policy iteration algorithm that alternates between fitting Q-functions from logged conversation trajectories and improving the policy. A major practical advantage is that Iterative PPO directly leverages stable, off-the-shelf single-turn RLHF tools, making it straightforward to implement. Our method occupies a middle ground between fully online and fully offline approaches, retaining the adaptability of online updates while gaining the stability benefits of offline training.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21638v1",
        "pdf": "https://arxiv.org/pdf/2511.21638v1"
      },
      "arxiv_id": "2511.21638v1",
      "comment": "12 pages, 2 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21636v1",
      "title": "Bridging the Unavoidable A Priori: A Framework for Comparative Causal Modeling",
      "authors": [
        "Peter S. Hovmand",
        "Kari O'Donnell",
        "Callie Ogland-Hand",
        "Brian Biroscak",
        "Douglas D. Gunzler"
      ],
      "abstract": "AI/ML models have rapidly gained prominence as innovations for solving previously unsolved problems and their unintended consequences from amplifying human biases. Advocates for responsible AI/ML have sought ways to draw on the richer causal models of system dynamics to better inform the development of responsible AI/ML. However, a major barrier to advancing this work is the difficulty of bringing together methods rooted in different underlying assumptions (i.e., Dana Meadow's \"the unavoidable a priori\"). This paper brings system dynamics and structural equation modeling together into a common mathematical framework that can be used to generate systems from distributions, develop methods, and compare results to inform the underlying epistemology of system dynamics for data science and AI/ML applications.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI",
        "stat.AP",
        "stat.CO",
        "stat.ME",
        "stat.ML"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21636v1",
        "pdf": "https://arxiv.org/pdf/2511.21636v1"
      },
      "arxiv_id": "2511.21636v1",
      "comment": "Presented at 43rd Conference of the International System Dynamics Society in Boston, United States",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21635v1",
      "title": "Mechanisms of Non-Monotonic Scaling in Vision Transformers",
      "authors": [
        "Anantha Padmanaban Krishna Kumar"
      ],
      "abstract": "Deeper Vision Transformers often perform worse than shallower ones, which challenges common scaling assumptions. Through a systematic empirical analysis of ViT-S, ViT-B, and ViT-L on ImageNet, we identify a consistent three-phase Cliff-Plateau-Climb pattern that governs how representations evolve with depth. We observe that better performance is associated with progressive marginalization of the [CLS] token, originally designed as a global aggregation hub, in favor of distributed consensus among patch tokens. We quantify patterns of information mixing with an Information Scrambling Index, and show that in ViT-L the information-task tradeoff emerges roughly 10 layers later than in ViT-B, and that these additional layers correlate with increased information diffusion rather than improved task performance. Taken together, these results suggest that transformer architectures in this regime may benefit more from carefully calibrated depth that executes clean phase transitions than from simply increasing parameter count. The Information Scrambling Index provides a useful diagnostic for existing models and suggests a potential design target for future architectures. All code is available at: https://github.com/AnanthaPadmanaban-KrishnaKumar/Cliff-Plateau-Climb.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21635v1",
        "pdf": "https://arxiv.org/pdf/2511.21635v1"
      },
      "arxiv_id": "2511.21635v1",
      "comment": "16 pages total (11 pages main text, 1 pages references, 4 pages appendix), 5 figures, 11 tables. Code available at https://github.com/AnanthaPadmanaban-KrishnaKumar/Cliff-Plateau-Climb",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.21631v1",
      "title": "Qwen3-VL Technical Report",
      "authors": [
        "Shuai Bai",
        "Yuxuan Cai",
        "Ruizhe Chen",
        "Keqin Chen",
        "Xionghui Chen",
        "Zesen Cheng",
        "Lianghao Deng",
        "Wei Ding",
        "Chang Gao",
        "Chunjiang Ge",
        "Wenbin Ge",
        "Zhifang Guo",
        "Qidong Huang",
        "Jie Huang",
        "Fei Huang",
        "Binyuan Hui",
        "Shutong Jiang",
        "Zhaohai Li",
        "Mingsheng Li",
        "Mei Li",
        "Kaixin Li",
        "Zicheng Lin",
        "Junyang Lin",
        "Xuejing Liu",
        "Jiawei Liu",
        "Chenglong Liu",
        "Yang Liu",
        "Dayiheng Liu",
        "Shixuan Liu",
        "Dunjie Lu",
        "Ruilin Luo",
        "Chenxu Lv",
        "Rui Men",
        "Lingchen Meng",
        "Xuancheng Ren",
        "Xingzhang Ren",
        "Sibo Song",
        "Yuchong Sun",
        "Jun Tang",
        "Jianhong Tu",
        "Jianqiang Wan",
        "Peng Wang",
        "Pengfei Wang",
        "Qiuyue Wang",
        "Yuxuan Wang",
        "Tianbao Xie",
        "Yiheng Xu",
        "Haiyang Xu",
        "Jin Xu",
        "Zhibo Yang",
        "Mingkun Yang",
        "Jianxin Yang",
        "An Yang",
        "Bowen Yu",
        "Fei Zhang",
        "Hang Zhang",
        "Xi Zhang",
        "Bo Zheng",
        "Humen Zhong",
        "Jingren Zhou",
        "Fan Zhou",
        "Jing Zhou",
        "Yuanzhi Zhu",
        "Ke Zhu"
      ],
      "abstract": "We introduce Qwen3-VL, the most capable vision-language model in the Qwen series to date, achieving superior performance across a broad range of multimodal benchmarks. It natively supports interleaved contexts of up to 256K tokens, seamlessly integrating text, images, and video. The model family includes both dense (2B/4B/8B/32B) and mixture-of-experts (30B-A3B/235B-A22B) variants to accommodate diverse latency-quality trade-offs. Qwen3-VL delivers three core pillars: (i) markedly stronger pure-text understanding, surpassing comparable text-only backbones in several cases; (ii) robust long-context comprehension with a native 256K-token window for both text and interleaved multimodal inputs, enabling faithful retention, retrieval, and cross-referencing across long documents and videos; and (iii) advanced multimodal reasoning across single-image, multi-image, and video tasks, demonstrating leading performance on comprehensive evaluations such as MMMU and visual-math benchmarks (e.g., MathVista and MathVision). Architecturally, we introduce three key upgrades: (i) an enhanced interleaved-MRoPE for stronger spatial-temporal modeling across images and video; (ii) DeepStack integration, which effectively leverages multi-level ViT features to tighten vision-language alignment; and (iii) text-based time alignment for video, evolving from T-RoPE to explicit textual timestamp alignment for more precise temporal grounding. Under comparable token budgets and latency constraints, Qwen3-VL achieves superior performance in both dense and Mixture-of-Experts (MoE) architectures. We envision Qwen3-VL serving as a foundational engine for image-grounded reasoning, agentic decision-making, and multimodal code intelligence in real-world workflows.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21631v1",
        "pdf": "https://arxiv.org/pdf/2511.21631v1"
      },
      "arxiv_id": "2511.21631v1",
      "comment": "42 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21626v1",
      "title": "Scale-Agnostic Kolmogorov-Arnold Geometry in Neural Networks",
      "authors": [
        "Mathew Vanherreweghe",
        "Michael H. Freedman",
        "Keith M. Adams"
      ],
      "abstract": "Recent work by Freedman and Mulligan demonstrated that shallow multilayer perceptrons spontaneously develop Kolmogorov-Arnold geometric (KAG) structure during training on synthetic three-dimensional tasks. However, it remained unclear whether this phenomenon persists in realistic high-dimensional settings and what spatial properties this geometry exhibits.\n  We extend KAG analysis to MNIST digit classification (784 dimensions) using 2-layer MLPs with systematic spatial analysis at multiple scales. We find that KAG emerges during training and appears consistently across spatial scales, from local 7-pixel neighborhoods to the full 28x28 image. This scale-agnostic property holds across different training procedures: both standard training and training with spatial augmentation produce the same qualitative pattern. These findings reveal that neural networks spontaneously develop organized, scale-invariant geometric structure during learning on realistic high-dimensional data.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21626v1",
        "pdf": "https://arxiv.org/pdf/2511.21626v1"
      },
      "arxiv_id": "2511.21626v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21625v1",
      "title": "Active Learning for GCN-based Action Recognition",
      "authors": [
        "Hichem Sahbi"
      ],
      "abstract": "Despite the notable success of graph convolutional networks (GCNs) in skeleton-based action recognition, their performance often depends on large volumes of labeled data, which are frequently scarce in practical settings. To address this limitation, we propose a novel label-efficient GCN model. Our work makes two primary contributions. First, we develop a novel acquisition function that employs an adversarial strategy to identify a compact set of informative exemplars for labeling. This selection process balances representativeness, diversity, and uncertainty. Second, we introduce bidirectional and stable GCN architectures. These enhanced networks facilitate a more effective mapping between the ambient and latent data spaces, enabling a better understanding of the learned exemplar distribution. Extensive evaluations on two challenging skeleton-based action recognition benchmarks reveal significant improvements achieved by our label-efficient GCNs compared to prior work.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21625v1",
        "pdf": "https://arxiv.org/pdf/2511.21625v1"
      },
      "arxiv_id": "2511.21625v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21622v1",
      "title": "On the Origin of Algorithmic Progress in AI",
      "authors": [
        "Hans Gundlach",
        "Alex Fogelson",
        "Jayson Lynch",
        "Ana Trisovic",
        "Jonathan Rosenfeld",
        "Anmol Sandhu",
        "Neil Thompson"
      ],
      "abstract": "Algorithms have been estimated to increase AI training FLOP efficiency by a factor of 22,000 between 2012 and 2023 [Ho et al., 2024]. Running small-scale ablation experiments on key innovations from this time period, we are able to account for less than 10x of these gains. Surveying the broader literature, we estimate that additional innovations not included in our ablations account for less than 10x, yielding a total under 100x. This leads us to conduct scaling experiments, which reveal that much of this efficiency gap can be explained by algorithms with scale-dependent efficiency improvements. In particular, we conduct scaling experiments between LSTMs and Transformers, finding exponent differences in their compute-optimal scaling law while finding little scaling difference for many other innovations. These experiments demonstrate that - contrary to standard assumptions - an algorithm's efficiency gains are tied to compute scale. Using experimental extrapolation and literature estimates, we account for 6,930x efficiency gains over the same time period, with the scale-dependent LSTM-to-Transformer transition accounting for the majority of gains. Our results indicate that algorithmic progress for small models has been far slower than previously assumed, and that measures of algorithmic efficiency are strongly reference-dependent.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21622v1",
        "pdf": "https://arxiv.org/pdf/2511.21622v1"
      },
      "arxiv_id": "2511.21622v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21613v1",
      "title": "Beyond URLs: Metadata Diversity and Position for Efficient LLM Pretraining",
      "authors": [
        "Dongyang Fan",
        "Diba Hashemi",
        "Sai Praneeth Karimireddy",
        "Martin Jaggi"
      ],
      "abstract": "Incorporating metadata in Large Language Models (LLMs) pretraining has recently emerged as a promising approach to accelerate training. However prior work highlighted only one useful signal-URLs, leaving open the question of whether other forms of metadata could yield greater benefits. In this study, we investigate a wider range of metadata types and find other types of metadata, such as fine-grained indicators of document quality that can also accelerate pretraining when prepended. We identify a common feature among effective metadata: they encode information at a finer granularity. We further introduce metadata appending as a means of improving training efficiency, where predicting an appropriate metadata as auxiliary task can help speed up pretraining. In addition, learnable meta-tokens trained with masked loss can recover part of the speedup by inducing quality-aware latent structure. Using probing, we analyze latent representations to understand how metadata shapes learning. Together, these results yield practical guidelines for integrating metadata to improve both the efficiency and effectiveness of LLM pretraining.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21613v1",
        "pdf": "https://arxiv.org/pdf/2511.21613v1"
      },
      "arxiv_id": "2511.21613v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21609v1",
      "title": "Entropy Coding for Non-Rectangular Transform Blocks using Partitioned DCT Dictionaries for AV1",
      "authors": [
        "Priyanka Das",
        "Tim Classen",
        "Mathias Wien"
      ],
      "abstract": "Recent video codecs such as VVC and AV1 apply a Non-rectangular (NR) partitioning to combine prediction signals using a smooth blending around the boundary, followed by a rectangular transform on the whole block. The NR signal transformation is not yet supported. A transformation technique that applies the same partitioning to the 2D Discrete Cosine Transform (DCT) bases and finds a sparse representation of the NR signal in such a dictionary showed promising gains in an experimental setup outside the reference software. This method uses the regular inverse transformation at the decoder to reconstruct a rectangular signal and discards the signal outside the region of interest. This design is appealing due to the minimal changes required at the decoder. However, current entropy coding schemes are not well-suited for optimally encoding these coefficients because they are primarily designed for DCT coefficients. This work introduces an entropy coding method that efficiently codes these transform coefficients by effectively modeling their properties. The design offers significant theoretical rate savings, estimated using conditional entropy, particularly for scenarios that are more dissimilar to DCT in an experimental setup.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "eess.IV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21609v1",
        "pdf": "https://arxiv.org/pdf/2511.21609v1"
      },
      "arxiv_id": "2511.21609v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21607v1",
      "title": "Beyond Accuracy: An Empirical Study of Uncertainty Estimation in Imputation",
      "authors": [
        "Zarin Tahia Hossain",
        "Mostafa Milani"
      ],
      "abstract": "Handling missing data is a central challenge in data-driven analysis. Modern imputation methods not only aim for accurate reconstruction but also differ in how they represent and quantify uncertainty. Yet, the reliability and calibration of these uncertainty estimates remain poorly understood. This paper presents a systematic empirical study of uncertainty in imputation, comparing representative methods from three major families: statistical (MICE, SoftImpute), distribution alignment (OT-Impute), and deep generative (GAIN, MIWAE, TabCSDI). Experiments span multiple datasets, missingness mechanisms (MCAR, MAR, MNAR), and missingness rates. Uncertainty is estimated through three complementary routes: multi-run variability, conditional sampling, and predictive-distribution modeling, and evaluated using calibration curves and the Expected Calibration Error (ECE). Results show that accuracy and calibration are often misaligned: models with high reconstruction accuracy do not necessarily yield reliable uncertainty. We analyze method-specific trade-offs among accuracy, calibration, and runtime, identify stable configurations, and offer guidelines for selecting uncertainty-aware imputers in data cleaning and downstream machine learning pipelines.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.DB",
        "cs.LG"
      ],
      "primary_category": "cs.DB",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21607v1",
        "pdf": "https://arxiv.org/pdf/2511.21607v1"
      },
      "arxiv_id": "2511.21607v1",
      "comment": "To appear in conference proceedings",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21606v1",
      "title": "ReSAM: Refine, Requery, and Reinforce: Self-Prompting Point-Supervised Segmentation for Remote Sensing Images",
      "authors": [
        "M. Naseer Subhani"
      ],
      "abstract": "Interactive segmentation models such as the Segment Anything Model (SAM) have demonstrated remarkable generalization on natural images, but perform suboptimally on remote sensing imagery (RSI) due to severe domain shift and the scarcity of dense annotations. To address this, we propose a self-prompting, point-supervised framework that adapts SAM to RSIs using only sparse point annotations. Our method employs a Refine-Requery-Reinforce loop, where coarse pseudo-masks are generated from initial points (Refine), improved with self-constructed box prompts (Requery), and embeddings are aligned across iterations to reduce confirmation bias (Reinforce). Without relying on full-mask supervision, our approach progressively enhances SAM's segmentation quality and domain robustness through self-guided prompt adaptation . We evaluate our proposed method on three RSI benchmark datasets, including WHU, HRSID, and NWPU VHR-10, showing that our method consistently surpasses pretrained SAM and recent point-supervised segmentation methods. Our results demonstrate that self-prompting and semantic alignment provide an efficient path towards scalable, point-level adaptation of foundation segmentation models for remote sensing applications.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21606v1",
        "pdf": "https://arxiv.org/pdf/2511.21606v1"
      },
      "arxiv_id": "2511.21606v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21600v1",
      "title": "TAB-DRW: A DFT-based Robust Watermark for Generative Tabular Data",
      "authors": [
        "Yizhou Zhao",
        "Xiang Li",
        "Peter Song",
        "Qi Long",
        "Weijie Su"
      ],
      "abstract": "The rise of generative AI has enabled the production of high-fidelity synthetic tabular data across fields such as healthcare, finance, and public policy, raising growing concerns about data provenance and misuse. Watermarking offers a promising solution to address these concerns by ensuring the traceability of synthetic data, but existing methods face many limitations: they are computationally expensive due to reliance on large diffusion models, struggle with mixed discrete-continuous data, or lack robustness to post-modifications. To address them, we propose TAB-DRW, an efficient and robust post-editing watermarking scheme for generative tabular data. TAB-DRW embeds watermark signals in the frequency domain: it normalizes heterogeneous features via the Yeo-Johnson transformation and standardization, applies the discrete Fourier transform (DFT), and adjusts the imaginary parts of adaptively selected entries according to precomputed pseudorandom bits. To further enhance robustness and efficiency, we introduce a novel rank-based pseudorandom bit generation method that enables row-wise retrieval without incurring storage overhead. Experiments on five benchmark tabular datasets show that TAB-DRW achieves strong detectability and robustness against common post-processing attacks, while preserving high data fidelity and fully supporting mixed-type features.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CR",
        "cs.LG"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21600v1",
        "pdf": "https://arxiv.org/pdf/2511.21600v1"
      },
      "arxiv_id": "2511.21600v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21594v1",
      "title": "Visualizing LLM Latent Space Geometry Through Dimensionality Reduction",
      "authors": [
        "Alex Ning",
        "Vainateya Rangaraju"
      ],
      "abstract": "Large language models (LLMs) achieve state-of-the-art results across many natural language tasks, but their internal mechanisms remain difficult to interpret. In this work, we extract, process, and visualize latent state geometries in Transformer-based language models through dimensionality reduction. We capture layerwise activations at multiple points within Transformer blocks and enable systematic analysis through Principal Component Analysis (PCA) and Uniform Manifold Approximation (UMAP). We demonstrate experiments on GPT-2 and LLaMa models, where we uncover interesting geometric patterns in latent space. Notably, we identify a clear separation between attention and MLP component outputs across intermediate layers, a pattern not documented in prior work to our knowledge. We also characterize the high norm of latent states at the initial sequence position and visualize the layerwise evolution of latent states. Additionally, we demonstrate the high-dimensional helical structure of GPT-2's positional embeddings, the sequence-wise geometric patterns in LLaMa, and experiment with repeating token sequences. We aim to support systematic analysis of Transformer internals with the goal of enabling further reproducible interpretability research. We make our code available at https://github.com/Vainateya/Feature_Geometry_Visualization.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21594v1",
        "pdf": "https://arxiv.org/pdf/2511.21594v1"
      },
      "arxiv_id": "2511.21594v1",
      "comment": "24 pages, 16 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21592v1",
      "title": "MoGAN: Improving Motion Quality in Video Diffusion via Few-Step Motion Adversarial Post-Training",
      "authors": [
        "Haotian Xue",
        "Qi Chen",
        "Zhonghao Wang",
        "Xun Huang",
        "Eli Shechtman",
        "Jinrong Xie",
        "Yongxin Chen"
      ],
      "abstract": "Video diffusion models achieve strong frame-level fidelity but still struggle with motion coherence, dynamics and realism, often producing jitter, ghosting, or implausible dynamics. A key limitation is that the standard denoising MSE objective provides no direct supervision on temporal consistency, allowing models to achieve low loss while still generating poor motion. We propose MoGAN, a motion-centric post-training framework that improves motion realism without reward models or human preference data. Built atop a 3-step distilled video diffusion model, we train a DiT-based optical-flow discriminator to differentiate real from generated motion, combined with a distribution-matching regularizer to preserve visual fidelity. With experiments on Wan2.1-T2V-1.3B, MoGAN substantially improves motion quality across benchmarks. On VBench, MoGAN boosts motion score by +7.3% over the 50-step teacher and +13.3% over the 3-step DMD model. On VideoJAM-Bench, MoGAN improves motion score by +7.4% over the teacher and +8.8% over DMD, while maintaining comparable or even better aesthetic and image-quality scores. A human study further confirms that MoGAN is preferred for motion quality (52% vs. 38% for the teacher; 56% vs. 29% for DMD). Overall, MoGAN delivers significantly more realistic motion without sacrificing visual fidelity or efficiency, offering a practical path toward fast, high-quality video generation. Project webpage is: https://xavihart.github.io/mogan.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21592v1",
        "pdf": "https://arxiv.org/pdf/2511.21592v1"
      },
      "arxiv_id": "2511.21592v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21591v1",
      "title": "On the Limits of Innate Planning in Large Language Models",
      "authors": [
        "Charles Schepanowski",
        "Charles Ling"
      ],
      "abstract": "Large language models (LLMs) achieve impressive results on many benchmarks, yet their capacity for planning and stateful reasoning remains unclear. We study these abilities directly, without code execution or other tools, using the 8-puzzle: a classic task that requires state tracking and goal-directed planning while allowing precise, step-by-step evaluation. Four models are tested under common prompting conditions (Zero-Shot, Chain-of-Thought, Algorithm-of-Thought) and with tiered corrective feedback. Feedback improves success rates for some model-prompt combinations, but many successful runs are long, computationally expensive, and indirect. We then examine the models with an external move validator that provides only valid moves. Despite this level of assistance, none of the models solve any puzzles in this setting. Qualitative analysis reveals two dominant deficits across all models: (1) brittle internal state representations, leading to frequent invalid moves, and (2) weak heuristic planning, with models entering loops or selecting actions that do not reduce the distance to the goal state. These findings indicate that, in the absence of external tools such as code interpreters, current LLMs have substantial limitations in planning and that further progress may require mechanisms for maintaining explicit state and performing structured search.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21591v1",
        "pdf": "https://arxiv.org/pdf/2511.21591v1"
      },
      "arxiv_id": "2511.21591v1",
      "comment": "33 pages, 7 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21590v1",
      "title": "An AI-Enabled Hybrid Cyber-Physical Framework for Adaptive Control in Smart Grids",
      "authors": [
        "Muhammad Siddique",
        "Sohaib Zafar"
      ],
      "abstract": "Smart grids are a fusion of classical power infrastructure and advanced communication networks and smart control, to create a cyber-physical environment that is more efficient and flexible than ever before. This integration causes vulnerabilities that can undermine grid stability as well as reliability. Digital forensics is a fundamental concept of learning and identifying, detecting, and mitigating such security incidents. This paper presents an all-in-one machine learning-based digital forensic framework of smart grid systems deployed on the Cloud. The framework combines the data acquisition at the sensor-level, authenticated communication, scalable cloud storage and automated forensic analytics. The model uses supervised and unsupervised learning algorithms - such as Random Forest, Support Vector Machine, Gradient Boosted Trees and deep neural architectures for anomaly detection, event reconstruction and intrusion analysis in real time. After several simulation and experimental studies on real-time smart-meter data streams, the proposed framework is shown to be very accurate, scalable and resilient to cyber-attacks including data tampering, false-data injection and coordinated control-loop manipulation. The results indicate that cloud services are the best backbone for big-data-driven forensic workflows, which allows energy utilities to achieve a fast situational awareness and intelligent incident response.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21590v1",
        "pdf": "https://arxiv.org/pdf/2511.21590v1"
      },
      "arxiv_id": "2511.21590v1",
      "comment": "16 pages, 11 figures, IEEEaccess journal",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21584v1",
      "title": "Model-Based Policy Adaptation for Closed-Loop End-to-End Autonomous Driving",
      "authors": [
        "Haohong Lin",
        "Yunzhi Zhang",
        "Wenhao Ding",
        "Jiajun Wu",
        "Ding Zhao"
      ],
      "abstract": "End-to-end (E2E) autonomous driving models have demonstrated strong performance in open-loop evaluations but often suffer from cascading errors and poor generalization in closed-loop settings. To address this gap, we propose Model-based Policy Adaptation (MPA), a general framework that enhances the robustness and safety of pretrained E2E driving agents during deployment. MPA first generates diverse counterfactual trajectories using a geometry-consistent simulation engine, exposing the agent to scenarios beyond the original dataset. Based on this generated data, MPA trains a diffusion-based policy adapter to refine the base policy's predictions and a multi-step Q value model to evaluate long-term outcomes. At inference time, the adapter proposes multiple trajectory candidates, and the Q value model selects the one with the highest expected utility. Experiments on the nuScenes benchmark using a photorealistic closed-loop simulator demonstrate that MPA significantly improves performance across in-domain, out-of-domain, and safety-critical scenarios. We further investigate how the scale of counterfactual data and inference-time guidance strategies affect overall effectiveness.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21584v1",
        "pdf": "https://arxiv.org/pdf/2511.21584v1"
      },
      "arxiv_id": "2511.21584v1",
      "comment": "Published at NeurIPS 2025: https://openreview.net/forum?id=4OLbpaTKJe",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21582v1",
      "title": "Deep Learning-Based Multiclass Classification of Oral Lesions with Stratified Augmentation",
      "authors": [
        "Joy Naoum",
        "Revana Salama",
        "Ali Hamdi"
      ],
      "abstract": "Oral cancer is highly common across the globe and is mostly diagnosed during the later stages due to the close visual similarity to benign, precancerous, and malignant lesions in the oral cavity. Implementing computer aided diagnosis systems early on has the potential to greatly improve clinical outcomes. This research intends to use deep learning to build a multiclass classifier for sixteen different oral lesions. To overcome the challenges of limited and imbalanced datasets, the proposed technique combines stratified data splitting and advanced data augmentation and oversampling to perform the classification. The experimental results, which achieved 83.33 percent accuracy, 89.12 percent precision, and 77.31 percent recall, demonstrate the superiority of the suggested model over state of the art methods now in use. The suggested model effectively conveys the effectiveness of oversampling and augmentation strategies in situations where the minority class classification performance is noteworthy. As a first step toward trustworthy computer aided diagnostic systems for the early detection of oral cancer in clinical settings, the suggested framework shows promise.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21582v1",
        "pdf": "https://arxiv.org/pdf/2511.21582v1"
      },
      "arxiv_id": "2511.21582v1",
      "comment": "12 pages, 3 figures,",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21581v1",
      "title": "Learning When to Stop: Adaptive Latent Reasoning via Reinforcement Learning",
      "authors": [
        "Alex Ning",
        "Yen-Ling Kuo",
        "Gabe Gomes"
      ],
      "abstract": "Latent reasoning represents a new development in Transformer language models that has shown potential in compressing reasoning lengths compared to chain-of-thought reasoning. By directly passing the information-rich previous final latent state into the next sequence, latent reasoning removes the restriction to human language tokens as the medium for reasoning. We develop adaptive-length latent reasoning models and introduce a post-SFT reinforcement-learning methodology to optimize latent reasoning length by minimizing reasoning length while maintaining accuracy. This, in turn, further reduces compute usage and raises the bar on the compressive capabilities of latent reasoning models. Experiments on the Llama 3.2 1B model and the GSM8K-Aug dataset show a $52\\%$ drop in total reasoning length with no penalty to accuracy. In future work, we plan to extend to additional models and datasets, analyze relationships between training coefficients, experiment with architecture variations, and continue our knowledge distillation for latent reasoning SFT efforts. We make our code and pretrained weights available at https://github.com/apning/adaptive-latent-reasoning.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21581v1",
        "pdf": "https://arxiv.org/pdf/2511.21581v1"
      },
      "arxiv_id": "2511.21581v1",
      "comment": "13 pages, 6 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21579v1",
      "title": "Harmony: Harmonizing Audio and Video Generation through Cross-Task Synergy",
      "authors": [
        "Teng Hu",
        "Zhentao Yu",
        "Guozhen Zhang",
        "Zihan Su",
        "Zhengguang Zhou",
        "Youliang Zhang",
        "Yuan Zhou",
        "Qinglin Lu",
        "Ran Yi"
      ],
      "abstract": "The synthesis of synchronized audio-visual content is a key challenge in generative AI, with open-source models facing challenges in robust audio-video alignment. Our analysis reveals that this issue is rooted in three fundamental challenges of the joint diffusion process: (1) Correspondence Drift, where concurrently evolving noisy latents impede stable learning of alignment; (2) inefficient global attention mechanisms that fail to capture fine-grained temporal cues; and (3) the intra-modal bias of conventional Classifier-Free Guidance (CFG), which enhances conditionality but not cross-modal synchronization. To overcome these challenges, we introduce Harmony, a novel framework that mechanistically enforces audio-visual synchronization. We first propose a Cross-Task Synergy training paradigm to mitigate drift by leveraging strong supervisory signals from audio-driven video and video-driven audio generation tasks. Then, we design a Global-Local Decoupled Interaction Module for efficient and precise temporal-style alignment. Finally, we present a novel Synchronization-Enhanced CFG (SyncCFG) that explicitly isolates and amplifies the alignment signal during inference. Extensive experiments demonstrate that Harmony establishes a new state-of-the-art, significantly outperforming existing methods in both generation fidelity and, critically, in achieving fine-grained audio-visual synchronization.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21579v1",
        "pdf": "https://arxiv.org/pdf/2511.21579v1"
      },
      "arxiv_id": "2511.21579v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21577v1",
      "title": "HarmonicAttack: An Adaptive Cross-Domain Audio Watermark Removal",
      "authors": [
        "Kexin Li",
        "Xiao Hu",
        "Ilya Grishchenko",
        "David Lie"
      ],
      "abstract": "The availability of high-quality, AI-generated audio raises security challenges such as misinformation campaigns and voice-cloning fraud. A key defense against the misuse of AI-generated audio is by watermarking it, so that it can be easily distinguished from genuine audio. As those seeking to misuse AI-generated audio may thus seek to remove audio watermarks, studying effective watermark removal techniques is critical to being able to objectively evaluate the robustness of audio watermarks against removal. Previous watermark removal schemes either assume impractical knowledge of the watermarks they are designed to remove or are computationally expensive, potentially generating a false sense of confidence in current watermark schemes.\n  We introduce HarmonicAttack, an efficient audio watermark removal method that only requires the basic ability to generate the watermarks from the targeted scheme and nothing else. With this, we are able to train a general watermark removal model that is able to remove the watermarks generated by the targeted scheme from any watermarked audio sample. HarmonicAttack employs a dual-path convolutional autoencoder that operates in both temporal and frequency domains, along with GAN-style training, to separate the watermark from the original audio. When evaluated against state-of-the-art watermark schemes AudioSeal, WavMark, and Silentcipher, HarmonicAttack demonstrates greater watermark removal ability than previous watermark removal methods with near real-time performance. Moreover, while HarmonicAttack requires training, we find that it is able to transfer to out-of-distribution samples with minimal degradation in performance.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.SD",
        "cs.AI"
      ],
      "primary_category": "cs.SD",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21577v1",
        "pdf": "https://arxiv.org/pdf/2511.21577v1"
      },
      "arxiv_id": "2511.21577v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21575v1",
      "title": "Enhanced Landmark Detection Model in Pelvic Fluoroscopy using 2D/3D Registration Loss",
      "authors": [
        "Chou Mo",
        "Yehyun Suh",
        "J. Ryan Martin",
        "Daniel Moyer"
      ],
      "abstract": "Automated landmark detection offers an efficient approach for medical professionals to understand patient anatomic structure and positioning using intra-operative imaging. While current detection methods for pelvic fluoroscopy demonstrate promising accuracy, most assume a fixed Antero-Posterior view of the pelvis. However, orientation often deviates from this standard view, either due to repositioning of the imaging unit or of the target structure itself. To address this limitation, we propose a novel framework that incorporates 2D/3D landmark registration into the training of a U-Net landmark prediction model. We analyze the performance difference by comparing landmark detection accuracy between the baseline U-Net, U-Net trained with Pose Estimation Loss, and U-Net fine-tuned with Pose Estimation Loss under realistic intra-operative conditions where patient pose is variable.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21575v1",
        "pdf": "https://arxiv.org/pdf/2511.21575v1"
      },
      "arxiv_id": "2511.21575v1",
      "comment": "9 pages, 3 figures, 1 table",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21574v1",
      "title": "Multimodal Robust Prompt Distillation for 3D Point Cloud Models",
      "authors": [
        "Xiang Gu",
        "Liming Lu",
        "Xu Zheng",
        "Anan Du",
        "Yongbin Zhou",
        "Shuchao Pang"
      ],
      "abstract": "Adversarial attacks pose a significant threat to learning-based 3D point cloud models, critically undermining their reliability in security-sensitive applications. Existing defense methods often suffer from (1) high computational overhead and (2) poor generalization ability across diverse attack types. To bridge these gaps, we propose a novel yet efficient teacher-student framework, namely Multimodal Robust Prompt Distillation (MRPD) for distilling robust 3D point cloud model. It learns lightweight prompts by aligning student point cloud model's features with robust embeddings from three distinct teachers: a vision model processing depth projections, a high-performance 3D model, and a text encoder. To ensure a reliable knowledge transfer, this distillation is guided by a confidence-gated mechanism which dynamically balances the contribution of all input modalities. Notably, since the distillation is all during the training stage, there is no additional computational cost at inference. Extensive experiments demonstrate that MRPD substantially outperforms state-of-the-art defense methods against a wide range of white-box and black-box attacks, while even achieving better performance on clean data. Our work presents a new, practical paradigm for building robust 3D vision systems by efficiently harnessing multimodal knowledge.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21574v1",
        "pdf": "https://arxiv.org/pdf/2511.21574v1"
      },
      "arxiv_id": "2511.21574v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21572v1",
      "title": "BAMAS: Structuring Budget-Aware Multi-Agent Systems",
      "authors": [
        "Liming Yang",
        "Junyu Luo",
        "Xuanzhe Liu",
        "Yiling Lou",
        "Zhenpeng Chen"
      ],
      "abstract": "Large language model (LLM)-based multi-agent systems have emerged as a powerful paradigm for enabling autonomous agents to solve complex tasks. As these systems scale in complexity, cost becomes an important consideration for practical deployment. However, existing work rarely addresses how to structure multi-agent systems under explicit budget constraints. In this paper, we propose BAMAS, a novel approach for building multi-agent systems with budget awareness. BAMAS first selects an optimal set of LLMs by formulating and solving an Integer Linear Programming problem that balances performance and cost. It then determines how these LLMs should collaborate by leveraging a reinforcement learning-based method to select the interaction topology. Finally, the system is instantiated and executed based on the selected agents and their collaboration topology. We evaluate BAMAS on three representative tasks and compare it with state-of-the-art agent construction methods. Results show that BAMAS achieves comparable performance while reducing cost by up to 86%.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.MA",
        "cs.AI"
      ],
      "primary_category": "cs.MA",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21572v1",
        "pdf": "https://arxiv.org/pdf/2511.21572v1"
      },
      "arxiv_id": "2511.21572v1",
      "comment": "Accepted by AAAI 2026 (oral paper)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21570v1",
      "title": "From Prediction to Foresight: The Role of AI in Designing Responsible Futures",
      "authors": [
        "Maria Perez-Ortiz"
      ],
      "abstract": "In an era marked by rapid technological advancements and complex global challenges, responsible foresight has emerged as an essential framework for policymakers aiming to navigate future uncertainties and shape the future. Responsible foresight entails the ethical anticipation of emerging opportunities and risks, with a focus on fostering proactive, sustainable, and accountable future design. This paper coins the term \"responsible computational foresight\", examining the role of human-centric artificial intelligence and computational modeling in advancing responsible foresight, establishing a set of foundational principles for this new field and presenting a suite of AI-driven foresight tools currently shaping it. AI, particularly in conjunction with simulations and scenario analysis, enhances policymakers' ability to address uncertainty, evaluate risks, and devise strategies geared toward sustainable, resilient futures. However, responsible foresight extends beyond mere technical forecasting; it demands a nuanced understanding of the interdependencies within social, environmental, economic and political systems, alongside a commitment to ethical, long-term decision-making that supports human intelligence. We argue that AI will play a role as a supportive tool in responsible, human-centered foresight, complementing rather than substituting policymaker judgment to enable the proactive shaping of resilient and ethically sound futures. This paper advocates for the thoughtful integration of AI into foresight practices to empower policymakers and communities as they confront the grand challenges of the 21st century.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI",
        "cs.CY",
        "cs.HC"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21570v1",
        "pdf": "https://arxiv.org/pdf/2511.21570v1"
      },
      "arxiv_id": "2511.21570v1",
      "comment": "Accessible at https://projecteuclid.org/journals/journal-of-artificial-intelligence-for-sustainable-development/volume-1/issue-1/From-Prediction-to-Foresight--The-Role-of-AI-in/10.69828/4d4kja.full",
      "journal_ref": "Journal of Artificial Intelligence for Sustainable Development (JAISD), 2024",
      "has_code": false
    },
    {
      "id": "2511.21569v1",
      "title": "Self-Transparency Failures in Expert-Persona LLMs: A Large-Scale Behavioral Audit",
      "authors": [
        "Alex Diep"
      ],
      "abstract": "If a language model cannot reliably disclose its AI identity in expert contexts, users cannot trust its competence boundaries. This study examines self-transparency in models assigned professional personas within high-stakes domains where false expertise risks user harm. Using a common-garden design, sixteen open-weight models (4B--671B parameters) were audited across 19,200 trials. Models exhibited sharp domain-specific inconsistency: a Financial Advisor persona elicited 30.8% disclosure initially, while a Neurosurgeon persona elicited only 3.5%. This creates preconditions for a \"Reverse Gell-Mann Amnesia\" effect, where transparency in some domains leads users to overgeneralize trust to contexts where disclosure fails. Disclosure ranged from 2.8% to 73.6%, with a 14B model reaching 61.4% while a 70B produced just 4.1%. Model identity predicted behavior better than parameter count ($ΔR_{adj}^{2} = 0.359$ vs 0.018). Reasoning optimization actively suppressed self-transparency in some models, with reasoning variants showing up to 48.4% lower disclosure than base counterparts. Bayesian validation with Rogan--Gladen correction confirmed robustness to measurement error ($κ= 0.908$). These findings demonstrate transparency reflects training factors rather than scale. Organizations cannot assume safety properties transfer to deployment contexts, requiring deliberate behavior design and empirical verification.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI",
        "cs.HC"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21569v1",
        "pdf": "https://arxiv.org/pdf/2511.21569v1"
      },
      "arxiv_id": "2511.21569v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21566v1",
      "title": "A decoupled alignment kernel for peptide membrane permeability predictions",
      "authors": [
        "Ali Amirahmadi",
        "Gökçe Geylan",
        "Leonardo De Maria",
        "Farzaneh Etminani",
        "Mattias Ohlsson",
        "Alessandro Tibo"
      ],
      "abstract": "Cyclic peptides are promising modalities for targeting intracellular sites; however, cell-membrane permeability remains a key bottleneck, exacerbated by limited public data and the need for well-calibrated uncertainty. Instead of relying on data-eager complex deep learning architecture, we propose a monomer-aware decoupled global alignment kernel (MD-GAK), which couples chemically meaningful residue-residue similarity with sequence alignment while decoupling local matches from gap penalties. MD-GAK is a relatively simple kernel. To further demonstrate the robustness of our framework, we also introduce a variant, PMD-GAK, which incorporates a triangular positional prior. As we will show in the experimental section, PMD-GAK can offer additional advantages over MD-GAK, particularly in reducing calibration errors. Since our focus is on uncertainty estimation, we use Gaussian Processes as the predictive model, as both MD-GAK and PMD-GAK can be directly applied within this framework. We demonstrate the effectiveness of our methods through an extensive set of experiments, comparing our fully reproducible approach against state-of-the-art models, and show that it outperforms them across all metrics.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21566v1",
        "pdf": "https://arxiv.org/pdf/2511.21566v1"
      },
      "arxiv_id": "2511.21566v1",
      "comment": "submitted to Journal of Cheminformatics",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21565v1",
      "title": "UAVLight: A Benchmark for Illumination-Robust 3D Reconstruction in Unmanned Aerial Vehicle (UAV) Scenes",
      "authors": [
        "Kang Du",
        "Xue Liao",
        "Junpeng Xia",
        "Chaozheng Guo",
        "Yi Gu",
        "Yirui Guan",
        "Duotun Wang",
        "ShengHuang",
        "Zeyu Wang"
      ],
      "abstract": "Illumination inconsistency is a fundamental challenge in multi-view 3D reconstruction. Variations in sunlight direction, cloud cover, and shadows break the constant-lighting assumption underlying both classical multi-view stereo (MVS) and structure from motion (SfM) pipelines and recent neural rendering methods, leading to geometry drift, color inconsistency, and shadow imprinting. This issue is especially critical in UAV-based reconstruction, where long flight durations and outdoor environments make lighting changes unavoidable. However, existing datasets either restrict capture to short time windows, thus lacking meaningful illumination diversity, or span months and seasons, where geometric and semantic changes confound the isolated study of lighting robustness. We introduce UAVLight, a controlled-yet-real benchmark for illumination-robust 3D reconstruction. Each scene is captured along repeatable, geo-referenced flight paths at multiple fixed times of day, producing natural lighting variation under consistent geometry, calibration, and viewpoints. With standardized evaluation protocols across lighting conditions, UAVLight provides a reliable foundation for developing and benchmarking reconstruction methods that are consistent, faithful, and relightable in real outdoor environments.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21565v1",
        "pdf": "https://arxiv.org/pdf/2511.21565v1"
      },
      "arxiv_id": "2511.21565v1",
      "comment": "10 pages, 6 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21561v1",
      "title": "Machine Learning Approaches to Clinical Risk Prediction: Multi-Scale Temporal Alignment in Electronic Health Records",
      "authors": [
        "Wei-Chen Chang",
        "Lu Dai",
        "Ting Xu"
      ],
      "abstract": "This study proposes a risk prediction method based on a Multi-Scale Temporal Alignment Network (MSTAN) to address the challenges of temporal irregularity, sampling interval differences, and multi-scale dynamic dependencies in Electronic Health Records (EHR). The method focuses on temporal feature modeling by introducing a learnable temporal alignment mechanism and a multi-scale convolutional feature extraction structure to jointly model long-term trends and short-term fluctuations in EHR sequences. At the input level, the model maps multi-source clinical features into a unified high-dimensional semantic space and employs temporal embedding and alignment modules to dynamically weight irregularly sampled data, reducing the impact of temporal distribution differences on model performance. The multi-scale feature extraction module then captures key patterns across different temporal granularities through multi-layer convolution and hierarchical fusion, achieving a fine-grained representation of patient states. Finally, an attention-based aggregation mechanism integrates global temporal dependencies to generate individual-level risk representations for disease risk prediction and health status assessment. Experiments conducted on publicly available EHR datasets show that the proposed model outperforms mainstream baselines in accuracy, recall, precision, and F1-Score, demonstrating the effectiveness and robustness of multi-scale temporal alignment in complex medical time-series analysis. This study provides a new solution for intelligent representation of high-dimensional asynchronous medical sequences and offers important technical support for EHR-driven clinical risk prediction.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21561v1",
        "pdf": "https://arxiv.org/pdf/2511.21561v1"
      },
      "arxiv_id": "2511.21561v1",
      "comment": "5 pages, 3 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21560v1",
      "title": "Computing Strategic Responses to Non-Linear Classifiers",
      "authors": [
        "Jack Geary",
        "Boyan Gao",
        "Henry Gouk"
      ],
      "abstract": "We consider the problem of strategic classification, where the act of deploying a classifier leads to strategic behaviour that induces a distribution shift on subsequent observations. Current approaches to learning classifiers in strategic settings are focused primarily on the linear setting, but in many cases non-linear classifiers are more suitable. A central limitation to progress for non-linear classifiers arises from the inability to compute best responses in these settings. We present a novel method for computing the best response by optimising the Lagrangian dual of the Agents' objective. We demonstrate that our method reproduces best responses in linear settings, identifying key weaknesses in existing approaches. We present further results demonstrating our method can be straight-forwardly applied to non-linear classifier settings, where it is useful for both evaluation and training.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21560v1",
        "pdf": "https://arxiv.org/pdf/2511.21560v1"
      },
      "arxiv_id": "2511.21560v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21557v1",
      "title": "VacuumVLA: Boosting VLA Capabilities via a Unified Suction and Gripping Tool for Complex Robotic Manipulation",
      "authors": [
        "Hui Zhou",
        "Siyuan Huang",
        "Minxing Li",
        "Hao Zhang",
        "Lue Fan",
        "Shaoshuai Shi"
      ],
      "abstract": "Vision Language Action models have significantly advanced general purpose robotic manipulation by harnessing large scale pretrained vision and language representations. Among existing approaches, a majority of current VLA systems employ parallel two finger grippers as their default end effectors. However, such grippers face inherent limitations in handling certain real world tasks such as wiping glass surfaces or opening drawers without handles due to insufficient contact area or lack of adhesion. To overcome these challenges, we present a low cost, integrated hardware design that combines a mechanical two finger gripper with a vacuum suction unit, enabling dual mode manipulation within a single end effector. Our system supports flexible switching or synergistic use of both modalities, expanding the range of feasible tasks. We validate the efficiency and practicality of our design within two state of the art VLA frameworks: DexVLA and Pi0. Experimental results demonstrate that with the proposed hybrid end effector, robots can successfully perform multiple complex tasks that are infeasible for conventional two finger grippers alone. All hardware designs and controlling systems will be released.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21557v1",
        "pdf": "https://arxiv.org/pdf/2511.21557v1"
      },
      "arxiv_id": "2511.21557v1",
      "comment": "8 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21550v1",
      "title": "MMA: A Momentum Mamba Architecture for Human Activity Recognition with Inertial Sensors",
      "authors": [
        "Thai-Khanh Nguyen",
        "Uyen Vo",
        "Tan M. Nguyen",
        "Thieu N. Vo",
        "Trung-Hieu Le",
        "Cuong Pham"
      ],
      "abstract": "Human activity recognition (HAR) from inertial sensors is essential for ubiquitous computing, mobile health, and ambient intelligence. Conventional deep models such as Convolutional Neural Networks (CNNs), Recurrent Neural Networks (RNNs), and transformers have advanced HAR but remain limited by vanishing or exloding gradients, high computational cost, and difficulty in capturing long-range dependencies. Structured state-space models (SSMs) like Mamba address these challenges with linear complexity and effective temporal modeling, yet they are restricted to first-order dynamics without stable longterm memory mechanisms. We introduce Momentum Mamba, a momentum-augmented SSM that incorporates second-order dynamics to improve stability of information flow across time steps, robustness, and long-sequence modeling. Two extensions further expand its capacity: Complex Momentum Mamba for frequency-selective memory scaling. Experiments on multiple HAR benchmarks demonstrate consistent gains over vanilla Mamba and Transformer baselines in accuracy, robustness, and convergence speed. With only moderate increases in training cost, momentum-augmented SSMs offer a favorable accuracy-efficiency balance, establishing them as a scalable paradigm for HAR and a promising principal framework for broader sequence modeling applications.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.HC",
        "cs.LG"
      ],
      "primary_category": "cs.HC",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21550v1",
        "pdf": "https://arxiv.org/pdf/2511.21550v1"
      },
      "arxiv_id": "2511.21550v1",
      "comment": "14 pages, 5 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21541v1",
      "title": "Video Generation Models Are Good Latent Reward Models",
      "authors": [
        "Xiaoyue Mi",
        "Wenqing Yu",
        "Jiesong Lian",
        "Shibo Jie",
        "Ruizhe Zhong",
        "Zijun Liu",
        "Guozhen Zhang",
        "Zixiang Zhou",
        "Zhiyong Xu",
        "Yuan Zhou",
        "Qinglin Lu",
        "Fan Tang"
      ],
      "abstract": "Reward feedback learning (ReFL) has proven effective for aligning image generation with human preferences. However, its extension to video generation faces significant challenges. Existing video reward models rely on vision-language models designed for pixel-space inputs, confining ReFL optimization to near-complete denoising steps after computationally expensive VAE decoding. This pixel-space approach incurs substantial memory overhead and increased training time, and its late-stage optimization lacks early-stage supervision, refining only visual quality rather than fundamental motion dynamics and structural coherence. In this work, we show that pre-trained video generation models are naturally suited for reward modeling in the noisy latent space, as they are explicitly designed to process noisy latent representations at arbitrary timesteps and inherently preserve temporal information through their sequential modeling capabilities. Accordingly, we propose Process Reward Feedback Learning~(PRFL), a framework that conducts preference optimization entirely in latent space, enabling efficient gradient backpropagation throughout the full denoising chain without VAE decoding. Extensive experiments demonstrate that PRFL significantly improves alignment with human preferences, while achieving substantial reductions in memory consumption and training time compared to RGB ReFL.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21541v1",
        "pdf": "https://arxiv.org/pdf/2511.21541v1"
      },
      "arxiv_id": "2511.21541v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21537v1",
      "title": "Context-Specific Causal Graph Discovery with Unobserved Contexts: Non-Stationarity, Regimes and Spatio-Temporal Patterns",
      "authors": [
        "Martin Rabel",
        "Jakob Runge"
      ],
      "abstract": "Real-world data, for example in climate applications, often consists of spatially gridded time series data or data with comparable structure. While the underlying system is often believed to behave similar at different points in space and time, those variations that do exist are twofold relevant: They often encode important information in and of themselves. And they may negatively affect the stability / convergence and reliability\\Slash{}validity of results of algorithms assuming stationarity or space-translation invariance. We study the information encoded in changes of the causal graph, with stability in mind. An analysis of this general task identifies two core challenges. We develop guiding principles to overcome these challenges, and provide a framework realizing these principles by modifying constraint-based causal discovery approaches on the level of independence testing. This leads to an extremely modular, easily extensible and widely applicable framework. It can leverage existing constraint-based causal discovery methods (demonstrated on IID-algorithms PC, PC-stable, FCI and time series algorithms PCMCI, PCMCI+, LPCMCI) with little to no modification. The built-in modularity allows to systematically understand and improve upon an entire array of subproblems. By design, it can be extended by leveraging insights from change-point-detection, clustering, independence-testing and other well-studied related problems. The division into more accessible sub-problems also simplifies the understanding of fundamental limitations, hyperparameters controlling trade-offs and the statistical interpretation of results. An open-source implementation will be available soon.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "math.ST"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21537v1",
        "pdf": "https://arxiv.org/pdf/2511.21537v1"
      },
      "arxiv_id": "2511.21537v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21533v1",
      "title": "Bangla Sign Language Translation: Dataset Creation Challenges, Benchmarking and Prospects",
      "authors": [
        "Husne Ara Rubaiyeat",
        "Hasan Mahmud",
        "Md Kamrul Hasan"
      ],
      "abstract": "Bangla Sign Language Translation (BdSLT) has been severely constrained so far as the language itself is very low resource. Standard sentence level dataset creation for BdSLT is of immense importance for developing AI based assistive tools for deaf and hard of hearing people of Bangla speaking community. In this paper, we present a dataset, IsharaKhobor , and two subset of it for enabling research. We also present the challenges towards developing the dataset and present some way forward by benchmarking with landmark based raw and RQE embedding. We do some ablation on vocabulary restriction and canonicalization of the same within the dataset, which resulted in two more datasets, IsharaKhobor_small and IsharaKhobor_canonical_small. The dataset is publicly available at: www.kaggle.com/datasets/hasanssl/isharakhobor [1].",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.CV"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21533v1",
        "pdf": "https://arxiv.org/pdf/2511.21533v1"
      },
      "arxiv_id": "2511.21533v1",
      "comment": "14 pages, 8 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21531v1",
      "title": "Predictive Safety Shield for Dyna-Q Reinforcement Learning",
      "authors": [
        "Jin Pin",
        "Krasowski Hanna",
        "Vanneaux Elena"
      ],
      "abstract": "Obtaining safety guarantees for reinforcement learning is a major challenge to achieve applicability for real-world tasks. Safety shields extend standard reinforcement learning and achieve hard safety guarantees. However, existing safety shields commonly use random sampling of safe actions or a fixed fallback controller, therefore disregarding future performance implications of different safe actions. In this work, we propose a predictive safety shield for model-based reinforcement learning agents in discrete space. Our safety shield updates the Q-function locally based on safe predictions, which originate from a safe simulation of the environment model. This shielding approach improves performance while maintaining hard safety guarantees. Our experiments on gridworld environments demonstrate that even short prediction horizons can be sufficient to identify the optimal path. We observe that our approach is robust to distribution shifts, e.g., between simulation and reality, without requiring additional training.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.RO",
        "eess.SY"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21531v1",
        "pdf": "https://arxiv.org/pdf/2511.21531v1"
      },
      "arxiv_id": "2511.21531v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21530v1",
      "title": "The Age-specific Alzheimer 's Disease Prediction with Characteristic Constraints in Nonuniform Time Span",
      "authors": [
        "Xin Hong",
        "Kaifeng Huang"
      ],
      "abstract": "Alzheimer's disease is a debilitating disorder marked by a decline in cognitive function. Timely identification of the disease is essential for the development of personalized treatment strategies that aim to mitigate its progression. The application of generated images for the prediction of Alzheimer's disease poses challenges, particularly in accurately representing the disease's characteristics when input sequences are captured at irregular time intervals. This study presents an innovative methodology for sequential image generation, guided by quantitative metrics, to maintain the essential features indicative of disease progression. Furthermore, an age-scaling factor is integrated into the process to produce age-specific MRI images, facilitating the prediction of advanced stages of the disease. The results obtained from the ablation study suggest that the inclusion of quantitative metrics significantly improves the accuracy of MRI image synthesis. Furthermore, the application of age-scaled pixel loss contributed to the enhanced iterative generation of MRI images. In terms of long-term disease prognosis, the Structural Similarity Index reached a peak value of 0.882, indicating a substantial degree of similarity in the synthesized images.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21530v1",
        "pdf": "https://arxiv.org/pdf/2511.21530v1"
      },
      "arxiv_id": "2511.21530v1",
      "comment": "16 pages, 9 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21526v1",
      "title": "Phase Transition for Stochastic Block Model with more than $\\sqrt{n}$ Communities (II)",
      "authors": [
        "Alexandra Carpentier",
        "Christophe Giraud",
        "Nicolas Verzelen"
      ],
      "abstract": "A fundamental theoretical question in network analysis is to determine under which conditions community recovery is possible in polynomial time in the Stochastic Block Model (SBM). When the number $K$ of communities remains smaller than $\\sqrt{n}$ --where $n$ denotes the number of nodes--, non-trivial community recovery is possible in polynomial time above, and only above, the Kesten--Stigum (KS) threshold, originally postulated using arguments from statistical physics.\n  When $K \\geq \\sqrt{n}$, Chin, Mossel, Sohn, and Wein recently proved that, in the \\emph{sparse regime}, community recovery in polynomial time is achievable below the KS threshold by counting non-backtracking paths. This finding led them to postulate a new threshold for the many-communities regime $K \\geq \\sqrt{n}$. Subsequently, Carpentier, Giraud, and Verzelen established the failure of low-degree polynomials below this new threshold across all density regimes, and demonstrated successful recovery above the threshold in certain moderately sparse settings. While these results provide strong evidence that, in the many community setting, the computational barrier lies at the threshold proposed in~Chin et al., the question of achieving recovery above this threshold still remains open in most density regimes.\n  The present work is a follow-up to~Carpentier et al., in which we prove Conjecture~1.4 stated therein by: \\\\ 1- Constructing a family of motifs satisfying specific structural properties; and\\\\ 2- Proving that community recovery is possible above the proposed threshold by counting such motifs.\\\\ Our results complete the picture of the computational barrier for community recovery in the SBM with $K \\geq \\sqrt{n}$ communities. They also indicate that, in moderately sparse regimes, the optimal algorithms appear to be fundamentally different from spectral methods.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "stat.ML",
        "cs.LG",
        "math.PR",
        "math.ST"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21526v1",
        "pdf": "https://arxiv.org/pdf/2511.21526v1"
      },
      "arxiv_id": "2511.21526v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21523v1",
      "title": "EoS-FM: Can an Ensemble of Specialist Models act as a Generalist Feature Extractor?",
      "authors": [
        "Pierre Adorni",
        "Minh-Tan Pham",
        "Stéphane May",
        "Sébastien Lefèvre"
      ],
      "abstract": "Recent advances in foundation models have shown great promise in domains such as natural language processing and computer vision, and similar efforts are now emerging in the Earth Observation community. These models aim to generalize across tasks with limited supervision, reducing the need for training separate models for each task. However, current strategies, which largely focus on scaling model size and dataset volume, require prohibitive computational and data resources, limiting accessibility to only a few large institutions. Moreover, this paradigm of ever-larger models stands in stark contrast with the principles of sustainable and environmentally responsible AI, as it leads to immense carbon footprints and resource inefficiency. In this work, we present a novel and efficient alternative: an Ensemble-of-Specialists framework for building Remote Sensing Foundation Models (RSFMs). Our method decomposes the training process into lightweight, task-specific ConvNeXtV2 specialists that can be frozen and reused. This modular approach offers strong advantages in efficiency, interpretability, and extensibility. Moreover, it naturally supports federated training, pruning, and continuous specialist integration, making it particularly well-suited for collaborative and resource-constrained settings. Our framework sets a new direction for building scalable and efficient RSFMs.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21523v1",
        "pdf": "https://arxiv.org/pdf/2511.21523v1"
      },
      "arxiv_id": "2511.21523v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21522v1",
      "title": "Pessimistic Verification for Open Ended Math Questions",
      "authors": [
        "Yanxing Huang",
        "Zihan Tang",
        "Zejin Lin",
        "Peng Li",
        "Yang Liu"
      ],
      "abstract": "The key limitation of the verification performance lies in the ability of error detection. With this intuition we designed several variants of pessimistic verification, which are simple workflows that could significantly improve the verification of open-ended math questions. In pessimistic verification we construct multiple parallel verifications for the same proof, and the proof is deemed incorrect if any one of them reports an error. This simple technique significantly improves the performance across many math verification benchmarks without incurring substantial computational resources. Its token efficiency even surpassed extended long-CoT in test-time scaling. Our case studies further indicate that the majority of false negatives in stronger models are actually caused by annotation errors in the original dataset, so our method's performance is in fact underestimated. Self-verification for mathematical problems can effectively improve the reliability and performance of language model outputs, and it also plays a critical role in enabling long-horizon mathematical tasks. We believe that research on pessimistic verification will help enhance the mathematical capabilities of language models across a wide range of tasks.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21522v1",
        "pdf": "https://arxiv.org/pdf/2511.21522v1"
      },
      "arxiv_id": "2511.21522v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21519v1",
      "title": "Self-Paced Learning for Images of Antinuclear Antibodies",
      "authors": [
        "Yiyang Jiang",
        "Guangwu Qian",
        "Jiaxin Wu",
        "Qi Huang",
        "Qing Li",
        "Yongkang Wu",
        "Xiao-Yong Wei"
      ],
      "abstract": "Antinuclear antibody (ANA) testing is a crucial method for diagnosing autoimmune disorders, including lupus, Sjögren's syndrome, and scleroderma. Despite its importance, manual ANA detection is slow, labor-intensive, and demands years of training. ANA detection is complicated by over 100 coexisting antibody types, resulting in vast fluorescent pattern combinations. Although machine learning and deep learning have enabled automation, ANA detection in real-world clinical settings presents unique challenges as it involves multi-instance, multi-label (MIML) learning. In this paper, a novel framework for ANA detection is proposed that handles the complexities of MIML tasks using unaltered microscope images without manual preprocessing. Inspired by human labeling logic, it identifies consistent ANA sub-regions and assigns aggregated labels accordingly. These steps are implemented using three task-specific components: an instance sampler, a probabilistic pseudo-label dispatcher, and self-paced weight learning rate coefficients. The instance sampler suppresses low-confidence instances by modeling pattern confidence, while the dispatcher adaptively assigns labels based on instance distinguishability. Self-paced learning adjusts training according to empirical label observations. Our framework overcomes limitations of traditional MIML methods and supports end-to-end optimization. Extensive experiments on one ANA dataset and three public medical MIML benchmarks demonstrate the superiority of our framework. On the ANA dataset, our model achieves up to +7.0% F1-Macro and +12.6% mAP gains over the best prior method, setting new state-of-the-art results. It also ranks top-2 across all key metrics on public datasets, reducing Hamming loss and one-error by up to 18.2% and 26.9%, respectively. The source code can be accessed at https://github.com/fletcherjiang/ANA-SelfPacedLearning.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21519v1",
        "pdf": "https://arxiv.org/pdf/2511.21519v1"
      },
      "arxiv_id": "2511.21519v1",
      "comment": "IEEE Transactions on Medical Imaging",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21517v1",
      "title": "Voice, Bias, and Coreference: An Interpretability Study of Gender in Speech Translation",
      "authors": [
        "Lina Conti",
        "Dennis Fucci",
        "Marco Gaido",
        "Matteo Negri",
        "Guillaume Wisniewski",
        "Luisa Bentivogli"
      ],
      "abstract": "Unlike text, speech conveys information about the speaker, such as gender, through acoustic cues like pitch. This gives rise to modality-specific bias concerns. For example, in speech translation (ST), when translating from languages with notional gender, such as English, into languages where gender-ambiguous terms referring to the speaker are assigned grammatical gender, the speaker's vocal characteristics may play a role in gender assignment. This risks misgendering speakers, whether through masculine defaults or vocal-based assumptions. Yet, how ST models make these decisions remains poorly understood. We investigate the mechanisms ST models use to assign gender to speaker-referring terms across three language pairs (en-es/fr/it), examining how training data patterns, internal language model (ILM) biases, and acoustic information interact. We find that models do not simply replicate term-specific gender associations from training data, but learn broader patterns of masculine prevalence. While the ILM exhibits strong masculine bias, models can override these preferences based on acoustic input. Using contrastive feature attribution on spectrograms, we reveal that the model with higher gender accuracy relies on a previously unknown mechanism: using first-person pronouns to link gendered terms back to the speaker, accessing gender information distributed across the frequency spectrum rather than concentrated in pitch.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21517v1",
        "pdf": "https://arxiv.org/pdf/2511.21517v1"
      },
      "arxiv_id": "2511.21517v1",
      "comment": "Submitted to LREC 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21514v1",
      "title": "Mechanistic Interpretability for Transformer-based Time Series Classification",
      "authors": [
        "Matīss Kalnāre",
        "Sofoklis Kitharidis",
        "Thomas Bäck",
        "Niki van Stein"
      ],
      "abstract": "Transformer-based models have become state-of-the-art tools in various machine learning tasks, including time series classification, yet their complexity makes understanding their internal decision-making challenging. Existing explainability methods often focus on input-output attributions, leaving the internal mechanisms largely opaque. This paper addresses this gap by adapting various Mechanistic Interpretability techniques; activation patching, attention saliency, and sparse autoencoders, from NLP to transformer architectures designed explicitly for time series classification. We systematically probe the internal causal roles of individual attention heads and timesteps, revealing causal structures within these models. Through experimentation on a benchmark time series dataset, we construct causal graphs illustrating how information propagates internally, highlighting key attention heads and temporal positions driving correct classifications. Additionally, we demonstrate the potential of sparse autoencoders for uncovering interpretable latent features. Our findings provide both methodological contributions to transformer interpretability and novel insights into the functional mechanics underlying transformer performance in time series classification tasks.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21514v1",
        "pdf": "https://arxiv.org/pdf/2511.21514v1"
      },
      "arxiv_id": "2511.21514v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21513v1",
      "title": "IntAttention: A Fully Integer Attention Pipeline for Efficient Edge Inference",
      "authors": [
        "Wanli Zhong",
        "Haibo Feng",
        "Zirui Zhou",
        "Hanyang Peng",
        "Shiqi Yu"
      ],
      "abstract": "Deploying Transformer models on edge devices is limited by latency and energy budgets. While INT8 quantization effectively accelerates the primary matrix multiplications, it exposes the softmax as the dominant bottleneck. This stage incurs a costly dequantize-softmax-requantize detour, which can account for up to 65% of total attention latency and disrupts the end-to-end integer dataflow critical for edge hardware efficiency. To address this limitation, we present IntAttention, the first fully integer, plug-and-play attention pipeline without retraining. At the core of our approach lies IndexSoftmax, a hardware-friendly operator that replaces floating-point exponentials entirely within the integer domain. IntAttention integrates sparsity-aware clipping, a 32-entry lookup-table approximation, and direct integer normalization, thereby eliminating all datatype conversion overhead. We evaluate IntAttention and demonstrate consistent and substantial gains. Our method achieves up to 3.7x speedup and 61% energy reduction over FP16 baselines and 2.0x faster than conventional INT8 attention pipelines on Armv8 CPUs. These gains are achieved with high-fidelity accuracy comparable to baselines across diverse language and vision models, enabling practical and efficient Transformer inference on commodity edge devices. Code will be released in later version of this work.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21513v1",
        "pdf": "https://arxiv.org/pdf/2511.21513v1"
      },
      "arxiv_id": "2511.21513v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21510v1",
      "title": "Tool-RoCo: An Agent-as-Tool Self-organization Large Language Model Benchmark in Multi-robot Cooperation",
      "authors": [
        "Ke Zhang",
        "Xiaoning Zhao",
        "Ce Zheng",
        "Jiahong Ning",
        "Dandan Zhu",
        "Wenqi Zhang",
        "Chen Sun",
        "Toshiharu Sugawara"
      ],
      "abstract": "This study proposes Tool-RoCo, a novel benchmark for evaluating large language models (LLMs) in long-term multi-agent cooperation based on RoCo, a multi-robot cooperative benchmark. Recent research on LLM-based multi-agent systems has relied on predefined orchestration, while ignoring agent autonomy. Tool-RoCo treats other agents as tools and introduces cooperative tools, leveraging tool usage to evaluate multi-agent cooperation and self-organization. Tool usage means that each agent (LLM) selects a tool from a candidate set based on the current state, receives feedback, and adjusts its selection in subsequent rounds. To evaluate different autonomy levels, we propose four LLM paradigms: (1) centralized cooperation, where a single LLM allocates tools to all agents; (2) centralized self-organization, where a central LLM autonomously activates agents while keeping others inactive; (3) decentralized cooperation, where each agent has its own LLM and calls tools based on local information; and (4) self-organization, where a randomly chosen initial agent can request collaboration, activating additional agents via tool calls. Tool-RoCo includes three multi-robot tasks, SORT, PACK, and CABINET, to measure format and parameter accuracy and agent coordination through tool usage. The results using several LLMs showed that cooperative tools accounted for only 7.09% of all tools, indicating that LLM-based agents rarely invoked others as assistants. Moreover, activation tools accounted for 96.42%, suggesting that current LLMs tend to maintain active agents while seldom deactivating them for adaptive coordination. Tool-RoCo provides a systematic benchmark to evaluate LLM autonomy and cooperation in multi-agent tasks. Code and Demo: https://github.com/ColaZhang22/Tool-Roco",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.MA",
        "cs.AI"
      ],
      "primary_category": "cs.MA",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21510v1",
        "pdf": "https://arxiv.org/pdf/2511.21510v1"
      },
      "arxiv_id": "2511.21510v1",
      "comment": "9 pages, 3 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21507v1",
      "title": "Generalized Design Choices for Deepfake Detectors",
      "authors": [
        "Lorenzo Pellegrini",
        "Serafino Pandolfini",
        "Davide Maltoni",
        "Matteo Ferrara",
        "Marco Prati",
        "Marco Ramilli"
      ],
      "abstract": "The effectiveness of deepfake detection methods often depends less on their core design and more on implementation details such as data preprocessing, augmentation strategies, and optimization techniques. These factors make it difficult to fairly compare detectors and to understand which factors truly contribute to their performance. To address this, we systematically investigate how different design choices influence the accuracy and generalization capabilities of deepfake detection models, focusing on aspects related to training, inference, and incremental updates. By isolating the impact of individual factors, we aim to establish robust, architecture-agnostic best practices for the design and development of future deepfake detection systems. Our experiments identify a set of design choices that consistently improve deepfake detection and enable state-of-the-art performance on the AI-GenBench benchmark.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21507v1",
        "pdf": "https://arxiv.org/pdf/2511.21507v1"
      },
      "arxiv_id": "2511.21507v1",
      "comment": "12 pages, 9 figures, 10 tables, code available: https://github.com/MI-BioLab/AI-GenBench",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.21503v1",
      "title": "CanKD: Cross-Attention-based Non-local operation for Feature-based Knowledge Distillation",
      "authors": [
        "Shizhe Sun",
        "Wataru Ohyama"
      ],
      "abstract": "We propose Cross-Attention-based Non-local Knowledge Distillation (CanKD), a novel feature-based knowledge distillation framework that leverages cross-attention mechanisms to enhance the knowledge transfer process. Unlike traditional self-attention-based distillation methods that align teacher and student feature maps independently, CanKD enables each pixel in the student feature map to dynamically consider all pixels in the teacher feature map. This non-local knowledge transfer more thoroughly captures pixel-wise relationships, improving feature representation learning. Our method introduces only an additional loss function to achieve superior performance compared with existing attention-guided distillation methods. Extensive experiments on object detection and image segmentation tasks demonstrate that CanKD outperforms state-of-the-art feature and hybrid distillation methods. These experimental results highlight CanKD's potential as a new paradigm for attention-guided distillation in computer vision tasks. Code is available at https://github.com/tori-hotaru/CanKD",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21503v1",
        "pdf": "https://arxiv.org/pdf/2511.21503v1"
      },
      "arxiv_id": "2511.21503v1",
      "comment": "WACV 2026 Accepted",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21500v1",
      "title": "Lost in Time? A Meta-Learning Framework for Time-Shift-Tolerant Physiological Signal Transformation",
      "authors": [
        "Qian Hong",
        "Cheng Bian",
        "Xiao Zhou",
        "Xiaoyu Li",
        "Yelei Li",
        "Zijing Zeng"
      ],
      "abstract": "Translating non-invasive signals such as photoplethysmography (PPG) and ballistocardiography (BCG) into clinically meaningful signals like arterial blood pressure (ABP) is vital for continuous, low-cost healthcare monitoring. However, temporal misalignment in multimodal signal transformation impairs transformation accuracy, especially in capturing critical features like ABP peaks. Conventional synchronization methods often rely on strong similarity assumptions or manual tuning, while existing Learning with Noisy Labels (LNL) approaches are ineffective under time-shifted supervision, either discarding excessive data or failing to correct label shifts. To address this challenge, we propose ShiftSyncNet, a meta-learning-based bi-level optimization framework that automatically mitigates performance degradation due to time misalignment. It comprises a transformation network (TransNet) and a time-shift correction network (SyncNet), where SyncNet learns time offsets between training pairs and applies Fourier phase shifts to align supervision signals. Experiments on one real-world industrial dataset and two public datasets show that ShiftSyncNet outperforms strong baselines by 9.4%, 6.0%, and 12.8%, respectively. The results highlight its effectiveness in correcting time shifts, improving label quality, and enhancing transformation accuracy across diverse misalignment scenarios, pointing toward a unified direction for addressing temporal inconsistencies in multimodal physiological transformation.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21500v1",
        "pdf": "https://arxiv.org/pdf/2511.21500v1"
      },
      "arxiv_id": "2511.21500v1",
      "comment": "The 40th Annual AAAI Conference on Artificial Intelligence (AAAI 26)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21490v1",
      "title": "Merge and Bound: Direct Manipulations on Weights for Class Incremental Learning",
      "authors": [
        "Taehoon Kim",
        "Donghwan Jang",
        "Bohyung Han"
      ],
      "abstract": "We present a novel training approach, named Merge-and-Bound (M&B) for Class Incremental Learning (CIL), which directly manipulates model weights in the parameter space for optimization. Our algorithm involves two types of weight merging: inter-task weight merging and intra-task weight merging. Inter-task weight merging unifies previous models by averaging the weights of models from all previous stages. On the other hand, intra-task weight merging facilitates the learning of current task by combining the model parameters within current stage. For reliable weight merging, we also propose a bounded update technique that aims to optimize the target model with minimal cumulative updates and preserve knowledge from previous tasks; this strategy reveals that it is possible to effectively obtain new models near old ones, reducing catastrophic forgetting. M&B is seamlessly integrated into existing CIL methods without modifying architecture components or revising learning objectives. We extensively evaluate our algorithm on standard CIL benchmarks and demonstrate superior performance compared to state-of-the-art methods.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21490v1",
        "pdf": "https://arxiv.org/pdf/2511.21490v1"
      },
      "arxiv_id": "2511.21490v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21477v1",
      "title": "Frequency-Aware Token Reduction for Efficient Vision Transformer",
      "authors": [
        "Dong-Jae Lee",
        "Jiwan Hur",
        "Jaehyun Choi",
        "Jaemyung Yu",
        "Junmo Kim"
      ],
      "abstract": "Vision Transformers have demonstrated exceptional performance across various computer vision tasks, yet their quadratic computational complexity concerning token length remains a significant challenge. To address this, token reduction methods have been widely explored. However, existing approaches often overlook the frequency characteristics of self-attention, such as rank collapsing and over-smoothing phenomenon. In this paper, we propose a frequency-aware token reduction strategy that improves computational efficiency while preserving performance by mitigating rank collapsing. Our method partitions tokens into high-frequency tokens and low-frequency tokens. high-frequency tokens are selectively preserved, while low-frequency tokens are aggregated into a compact direct current token to retain essential low-frequency components. Through extensive experiments and analysis, we demonstrate that our approach significantly improves accuracy while reducing computational overhead and mitigating rank collapsing and over smoothing. Furthermore, we analyze the previous methods, shedding light on their implicit frequency characteristics and limitations.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21477v1",
        "pdf": "https://arxiv.org/pdf/2511.21477v1"
      },
      "arxiv_id": "2511.21477v1",
      "comment": "Neurips 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21475v1",
      "title": "MobileI2V: Fast and High-Resolution Image-to-Video on Mobile Devices",
      "authors": [
        "Shuai Zhang",
        "Bao Tang",
        "Siyuan Yu",
        "Yueting Zhu",
        "Jingfeng Yao",
        "Ya Zou",
        "Shanglin Yuan",
        "Li Yu",
        "Wenyu Liu",
        "Xinggang Wang"
      ],
      "abstract": "Recently, video generation has witnessed rapid advancements, drawing increasing attention to image-to-video (I2V) synthesis on mobile devices. However, the substantial computational complexity and slow generation speed of diffusion models pose significant challenges for real-time, high-resolution video generation on resource-constrained mobile devices. In this work, we propose MobileI2V, a 270M lightweight diffusion model for real-time image-to-video generation on mobile devices. The core lies in: (1) We analyzed the performance of linear attention modules and softmax attention modules on mobile devices, and proposed a linear hybrid architecture denoiser that balances generation efficiency and quality. (2) We design a time-step distillation strategy that compresses the I2V sampling steps from more than 20 to only two without significant quality loss, resulting in a 10-fold increase in generation speed. (3) We apply mobile-specific attention optimizations that yield a 2-fold speed-up for attention operations during on-device inference. MobileI2V enables, for the first time, fast 720p image-to-video generation on mobile devices, with quality comparable to existing models. Under one-step conditions, the generation speed of each frame of 720p video is less than 100 ms. Our code is available at: https://github.com/hustvl/MobileI2V.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21475v1",
        "pdf": "https://arxiv.org/pdf/2511.21475v1"
      },
      "arxiv_id": "2511.21475v1",
      "comment": "Our Demo and code:https://github.com/hustvl/MobileI2V",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.21474v1",
      "title": "Going with the Speed of Sound: Pushing Neural Surrogates into Highly-turbulent Transonic Regimes",
      "authors": [
        "Fabian Paischer",
        "Leo Cotteleer",
        "Yann Dreze",
        "Richard Kurle",
        "Dylan Rubini",
        "Maurits Bleeker",
        "Tobias Kronlachner",
        "Johannes Brandstetter"
      ],
      "abstract": "The widespread use of neural surrogates in automotive aerodynamics, enabled by datasets such as DrivAerML and DrivAerNet++, has primarily focused on bluff-body flows with large wakes. Extending these methods to aerospace, particularly in the transonic regime, remains challenging due to the high level of non-linearity of compressible flows and 3D effects such as wingtip vortices. Existing aerospace datasets predominantly focus on 2D airfoils, neglecting these critical 3D phenomena. To address this gap, we present a new dataset of CFD simulations for 3D wings in the transonic regime. The dataset comprises volumetric and surface-level fields for around $30,000$ samples with unique geometry and inflow conditions. This allows computation of lift and drag coefficients, providing a foundation for data-driven aerodynamic optimization of the drag-lift Pareto front. We evaluate several state-of-the-art neural surrogates on our dataset, including Transolver and AB-UPT, focusing on their out-of-distribution (OOD) generalization over geometry and inflow variations. AB-UPT demonstrates strong performance for transonic flowfields and reproduces physically consistent drag-lift Pareto fronts even for unseen wing configurations. Our results demonstrate that AB-UPT can approximate drag-lift Pareto fronts for unseen geometries, highlighting its potential as an efficient and effective tool for rapid aerodynamic design exploration. To facilitate future research, we open-source our dataset at https://huggingface.co/datasets/EmmiAI/Emmi-Wing.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CE",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CE",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21474v1",
        "pdf": "https://arxiv.org/pdf/2511.21474v1"
      },
      "arxiv_id": "2511.21474v1",
      "comment": "NeurIPS 2025 ML4PS Workshop",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21473v1",
      "title": "Hierarchical Ranking Neural Network for Long Document Readability Assessment",
      "authors": [
        "Yurui Zheng",
        "Yijun Chen",
        "Shaohong Zhang"
      ],
      "abstract": "Readability assessment aims to evaluate the reading difficulty of a text. In recent years, while deep learning technology has been gradually applied to readability assessment, most approaches fail to consider either the length of the text or the ordinal relationship of readability labels. This paper proposes a bidirectional readability assessment mechanism that captures contextual information to identify regions with rich semantic information in the text, thereby predicting the readability level of individual sentences. These sentence-level labels are then used to assist in predicting the overall readability level of the document. Additionally, a pairwise sorting algorithm is introduced to model the ordinal relationship between readability levels through label subtraction. Experimental results on Chinese and English datasets demonstrate that the proposed model achieves competitive performance and outperforms other baseline models.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21473v1",
        "pdf": "https://arxiv.org/pdf/2511.21473v1"
      },
      "arxiv_id": "2511.21473v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21471v1",
      "title": "SpatialBench: Benchmarking Multimodal Large Language Models for Spatial Cognition",
      "authors": [
        "Peiran Xu",
        "Sudong Wang",
        "Yao Zhu",
        "Jianing Li",
        "Yunjian Zhang"
      ],
      "abstract": "Spatial cognition is fundamental to real-world multimodal intelligence, allowing models to effectively interact with the physical environment. While multimodal large language models (MLLMs) have made significant strides, existing benchmarks often oversimplify spatial cognition, reducing it to a single-dimensional metric, which fails to capture the hierarchical structure and interdependence of spatial abilities. To address this gap, we propose a hierarchical spatial cognition framework that decomposes spatial intelligence into five progressively complex levels from basic observation to high-level planning. Building upon this taxonomy, we construct SpatialBench, a large-scale, fine-grained benchmark covering 15 tasks aligned with these cognitive levels. To provide a unified evaluation across heterogeneous tasks, we further introduce a high-level capability-oriented metric that reliably assesses a model's overall spatial reasoning ability. Extensive experiments over massive MLLMs reveal distinct performance stratification across cognitive levels: models exhibit strong perceptual grounding yet remain limited in symbolic reasoning, causal inference, and planning. Additional human tests demonstrate that humans perform selective, goal-directed abstraction, while MLLMs tend to over-attend to surface details without coherent spatial intent. Our work establishes the first systematic framework for measuring hierarchical spatial cognition in MLLMs, laying the foundation for future spatially intelligent systems.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21471v1",
        "pdf": "https://arxiv.org/pdf/2511.21471v1"
      },
      "arxiv_id": "2511.21471v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21466v1",
      "title": "Mean-Field Limits for Two-Layer Neural Networks Trained with Consensus-Based Optimization",
      "authors": [
        "William De Deyn",
        "Michael Herty",
        "Giovanni Samaey"
      ],
      "abstract": "We study two-layer neural networks and train these with a particle-based method called consensus-based optimization (CBO). We compare the performance of CBO against Adam on two test cases and demonstrate how a hybrid approach, combining CBO with Adam, provides faster convergence than CBO. In the context of multi-task learning, we recast CBO into a formulation that offers less memory overhead. The CBO method allows for a mean-field limit formulation, which we couple with the mean-field limit of the neural network. To this end, we first reformulate CBO within the optimal transport framework. Finally, in the limit of infinitely many particles, we define the corresponding dynamics on the Wasserstein-over-Wasserstein space and show that the variance decreases monotonically.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "math.OC"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21466v1",
        "pdf": "https://arxiv.org/pdf/2511.21466v1"
      },
      "arxiv_id": "2511.21466v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21465v1",
      "title": "Ensemble Performance Through the Lens of Linear Independence of Classifier Votes in Data Streams",
      "authors": [
        "Enes Bektas",
        "Fazli Can"
      ],
      "abstract": "Ensemble learning improves classification performance by combining multiple base classifiers. While increasing the number of classifiers generally enhances accuracy, excessively large ensembles can lead to computational inefficiency and diminishing returns. This paper investigates the relationship between ensemble size and performance through the lens of linear independence among classifier votes in data streams. We propose that ensembles composed of linearly independent classifiers maximize representational capacity, particularly under a geometric model. We then generalize the importance of linear independence to the weighted majority voting problem. By modeling the probability of achieving linear independence among classifier outputs, we derive a theoretical framework that explains the trade-off between ensemble size and accuracy. Our analysis leads to a theoretical estimate of the ensemble size required to achieve a user-specified probability of linear independence. We validate our theory through experiments on both real-world and synthetic datasets using two ensemble methods, OzaBagging and GOOWE. Our results confirm that this theoretical estimate effectively identifies the point of performance saturation for robust ensembles like OzaBagging. Conversely, for complex weighting schemes like GOOWE, our framework reveals that high theoretical diversity can trigger algorithmic instability. Our implementation is publicly available to support reproducibility and future research.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21465v1",
        "pdf": "https://arxiv.org/pdf/2511.21465v1"
      },
      "arxiv_id": "2511.21465v1",
      "comment": "14 pages, 3 figures, 5 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21460v1",
      "title": "MADRA: Multi-Agent Debate for Risk-Aware Embodied Planning",
      "authors": [
        "Junjian Wang",
        "Lidan Zhao",
        "Xi Sheryl Zhang"
      ],
      "abstract": "Ensuring the safety of embodied AI agents during task planning is critical for real-world deployment, especially in household environments where dangerous instructions pose significant risks. Existing methods often suffer from either high computational costs due to preference alignment training or over-rejection when using single-agent safety prompts. To address these limitations, we propose MADRA, a training-free Multi-Agent Debate Risk Assessment framework that leverages collective reasoning to enhance safety awareness without sacrificing task performance. MADRA employs multiple LLM-based agents to debate the safety of a given instruction, guided by a critical evaluator that scores responses based on logical soundness, risk identification, evidence quality, and clarity. Through iterative deliberation and consensus voting, MADRA significantly reduces false rejections while maintaining high sensitivity to dangerous tasks. Additionally, we introduce a hierarchical cognitive collaborative planning framework that integrates safety, memory, planning, and self-evolution mechanisms to improve task success rates through continuous learning. We also contribute SafeAware-VH, a benchmark dataset for safety-aware task planning in VirtualHome, containing 800 annotated instructions. Extensive experiments on AI2-THOR and VirtualHome demonstrate that our approach achieves over 90% rejection of unsafe tasks while ensuring that safe-task rejection is low, outperforming existing methods in both safety and execution efficiency. Our work provides a scalable, model-agnostic solution for building trustworthy embodied agents.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21460v1",
        "pdf": "https://arxiv.org/pdf/2511.21460v1"
      },
      "arxiv_id": "2511.21460v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21452v1",
      "title": "Semantic-Enhanced Feature Matching with Learnable Geometric Verification for Cross-Modal Neuron Registration",
      "authors": [
        "Wenwei Li",
        "Lingyi Cai",
        "Hui Gong",
        "Qingming Luo",
        "Anan Li"
      ],
      "abstract": "Accurately registering in-vivo two-photon and ex-vivo fluorescence micro-optical sectioning tomography images of individual neurons is critical for structure-function analysis in neuroscience. This task is profoundly challenging due to a significant cross-modality appearance gap, the scarcity of annotated data and severe tissue deformations. We propose a novel deep learning framework to address these issues. Our method introduces a semantic-enhanced hybrid feature descriptor, which fuses the geometric precision of local features with the contextual robustness of a vision foundation model DINOV3 to bridge the modality gap. To handle complex deformations, we replace traditional RANSAC with a learnable Geometric Consistency Confidence Module, a novel classifier trained to identify and reject physically implausible correspondences. A data-efficient two-stage training strategy, involving pre-training on synthetically deformed data and fine-tuning on limited real data, overcomes the data scarcity problem. Our framework provides a robust and accurate solution for high-precision registration in challenging biomedical imaging scenarios, enabling large-scale correlative studies.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "eess.IV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21452v1",
        "pdf": "https://arxiv.org/pdf/2511.21452v1"
      },
      "arxiv_id": "2511.21452v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21448v1",
      "title": "Constructing and Benchmarking: a Labeled Email Dataset for Text-Based Phishing and Spam Detection Framework",
      "authors": [
        "Rebeka Toth",
        "Tamas Bisztray",
        "Richard Dubniczky"
      ],
      "abstract": "Phishing and spam emails remain a major cybersecurity threat, with attackers increasingly leveraging Large Language Models (LLMs) to craft highly deceptive content. This study presents a comprehensive email dataset containing phishing, spam, and legitimate messages, explicitly distinguishing between human- and LLM-generated content. Each email is annotated with its category, emotional appeal (e.g., urgency, fear, authority), and underlying motivation (e.g., link-following, credential theft, financial fraud). We benchmark multiple LLMs on their ability to identify these emotional and motivational cues and select the most reliable model to annotate the full dataset. To evaluate classification robustness, emails were also rephrased using several LLMs while preserving meaning and intent. A state-of-the-art LLM was then assessed on its performance across both original and rephrased emails using expert-labeled ground truth. The results highlight strong phishing detection capabilities but reveal persistent challenges in distinguishing spam from legitimate emails. Our dataset and evaluation framework contribute to improving AI-assisted email security systems. To support open science, all code, templates, and resources are available on our project site.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CR",
        "cs.AI",
        "cs.DB"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21448v1",
        "pdf": "https://arxiv.org/pdf/2511.21448v1"
      },
      "arxiv_id": "2511.21448v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21444v1",
      "title": "EWE: An Agentic Framework for Extreme Weather Analysis",
      "authors": [
        "Zhe Jiang",
        "Jiong Wang",
        "Xiaoyu Yue",
        "Zijie Guo",
        "Wenlong Zhang",
        "Fenghua Ling",
        "Wanli Ouyang",
        "Lei Bai"
      ],
      "abstract": "Extreme weather events pose escalating risks to global society, underscoring the urgent need to unravel their underlying physical mechanisms. Yet the prevailing expert-driven, labor-intensive diagnostic paradigm has created a critical analytical bottleneck, stalling scientific progress. While AI for Earth Science has achieved notable advances in prediction, the equally essential challenge of automated diagnostic reasoning remains largely unexplored. We present the Extreme Weather Expert (EWE), the first intelligent agent framework dedicated to this task. EWE emulates expert workflows through knowledge-guided planning, closed-loop reasoning, and a domain-tailored meteorological toolkit. It autonomously produces and interprets multimodal visualizations from raw meteorological data, enabling comprehensive diagnostic analyses. To catalyze progress, we introduce the first benchmark for this emerging field, comprising a curated dataset of 103 high-impact events and a novel step-wise evaluation metric. EWE marks a step toward automated scientific discovery and offers the potential to democratize expertise and intellectual resources, particularly for developing nations vulnerable to extreme weather.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI",
        "physics.ao-ph"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21444v1",
        "pdf": "https://arxiv.org/pdf/2511.21444v1"
      },
      "arxiv_id": "2511.21444v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21439v1",
      "title": "EvRainDrop: HyperGraph-guided Completion for Effective Frame and Event Stream Aggregation",
      "authors": [
        "Futian Wang",
        "Fan Zhang",
        "Xiao Wang",
        "Mengqi Wang",
        "Dexing Huang",
        "Jin Tang"
      ],
      "abstract": "Event cameras produce asynchronous event streams that are spatially sparse yet temporally dense. Mainstream event representation learning algorithms typically use event frames, voxels, or tensors as input. Although these approaches have achieved notable progress, they struggle to address the undersampling problem caused by spatial sparsity. In this paper, we propose a novel hypergraph-guided spatio-temporal event stream completion mechanism, which connects event tokens across different times and spatial locations via hypergraphs and leverages contextual information message passing to complete these sparse events. The proposed method can flexibly incorporate RGB tokens as nodes in the hypergraph within this completion framework, enabling multi-modal hypergraph-based information completion. Subsequently, we aggregate hypergraph node information across different time steps through self-attention, enabling effective learning and fusion of multi-modal features. Extensive experiments on both single- and multi-label event classification tasks fully validated the effectiveness of our proposed framework. The source code of this paper will be released on https://github.com/Event-AHU/EvRainDrop.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21439v1",
        "pdf": "https://arxiv.org/pdf/2511.21439v1"
      },
      "arxiv_id": "2511.21439v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21438v1",
      "title": "Conversational no-code and multi-agentic disease module identification and drug repurposing prediction with ChatDRex",
      "authors": [
        "Simon Süwer",
        "Kester Bagemihl",
        "Sylvie Baier",
        "Lucia Dicunta",
        "Markus List",
        "Jan Baumbach",
        "Andreas Maier",
        "Fernando M. Delgado-Chaves"
      ],
      "abstract": "Repurposing approved drugs offers a time-efficient and cost-effective alternative to traditional drug development. However, in silico prediction of repurposing candidates is challenging and requires the effective collaboration of specialists in various fields, including pharmacology, medicine, biology, and bioinformatics. Fragmented, specialized algorithms and tools often address only narrow aspects of the overall problem, and heterogeneous, unstructured data landscapes require specialized users to be involved. Hence, these data services do not integrate smoothly across workflows. With ChatDRex, we present a conversation-based, multi-agent system that facilitates the execution of complex bioinformatic analyses aiming for network-based drug repurposing prediction. It builds on the integrated systems medicine knowledge graph NeDRex. ChatDRex provides natural language access to its extensive biomedical KG and integrates bioinformatics agents for network analysis and drug repurposing, complemented by agents for functional coherence evaluation for in silico validation, as well as agents for literature mining and for discussing the obtained results in a scientific context. Its flexible multi-agent design assigns specific tasks to specialized agents, including query routing, data retrieval, algorithm execution, and result visualization. A dedicated reasoning module keeps the user in the loop and allows for hallucination detection. By enabling physicians and researchers without computer science expertise to control complex analyses in natural language, ChatDRex democratizes access to bioinformatics as an important resource for drug repurposing. It enables clinical experts to generate hypotheses and explore drug repurposing opportunities, ultimately accelerating the discovery of novel therapies and advancing personalized medicine and translational research.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI",
        "cs.MA"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21438v1",
        "pdf": "https://arxiv.org/pdf/2511.21438v1"
      },
      "arxiv_id": "2511.21438v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21437v1",
      "title": "A Systematic Study of Model Merging Techniques in Large Language Models",
      "authors": [
        "Oğuz Kağan Hitit",
        "Leander Girrbach",
        "Zeynep Akata"
      ],
      "abstract": "Model merging combines multiple fine-tuned checkpoints into a single model without additional training, offering an attractive approach to reusing models and efficiently improving performance. However, it remains unclear whether the advantages reported for smaller models and classifiers generalize to LLMs. We present a large-scale, systematic evaluation of six state-of-the-art merging methods, including recent subspace methods, across four open-weight LLMs, twelve fine-tuned checkpoints per base model, and sixteen standard LLM benchmarks. Evaluating through standardized benchmarks, we measure both the probability that a merged model outperforms the base model and relative gains over the best individual checkpoint. Our results show that the oldest and simplest method, Task Arithmetic, is the only approach that reliably yields performance gains on LLMs. Other interference-aware and subspace merging methods typically result in significant performance drops. Our findings indicate that current merging techniques do not directly transfer to modern LLMs. This motivates the design of LLM-specific merging algorithms and merging-aware fine-tuning methods. Code will be released upon acceptance of this paper.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21437v1",
        "pdf": "https://arxiv.org/pdf/2511.21437v1"
      },
      "arxiv_id": "2511.21437v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21428v1",
      "title": "From Observation to Action: Latent Action-based Primitive Segmentation for VLA Pre-training in Industrial Settings",
      "authors": [
        "Jiajie Zhang",
        "Sören Schwertfeger",
        "Alexander Kleiner"
      ],
      "abstract": "We present a novel unsupervised framework to unlock vast unlabeled human demonstration data from continuous industrial video streams for Vision-Language-Action (VLA) model pre-training. Our method first trains a lightweight motion tokenizer to encode motion dynamics, then employs an unsupervised action segmenter leveraging a novel \"Latent Action Energy\" metric to discover and segment semantically coherent action primitives. The pipeline outputs both segmented video clips and their corresponding latent action sequences, providing structured data directly suitable for VLA pre-training. Evaluations on public benchmarks and a proprietary electric motor assembly dataset demonstrate effective segmentation of key tasks performed by humans at workstations. Further clustering and quantitative assessment via a Vision-Language Model confirm the semantic coherence of the discovered action primitives. To our knowledge, this is the first fully automated end-to-end system for extracting and organizing VLA pre-training data from unstructured industrial videos, offering a scalable solution for embodied AI integration in manufacturing.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21428v1",
        "pdf": "https://arxiv.org/pdf/2511.21428v1"
      },
      "arxiv_id": "2511.21428v1",
      "comment": "10 pages, 5 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21422v1",
      "title": "E-M3RF: An Equivariant Multimodal 3D Re-assembly Framework",
      "authors": [
        "Adeela Islam",
        "Stefano Fiorini",
        "Manuel Lecha",
        "Theodore Tsesmelis",
        "Stuart James",
        "Pietro Morerio",
        "Alessio Del Bue"
      ],
      "abstract": "3D reassembly is a fundamental geometric problem, and in recent years it has increasingly been challenged by deep learning methods rather than classical optimization. While learning approaches have shown promising results, most still rely primarily on geometric features to assemble a whole from its parts. As a result, methods struggle when geometry alone is insufficient or ambiguous, for example, for small, eroded, or symmetric fragments. Additionally, solutions do not impose physical constraints that explicitly prevent overlapping assemblies. To address these limitations, we introduce E-M3RF, an equivariant multimodal 3D reassembly framework that takes as input the point clouds, containing both point positions and colors of fractured fragments, and predicts the transformations required to reassemble them using SE(3) flow matching. Each fragment is represented by both geometric and color features: i) 3D point positions are encoded as rotationconsistent geometric features using a rotation-equivariant encoder, ii) the colors at each 3D point are encoded with a transformer. The two feature sets are then combined to form a multimodal representation. We experimented on four datasets: two synthetic datasets, Breaking Bad and Fantastic Breaks, and two real-world cultural heritage datasets, RePAIR and Presious, demonstrating that E-M3RF on the RePAIR dataset reduces rotation error by 23.1% and translation error by 13.2%, while Chamfer Distance decreases by 18.4% compared to competing methods.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21422v1",
        "pdf": "https://arxiv.org/pdf/2511.21422v1"
      },
      "arxiv_id": "2511.21422v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21420v1",
      "title": "SAM Guided Semantic and Motion Changed Region Mining for Remote Sensing Change Captioning",
      "authors": [
        "Futian Wang",
        "Mengqi Wang",
        "Xiao Wang",
        "Haowen Wang",
        "Jin Tang"
      ],
      "abstract": "Remote sensing change captioning is an emerging and popular research task that aims to describe, in natural language, the content of interest that has changed between two remote sensing images captured at different times. Existing methods typically employ CNNs/Transformers to extract visual representations from the given images or incorporate auxiliary tasks to enhance the final results, with weak region awareness and limited temporal alignment. To address these issues, this paper explores the use of the SAM (Segment Anything Model) foundation model to extract region-level representations and inject region-of-interest knowledge into the captioning framework. Specifically, we employ a CNN/Transformer model to extract global-level vision features, leverage the SAM foundation model to delineate semantic- and motion-level change regions, and utilize a specially constructed knowledge graph to provide information about objects of interest. These heterogeneous sources of information are then fused via cross-attention, and a Transformer decoder is used to generate the final natural language description of the observed changes. Extensive experimental results demonstrate that our method achieves state-of-the-art performance across multiple widely used benchmark datasets. The source code of this paper will be released on https://github.com/Event-AHU/SAM_ChangeCaptioning",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21420v1",
        "pdf": "https://arxiv.org/pdf/2511.21420v1"
      },
      "arxiv_id": "2511.21420v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21417v1",
      "title": "New Hybrid Heuristics for Pseudo-Boolean Propagation",
      "authors": [
        "Mia Müßig",
        "Jan Johannsen"
      ],
      "abstract": "In pseudo-boolean solving the currently most successful unit propagation strategy is a hybrid mode combining the watched literal scheme with the counting method. This short paper introduces new heuristics for this hybrid decision, which are able to drastically outperform the current method in the RoundingSAT solver.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI",
        "math.OC"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21417v1",
        "pdf": "https://arxiv.org/pdf/2511.21417v1"
      },
      "arxiv_id": "2511.21417v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21416v1",
      "title": "Odin: Oriented Dual-module Integration for Text-rich Network Representation Learning",
      "authors": [
        "Kaifeng Hong",
        "Yinglong Zhang",
        "Xiaoying Hong",
        "Xuewen Xia",
        "Xing Xu"
      ],
      "abstract": "Text-attributed graphs require models to effectively combine strong textual understanding with structurally informed reasoning. Existing approaches either rely on GNNs--limited by over-smoothing and hop-dependent diffusion--or employ Transformers that overlook graph topology and treat nodes as isolated sequences. We propose Odin (Oriented Dual-module INtegration), a new architecture that injects graph structure into Transformers at selected depths through an oriented dual-module mechanism.Unlike message-passing GNNs, Odin does not rely on multi-hop diffusion; instead, multi-hop structures are integrated at specific Transformer layers, yielding low-, mid-, and high-level structural abstraction aligned with the model's semantic hierarchy. Because aggregation operates on the global [CLS] representation, Odin fundamentally avoids over-smoothing and decouples structural abstraction from neighborhood size or graph topology. We further establish that Odin's expressive power strictly contains that of both pure Transformers and GNNs.To make the design efficient in large-scale or low-resource settings, we introduce Light Odin, a lightweight variant that preserves the same layer-aligned structural abstraction for faster training and inference. Experiments on multiple text-rich graph benchmarks show that Odin achieves state-of-the-art accuracy, while Light Odin delivers competitive performance with significantly reduced computational cost. Together, Odin and Light Odin form a unified, hop-free framework for principled structure-text integration. The source code of this model has been released at https://github.com/hongkaifeng/Odin.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21416v1",
        "pdf": "https://arxiv.org/pdf/2511.21416v1"
      },
      "arxiv_id": "2511.21416v1",
      "comment": "32 pages, 2 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21415v1",
      "title": "DiverseVAR: Balancing Diversity and Quality of Next-Scale Visual Autoregressive Models",
      "authors": [
        "Mingue Park",
        "Prin Phunyaphibarn",
        "Phillip Y. Lee",
        "Minhyuk Sung"
      ],
      "abstract": "We introduce DiverseVAR, a framework that enhances the diversity of text-conditioned visual autoregressive models (VAR) at test time without requiring retraining, fine-tuning, or substantial computational overhead. While VAR models have recently emerged as strong competitors to diffusion and flow models for image generation, they suffer from a critical limitation in diversity, often producing nearly identical images even for simple prompts. This issue has largely gone unnoticed amid the predominant focus on image quality. We address this limitation at test time in two stages. First, inspired by diversity enhancement techniques in diffusion models, we propose injecting noise into the text embedding. This introduces a trade-off between diversity and image quality: as diversity increases, the image quality sharply declines. To preserve quality, we propose scale-travel: a novel latent refinement technique inspired by time-travel strategies in diffusion models. Specifically, we use a multi-scale autoencoder to extract coarse-scale tokens that enable us to resume generation at intermediate stages. Extensive experiments show that combining text-embedding noise injection with our scale-travel refinement significantly enhances diversity while minimizing image-quality degradation, achieving a new Pareto frontier in the diversity-quality trade-off.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21415v1",
        "pdf": "https://arxiv.org/pdf/2511.21415v1"
      },
      "arxiv_id": "2511.21415v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21414v1",
      "title": "SUPN: Shallow Universal Polynomial Networks",
      "authors": [
        "Zachary Morrow",
        "Michael Penwarden",
        "Brian Chen",
        "Aurya Javeed",
        "Akil Narayan",
        "John D. Jakeman"
      ],
      "abstract": "Deep neural networks (DNNs) and Kolmogorov-Arnold networks (KANs) are popular methods for function approximation due to their flexibility and expressivity. However, they typically require a large number of trainable parameters to produce a suitable approximation. Beyond making the resulting network less transparent, overparameterization creates a large optimization space, likely producing local minima in training that have quite different generalization errors. In this case, network initialization can have an outsize impact on the model's out-of-sample accuracy. For these reasons, we propose shallow universal polynomial networks (SUPNs). These networks replace all but the last hidden layer with a single layer of polynomials with learnable coefficients, leveraging the strengths of DNNs and polynomials to achieve sufficient expressivity with far fewer parameters. We prove that SUPNs converge at the same rate as the best polynomial approximation of the same degree, and we derive explicit formulas for quasi-optimal SUPN parameters. We complement theory with an extensive suite of numerical experiments involving SUPNs, DNNs, KANs, and polynomial projection in one, two, and ten dimensions, consisting of over 13,000 trained models. On the target functions we numerically studied, for a given number of trainable parameters, the approximation error and variability are often lower for SUPNs than for DNNs and KANs by an order of magnitude. In our examples, SUPNs even outperform polynomial projection on non-smooth functions.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "math.NA"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21414v1",
        "pdf": "https://arxiv.org/pdf/2511.21414v1"
      },
      "arxiv_id": "2511.21414v1",
      "comment": "25 pages, supplementary material",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21413v1",
      "title": "Automated Dynamic AI Inference Scaling on HPC-Infrastructure: Integrating Kubernetes, Slurm and vLLM",
      "authors": [
        "Tim Trappen",
        "Robert Keßler",
        "Roland Pabel",
        "Viktor Achter",
        "Stefan Wesner"
      ],
      "abstract": "Due to rising demands for Artificial Inteligence (AI) inference, especially in higher education, novel solutions utilising existing infrastructure are emerging. The utilisation of High-Performance Computing (HPC) has become a prevalent approach for the implementation of such solutions. However, the classical operating model of HPC does not adapt well to the requirements of synchronous, user-facing dynamic AI application workloads. In this paper, we propose our solution that serves LLMs by integrating vLLM, Slurm and Kubernetes on the supercomputer \\textit{RAMSES}. The initial benchmark indicates that the proposed architecture scales efficiently for 100, 500 and 1000 concurrent requests, incurring only an overhead of approximately 500 ms in terms of end-to-end latency.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.DC",
        "cs.AI",
        "cs.DB",
        "cs.PF"
      ],
      "primary_category": "cs.DC",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21413v1",
        "pdf": "https://arxiv.org/pdf/2511.21413v1"
      },
      "arxiv_id": "2511.21413v1",
      "comment": "6 pages, 3 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21409v1",
      "title": "Knowledge Distillation for Continual Learning of Biomedical Neural Fields",
      "authors": [
        "Wouter Visser",
        "Jelmer M. Wolterink"
      ],
      "abstract": "Neural fields are increasingly used as a light-weight, continuous, and differentiable signal representation in (bio)medical imaging. However, unlike discrete signal representations such as voxel grids, neural fields cannot be easily extended. As neural fields are, in essence, neural networks, prior signals represented in a neural field will degrade when the model is presented with new data due to catastrophic forgetting. This work examines the extent to which different neural field approaches suffer from catastrophic forgetting and proposes a strategy to mitigate this issue. We consider the scenario in which data becomes available incrementally, with only the most recent data available for neural field fitting. In a series of experiments on cardiac cine MRI data, we demonstrate how knowledge distillation mitigates catastrophic forgetting when the spatiotemporal domain is enlarged or the dimensionality of the represented signal is increased. We find that the amount of catastrophic forgetting depends, to a large extent, on the neural fields model used, and that distillation could enable continual learning in neural fields.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "eess.IV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21409v1",
        "pdf": "https://arxiv.org/pdf/2511.21409v1"
      },
      "arxiv_id": "2511.21409v1",
      "comment": "5 pages, 6 figures. Submitted to IEEE International Symposium on Biomedical Imaging (ISBI) 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21408v1",
      "title": "Subjective Depth and Timescale Transformers: Learning Where and When to Compute",
      "authors": [
        "Frederico Wieser",
        "Martin Benfeghoul",
        "Haitham Bou Ammar",
        "Jun Wang",
        "Zafeirios Fountas"
      ],
      "abstract": "The rigid, uniform allocation of computation in standard Transformer (TF) architectures can limit their efficiency and scalability, particularly for large-scale models and long sequences. Addressing this, we introduce Subjective Depth Transformers (SDT) and Subjective Timescale Transformers (STT), two distinct architectures that leverage Bayesian surprise signals to dynamically route computation, learning where and when to compute within decoder-only TFs. SDT augments a decoder-only stack with alternating Decision and Dynamic layers: a Decision layer computes a full block 'posterior' and a lightweight 'prior,' while a Dynamic layer employs fixed-capacity Top-K routing based on Bayesian surprise (Expected and Unexpected Change), maintaining a static compute graph. STT extends this conditional computation to the temporal domain: a transition network predicts residual updates, forming a temporal 'change hypothesis' that informs a router to dynamically execute or bypass TF blocks for each token, managing KV-cache contributions. Both architectures exhibit the predicted shift from novelty to prediction driven gating over training, suggesting alignment with surprise based principles. While operating at reduced capacity, they offer preliminary insights into the compute-accuracy trade-offs of conditional computation. The proposed architectures establish a flexible framework for efficiency, reducing self-attention computation by 75% and KV-cache requirements by 50% within each compute skipping layer, setting a pathway for more efficient models.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CL",
        "cs.IT"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21408v1",
        "pdf": "https://arxiv.org/pdf/2511.21408v1"
      },
      "arxiv_id": "2511.21408v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21399v1",
      "title": "Training Introspective Behavior: Fine-Tuning Induces Reliable Internal State Detection in a 7B Model",
      "authors": [
        "Joshua Fonseca Rivera"
      ],
      "abstract": "Lindsey (2025) investigates introspective awareness in language models through four experiments, finding that models can sometimes detect and identify injected activation patterns -- but unreliably (~20% success in the best model). We focus on the first of these experiments -- self-report of injected \"thoughts\" -- and ask whether this capability can be directly trained rather than waiting for emergence. Through fine-tuning on transient single-token injections, we transform a 7B parameter model from near-complete failure (0.4% accuracy, 6.7% false positive rate) to reliable detection (85% accuracy on held-out concepts at α=40, 0% false positives). Our model detects fleeting \"thoughts\" injected at a single token position, retains that information, and reports the semantic content across subsequent generation steps. On this task, our trained model satisfies three of Lindsey's criteria: accuracy (correct identification), grounding (0/60 false positives), and internality (detection precedes verbalization). Generalization to unseen concept vectors (7.5pp gap) demonstrates the model learns a transferable skill rather than memorizing specific vectors, though this does not establish metacognitive representation in Lindsey's sense. These results address an open question raised by Lindsey: whether \"training for introspection would help eliminate cross-model differences.\" We show that at least one component of introspective behavior can be directly induced, offering a pathway to built-in AI transparency.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21399v1",
        "pdf": "https://arxiv.org/pdf/2511.21399v1"
      },
      "arxiv_id": "2511.21399v1",
      "comment": "16 pages, 8 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21398v1",
      "title": "Prune4Web: DOM Tree Pruning Programming for Web Agent",
      "authors": [
        "Jiayuan Zhang",
        "Kaiquan Chen",
        "Zhihao Lu",
        "Enshen Zhou",
        "Qian Yu",
        "Jing Zhang"
      ],
      "abstract": "Web automation employs intelligent agents to execute high-level tasks by mimicking human interactions with web interfaces. Despite the capabilities of recent Large Language Model (LLM)-based web agents, navigating complex, real-world webpages efficiently remains a significant hurdle due to the prohibitively large size of Document Object Model (DOM) structures, often ranging from 10,000 to 100,000 tokens. Existing strategies typically rely on crude DOM truncation -- risking the loss of critical information -- or employ inefficient heuristics and separate ranking models, failing to achieve an optimal balance between precision and scalability. To address these challenges, we introduce Prune4Web, a novel paradigm that shifts DOM processing from resource-intensive LLM reading to efficient programmatic pruning. Central to our approach is DOM Tree Pruning Programming, where an LLM generates executable Python scoring scripts to dynamically filter DOM elements based on semantic cues from decomposed sub-tasks. This mechanism eliminates the need for LLMs to ingest raw, massive DOMs, instead delegating traversal and scoring to lightweight, interpretable programs. This methodology achieves a 25x to 50x reduction in candidate elements for grounding, thereby facilitating precise action localization while mitigating attention dilution. Furthermore, we propose a specialized data annotation pipeline and a two-turn dialogue training strategy that jointly optimizes the Planner, Programmatic Filter, and Grounder within a unified framework. Extensive experiments demonstrate state-of-the-art performance. Notably, on our low-level grounding task, Prune4Web dramatically improves accuracy from 46.8% to 88.28%, underscoring its efficacy in real-world web automation.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.HC",
        "cs.MA"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21398v1",
        "pdf": "https://arxiv.org/pdf/2511.21398v1"
      },
      "arxiv_id": "2511.21398v1",
      "comment": "Paper accepted to AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21397v1",
      "title": "Do Reasoning Vision-Language Models Inversely Scale in Test-Time Compute? A Distractor-centric Empirical Analysis",
      "authors": [
        "Jiyun Bae",
        "Hyunjong Ok",
        "Sangwoo Mo",
        "Jaeho Lee"
      ],
      "abstract": "How does irrelevant information (i.e., distractors) affect test-time scaling in vision-language models (VLMs)? Prior studies on language models have reported an inverse scaling effect, where textual distractors lead to longer but less effective reasoning. To investigate whether similar phenomena occur in multimodal settings, we introduce Idis (Images with distractors), a visual question-answering dataset that systematically varies distractors along semantic, numerical, and spatial dimensions. Our analyses reveal that visual distractors differ fundamentally from textual ones: although inverse scaling persists, adding visual distractors reduces accuracy without increasing reasoning length. We further show that tracking attribute counts within reasoning traces provides key insights into how distractors, reasoning length, and accuracy interact. Finally, we demonstrate that these trends extend to established visual bias benchmarks such as Waterbirds, and we propose a simple prompting strategy to mitigate bias-driven predictions in reasoning models.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21397v1",
        "pdf": "https://arxiv.org/pdf/2511.21397v1"
      },
      "arxiv_id": "2511.21397v1",
      "comment": "preprint",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21395v1",
      "title": "Monet: Reasoning in Latent Visual Space Beyond Images and Language",
      "authors": [
        "Qixun Wang",
        "Yang Shi",
        "Yifei Wang",
        "Yuanxing Zhang",
        "Pengfei Wan",
        "Kun Gai",
        "Xianghua Ying",
        "Yisen Wang"
      ],
      "abstract": "\"Thinking with images\" has emerged as an effective paradigm for advancing visual reasoning, extending beyond text-only chains of thought by injecting visual evidence into intermediate reasoning steps. However, existing methods fall short of human-like abstract visual thinking, as their flexibility is fundamentally limited by external tools. In this work, we introduce Monet, a training framework that enables multimodal large language models (MLLMs) to reason directly within the latent visual space by generating continuous embeddings that function as intermediate visual thoughts. We identify two core challenges in training MLLMs for latent visual reasoning: high computational cost in latent-vision alignment and insufficient supervision over latent embeddings, and address them with a three-stage distillation-based supervised fine-tuning (SFT) pipeline. We further reveal a limitation of applying GRPO to latent reasoning: it primarily enhances text-based reasoning rather than latent reasoning. To overcome this, we propose VLPO (Visual-latent Policy Optimization), a reinforcement learning method that explicitly incorporates latent embeddings into policy gradient updates. To support SFT, we construct Monet-SFT-125K, a high-quality text-image interleaved CoT dataset containing 125K real-world, chart, OCR, and geometry CoTs. Our model, Monet-7B, shows consistent gains across real-world perception and reasoning benchmarks and exhibits strong out-of-distribution generalization on challenging abstract visual reasoning tasks. We also empirically analyze the role of each training component and discuss our early unsuccessful attempts, providing insights for future developments in visual latent reasoning. Our model, data, and code are available at https://github.com/NOVAglow646/Monet.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21395v1",
        "pdf": "https://arxiv.org/pdf/2511.21395v1"
      },
      "arxiv_id": "2511.21395v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21394v1",
      "title": "RIA: A Ranking-Infused Approach for Optimized listwise CTR Prediction",
      "authors": [
        "Guoxiao Zhang",
        "Tan Qu",
        "Ao Li",
        "DongLin Ni",
        "Qianlong Xie",
        "Xingxing Wang"
      ],
      "abstract": "Reranking improves recommendation quality by modeling item interactions. However, existing methods often decouple ranking and reranking, leading to weak listwise evaluation models that suffer from combinatorial sparsity and limited representational power under strict latency constraints. In this paper, we propose RIA (Ranking-Infused Architecture), a unified, end-to-end framework that seamlessly integrates pointwise and listwise evaluation. RIA introduces four key components: (1) the User and Candidate DualTransformer (UCDT) for fine-grained user-item-context modeling; (2) the Context-aware User History and Target (CUHT) module for position-sensitive preference learning; (3) the Listwise Multi-HSTU (LMH) module to capture hierarchical item dependencies; and (4) the Embedding Cache (EC) module to bridge efficiency and effectiveness during inference. By sharing representations across ranking and reranking, RIA enables rich contextual knowledge transfer while maintaining low latency. Extensive experiments show that RIA outperforms state-of-the-art models on both public and industrial datasets, achieving significant gains in AUC and LogLoss. Deployed in Meituan advertising system, RIA yields a +1.69% improvement in Click-Through Rate (CTR) and a +4.54% increase in Cost Per Mille (CPM) in online A/B tests.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.IR",
        "cs.AI"
      ],
      "primary_category": "cs.IR",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21394v1",
        "pdf": "https://arxiv.org/pdf/2511.21394v1"
      },
      "arxiv_id": "2511.21394v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21389v1",
      "title": "FITRep: Attention-Guided Item Representation via MLLMs",
      "authors": [
        "Guoxiao Zhang",
        "Ao Li",
        "Tan Qu",
        "Qianlong Xie",
        "Xingxing Wang"
      ],
      "abstract": "Online platforms usually suffer from user experience degradation due to near-duplicate items with similar visuals and text. While Multimodal Large Language Models (MLLMs) enable multimodal embedding, existing methods treat representations as black boxes, ignoring structural relationships (e.g., primary vs. auxiliary elements), leading to local structural collapse problem. To address this, inspired by Feature Integration Theory (FIT), we propose FITRep, the first attention-guided, white-box item representation framework for fine-grained item deduplication. FITRep consists of: (1) Concept Hierarchical Information Extraction (CHIE), using MLLMs to extract hierarchical semantic concepts; (2) Structure-Preserving Dimensionality Reduction (SPDR), an adaptive UMAP-based method for efficient information compression; and (3) FAISS-Based Clustering (FBC), a FAISS-based clustering that assigns each item a unique cluster id using FAISS. Deployed on Meituan's advertising system, FITRep achieves +3.60% CTR and +4.25% CPM gains in online A/B tests, demonstrating both effectiveness and real-world impact.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.IR",
        "cs.AI"
      ],
      "primary_category": "cs.IR",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21389v1",
        "pdf": "https://arxiv.org/pdf/2511.21389v1"
      },
      "arxiv_id": "2511.21389v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21381v1",
      "title": "BanglaASTE: A Novel Framework for Aspect-Sentiment-Opinion Extraction in Bangla E-commerce Reviews Using Ensemble Deep Learning",
      "authors": [
        "Ariful Islam",
        "Md Rifat Hossen",
        "Abir Ahmed",
        "B M Taslimul Haque"
      ],
      "abstract": "Aspect-Based Sentiment Analysis (ABSA) has emerged as a critical tool for extracting fine-grained sentiment insights from user-generated content, particularly in e-commerce and social media domains. However, research on Bangla ABSA remains significantly underexplored due to the absence of comprehensive datasets and specialized frameworks for triplet extraction in this language. This paper introduces BanglaASTE, a novel framework for Aspect Sentiment Triplet Extraction (ASTE) that simultaneously identifies aspect terms, opinion expressions, and sentiment polarities from Bangla product reviews. Our contributions include: (1) creation of the first annotated Bangla ASTE dataset containing 3,345 product reviews collected from major e-commerce platforms including Daraz, Facebook, and Rokomari; (2) development of a hybrid classification framework that employs graph-based aspect-opinion matching with semantic similarity techniques; and (3) implementation of an ensemble model combining BanglaBERT contextual embeddings with XGBoost boosting algorithms for enhanced triplet extraction performance. Experimental results demonstrate that our ensemble approach achieves superior performance with 89.9% accuracy and 89.1% F1-score, significantly outperforming baseline models across all evaluation metrics. The framework effectively addresses key challenges in Bangla text processing including informal expressions, spelling variations, and data sparsity. This research advances the state-of-the-art in low-resource language sentiment analysis and provides a scalable solution for Bangla e-commerce analytics applications.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.CL"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21381v1",
        "pdf": "https://arxiv.org/pdf/2511.21381v1"
      },
      "arxiv_id": "2511.21381v1",
      "comment": "Presented at the 2025 IEEE International Conference on Signal Processing, Information, Communication and Systems (SPICSCON), November 21-22, 2025, University of Rajshahi, Bangladesh. 6 pages, ensemble deep learning, 3,345 annotated Bangla product reviews",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.21378v1",
      "title": "Anomaly Detection with Adaptive and Aggressive Rejection for Contaminated Training Data",
      "authors": [
        "Jungi Lee",
        "Jungkwon Kim",
        "Chi Zhang",
        "Kwangsun Yoo",
        "Seok-Joo Byun"
      ],
      "abstract": "Handling contaminated data poses a critical challenge in anomaly detection, as traditional models assume training on purely normal data. Conventional methods mitigate contamination by relying on fixed contamination ratios, but discrepancies between assumed and actual ratios can severely degrade performance, especially in noisy environments where normal and abnormal data distributions overlap. To address these limitations, we propose Adaptive and Aggressive Rejection (AAR), a novel method that dynamically excludes anomalies using a modified z-score and Gaussian mixture model-based thresholds. AAR effectively balances the trade-off between preserving normal data and excluding anomalies by integrating hard and soft rejection strategies. Extensive experiments on two image datasets and thirty tabular datasets demonstrate that AAR outperforms the state-of-the-art method by 0.041 AUROC. By providing a scalable and reliable solution, AAR enhances robustness against contaminated datasets, paving the way for broader real-world applications in domains such as security and healthcare.",
      "published": "2025-11-26",
      "updated": "2025-11-26",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.21378v1",
        "pdf": "https://arxiv.org/pdf/2511.21378v1"
      },
      "arxiv_id": "2511.21378v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    }
  ]
}