{
  "fetched_at": "2025-12-17T00:25:58.263806",
  "total_papers": 100,
  "papers": [
    {
      "id": "2512.13690v1",
      "title": "DiffusionBrowser: Interactive Diffusion Previews via Multi-Branch Decoders",
      "authors": [
        "Susung Hong",
        "Chongjian Ge",
        "Zhifei Zhang",
        "Jui-Hsien Wang"
      ],
      "abstract": "Video diffusion models have revolutionized generative video synthesis, but they are imprecise, slow, and can be opaque during generation -- keeping users in the dark for a prolonged period. In this work, we propose DiffusionBrowser, a model-agnostic, lightweight decoder framework that allows users to interactively generate previews at any point (timestep or transformer block) during the denoising process. Our model can generate multi-modal preview representations that include RGB and scene intrinsics at more than 4$\\times$ real-time speed (less than 1 second for a 4-second video) that convey consistent appearance and motion to the final video. With the trained decoder, we show that it is possible to interactively guide the generation at intermediate noise steps via stochasticity reinjection and modal steering, unlocking a new control capability. Moreover, we systematically probe the model using the learned decoders, revealing how scene, object, and other details are composed and assembled during the otherwise black-box denoising process.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.GR",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13690v1",
        "pdf": "https://arxiv.org/pdf/2512.13690v1"
      },
      "arxiv_id": "2512.13690v1",
      "comment": "Project page: https://susunghong.github.io/DiffusionBrowser",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13689v1",
      "title": "LitePT: Lighter Yet Stronger Point Transformer",
      "authors": [
        "Yuanwen Yue",
        "Damien Robert",
        "Jianyuan Wang",
        "Sunghwan Hong",
        "Jan Dirk Wegner",
        "Christian Rupprecht",
        "Konrad Schindler"
      ],
      "abstract": "Modern neural architectures for 3D point cloud processing contain both convolutional layers and attention blocks, but the best way to assemble them remains unclear. We analyse the role of different computational blocks in 3D point cloud networks and find an intuitive behaviour: convolution is adequate to extract low-level geometry at high-resolution in early layers, where attention is expensive without bringing any benefits; attention captures high-level semantics and context in low-resolution, deep layers more efficiently. Guided by this design principle, we propose a new, improved 3D point cloud backbone that employs convolutions in early stages and switches to attention for deeper layers. To avoid the loss of spatial layout information when discarding redundant convolution layers, we introduce a novel, training-free 3D positional encoding, PointROPE. The resulting LitePT model has $3.6\\times$ fewer parameters, runs $2\\times$ faster, and uses $2\\times$ less memory than the state-of-the-art Point Transformer V3, but nonetheless matches or even outperforms it on a range of tasks and datasets. Code and models are available at: https://github.com/prs-eth/LitePT.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13689v1",
        "pdf": "https://arxiv.org/pdf/2512.13689v1"
      },
      "arxiv_id": "2512.13689v1",
      "comment": "Project page: https://litept.github.io/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13687v1",
      "title": "Towards Scalable Pre-training of Visual Tokenizers for Generation",
      "authors": [
        "Jingfeng Yao",
        "Yuda Song",
        "Yucong Zhou",
        "Xinggang Wang"
      ],
      "abstract": "The quality of the latent space in visual tokenizers (e.g., VAEs) is crucial for modern generative models. However, the standard reconstruction-based training paradigm produces a latent space that is biased towards low-level information, leading to a foundation flaw: better pixel-level accuracy does not lead to higher-quality generation. This implies that pouring extensive compute into visual tokenizer pre-training translates poorly to improved performance in generation. We identify this as the ``pre-training scaling problem`` and suggest a necessary shift: to be effective for generation, a latent space must concisely represent high-level semantics. We present VTP, a unified visual tokenizer pre-training framework, pioneering the joint optimization of image-text contrastive, self-supervised, and reconstruction losses. Our large-scale study reveals two principal findings: (1) understanding is a key driver of generation, and (2) much better scaling properties, where generative performance scales effectively with compute, parameters, and data allocated to the pretraining of the visual tokenizer. After large-scale pre-training, our tokenizer delivers a competitive profile (78.2 zero-shot accuracy and 0.36 rFID on ImageNet) and 4.1 times faster convergence on generation compared to advanced distillation methods. More importantly, it scales effectively: without modifying standard DiT training specs, solely investing more FLOPS in pretraining VTP achieves 65.8\\% FID improvement in downstream generation, while conventional autoencoder stagnates very early at 1/10 FLOPS. Our pre-trained models are available at https://github.com/MiniMax-AI/VTP.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13687v1",
        "pdf": "https://arxiv.org/pdf/2512.13687v1"
      },
      "arxiv_id": "2512.13687v1",
      "comment": "Our pre-trained models are available at https://github.com/MiniMax-AI/VTP",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13684v1",
      "title": "Recurrent Video Masked Autoencoders",
      "authors": [
        "Daniel Zoran",
        "Nikhil Parthasarathy",
        "Yi Yang",
        "Drew A Hudson",
        "Joao Carreira",
        "Andrew Zisserman"
      ],
      "abstract": "We present Recurrent Video Masked-Autoencoders (RVM): a novel video representation learning approach that uses a transformer-based recurrent neural network to aggregate dense image features over time, effectively capturing the spatio-temporal structure of natural video data. RVM learns via an asymmetric masked prediction task requiring only a standard pixel reconstruction objective. This design yields a highly efficient ``generalist'' encoder: RVM achieves competitive performance with state-of-the-art video models (e.g. VideoMAE, V-JEPA) on video-level tasks like action recognition and point/object tracking, while also performing favorably against image models (e.g. DINOv2) on tasks that test geometric and dense spatial understanding. Notably, RVM achieves strong performance in the small-model regime without requiring knowledge distillation, exhibiting up to 30x greater parameter efficiency than competing video masked autoencoders. Moreover, we demonstrate that RVM's recurrent nature allows for stable feature propagation over long temporal horizons with linear computational cost, overcoming some of the limitations of standard spatio-temporal attention-based architectures. Finally, we use qualitative visualizations to highlight that RVM learns rich representations of scene semantics, structure, and motion.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13684v1",
        "pdf": "https://arxiv.org/pdf/2512.13684v1"
      },
      "arxiv_id": "2512.13684v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13683v1",
      "title": "I-Scene: 3D Instance Models are Implicit Generalizable Spatial Learners",
      "authors": [
        "Lu Ling",
        "Yunhao Ge",
        "Yichen Sheng",
        "Aniket Bera"
      ],
      "abstract": "Generalization remains the central challenge for interactive 3D scene generation. Existing learning-based approaches ground spatial understanding in limited scene dataset, restricting generalization to new layouts. We instead reprogram a pre-trained 3D instance generator to act as a scene level learner, replacing dataset-bounded supervision with model-centric spatial supervision. This reprogramming unlocks the generator transferable spatial knowledge, enabling generalization to unseen layouts and novel object compositions. Remarkably, spatial reasoning still emerges even when the training scenes are randomly composed objects. This demonstrates that the generator's transferable scene prior provides a rich learning signal for inferring proximity, support, and symmetry from purely geometric cues. Replacing widely used canonical space, we instantiate this insight with a view-centric formulation of the scene space, yielding a fully feed-forward, generalizable scene generator that learns spatial relations directly from the instance model. Quantitative and qualitative results show that a 3D instance generator is an implicit spatial learner and reasoner, pointing toward foundation models for interactive 3D scene understanding and generation. Project page: https://luling06.github.io/I-Scene-project/",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13683v1",
        "pdf": "https://arxiv.org/pdf/2512.13683v1"
      },
      "arxiv_id": "2512.13683v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13680v1",
      "title": "LASER: Layer-wise Scale Alignment for Training-Free Streaming 4D Reconstruction",
      "authors": [
        "Tianye Ding",
        "Yiming Xie",
        "Yiqing Liang",
        "Moitreya Chatterjee",
        "Pedro Miraldo",
        "Huaizu Jiang"
      ],
      "abstract": "Recent feed-forward reconstruction models like VGGT and $π^3$ achieve impressive reconstruction quality but cannot process streaming videos due to quadratic memory complexity, limiting their practical deployment. While existing streaming methods address this through learned memory mechanisms or causal attention, they require extensive retraining and may not fully leverage the strong geometric priors of state-of-the-art offline models. We propose LASER, a training-free framework that converts an offline reconstruction model into a streaming system by aligning predictions across consecutive temporal windows. We observe that simple similarity transformation ($\\mathrm{Sim}(3)$) alignment fails due to layer depth misalignment: monocular scale ambiguity causes relative depth scales of different scene layers to vary inconsistently between windows. To address this, we introduce layer-wise scale alignment, which segments depth predictions into discrete layers, computes per-layer scale factors, and propagates them across both adjacent windows and timestamps. Extensive experiments show that LASER achieves state-of-the-art performance on camera pose estimation and point map reconstruction %quality with offline models while operating at 14 FPS with 6 GB peak memory on a RTX A6000 GPU, enabling practical deployment for kilometer-scale streaming videos. Project website: $\\href{https://neu-vi.github.io/LASER/}{\\texttt{https://neu-vi.github.io/LASER/}}$",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13680v1",
        "pdf": "https://arxiv.org/pdf/2512.13680v1"
      },
      "arxiv_id": "2512.13680v1",
      "comment": "16 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13678v1",
      "title": "Feedforward 3D Editing via Text-Steerable Image-to-3D",
      "authors": [
        "Ziqi Ma",
        "Hongqiao Chen",
        "Yisong Yue",
        "Georgia Gkioxari"
      ],
      "abstract": "Recent progress in image-to-3D has opened up immense possibilities for design, AR/VR, and robotics. However, to use AI-generated 3D assets in real applications, a critical requirement is the capability to edit them easily. We present a feedforward method, Steer3D, to add text steerability to image-to-3D models, which enables editing of generated 3D assets with language. Our approach is inspired by ControlNet, which we adapt to image-to-3D generation to enable text steering directly in a forward pass. We build a scalable data engine for automatic data generation, and develop a two-stage training recipe based on flow-matching training and Direct Preference Optimization (DPO). Compared to competing methods, Steer3D more faithfully follows the language instruction and maintains better consistency with the original 3D asset, while being 2.4x to 28.5x faster. Steer3D demonstrates that it is possible to add a new modality (text) to steer the generation of pretrained image-to-3D generative models with 100k data. Project website: https://glab-caltech.github.io/steer3d/",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13678v1",
        "pdf": "https://arxiv.org/pdf/2512.13678v1"
      },
      "arxiv_id": "2512.13678v1",
      "comment": "https://glab-caltech.github.io/steer3d/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13677v1",
      "title": "JoVA: Unified Multimodal Learning for Joint Video-Audio Generation",
      "authors": [
        "Xiaohu Huang",
        "Hao Zhou",
        "Qiangpeng Yang",
        "Shilei Wen",
        "Kai Han"
      ],
      "abstract": "In this paper, we present JoVA, a unified framework for joint video-audio generation. Despite recent encouraging advances, existing methods face two critical limitations. First, most existing approaches can only generate ambient sounds and lack the capability to produce human speech synchronized with lip movements. Second, recent attempts at unified human video-audio generation typically rely on explicit fusion or modality-specific alignment modules, which introduce additional architecture design and weaken the model simplicity of the original transformers. To address these issues, JoVA employs joint self-attention across video and audio tokens within each transformer layer, enabling direct and efficient cross-modal interaction without the need for additional alignment modules. Furthermore, to enable high-quality lip-speech synchronization, we introduce a simple yet effective mouth-area loss based on facial keypoint detection, which enhances supervision on the critical mouth region during training without compromising architectural simplicity. Extensive experiments on benchmarks demonstrate that JoVA outperforms or is competitive with both unified and audio-driven state-of-the-art methods in lip-sync accuracy, speech quality, and overall video-audio generation fidelity. Our results establish JoVA as an elegant framework for high-quality multimodal generation.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13677v1",
        "pdf": "https://arxiv.org/pdf/2512.13677v1"
      },
      "arxiv_id": "2512.13677v1",
      "comment": "Project page: \\url{https://visual-ai.github.io/jova}",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13674v1",
      "title": "Towards Interactive Intelligence for Digital Humans",
      "authors": [
        "Yiyi Cai",
        "Xuangeng Chu",
        "Xiwei Gao",
        "Sitong Gong",
        "Yifei Huang",
        "Caixin Kang",
        "Kunhang Li",
        "Haiyang Liu",
        "Ruicong Liu",
        "Yun Liu",
        "Dianwen Ng",
        "Zixiong Su",
        "Erwin Wu",
        "Yuhan Wu",
        "Dingkun Yan",
        "Tianyu Yan",
        "Chang Zeng",
        "Bo Zheng",
        "You Zhou"
      ],
      "abstract": "We introduce Interactive Intelligence, a novel paradigm of digital human that is capable of personality-aligned expression, adaptive interaction, and self-evolution. To realize this, we present Mio (Multimodal Interactive Omni-Avatar), an end-to-end framework composed of five specialized modules: Thinker, Talker, Face Animator, Body Animator, and Renderer. This unified architecture integrates cognitive reasoning with real-time multimodal embodiment to enable fluid, consistent interaction. Furthermore, we establish a new benchmark to rigorously evaluate the capabilities of interactive intelligence. Extensive experiments demonstrate that our framework achieves superior performance compared to state-of-the-art methods across all evaluated dimensions. Together, these contributions move digital humans beyond superficial imitation toward intelligent interaction.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.CL",
        "cs.GR",
        "cs.HC"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13674v1",
        "pdf": "https://arxiv.org/pdf/2512.13674v1"
      },
      "arxiv_id": "2512.13674v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13672v1",
      "title": "Directional Textual Inversion for Personalized Text-to-Image Generation",
      "authors": [
        "Kunhee Kim",
        "NaHyeon Park",
        "Kibeom Hong",
        "Hyunjung Shim"
      ],
      "abstract": "Textual Inversion (TI) is an efficient approach to text-to-image personalization but often fails on complex prompts. We trace these failures to embedding norm inflation: learned tokens drift to out-of-distribution magnitudes, degrading prompt conditioning in pre-norm Transformers. Empirically, we show semantics are primarily encoded by direction in CLIP token space, while inflated norms harm contextualization; theoretically, we analyze how large magnitudes attenuate positional information and hinder residual updates in pre-norm blocks. We propose Directional Textual Inversion (DTI), which fixes the embedding magnitude to an in-distribution scale and optimizes only direction on the unit hypersphere via Riemannian SGD. We cast direction learning as MAP with a von Mises-Fisher prior, yielding a constant-direction prior gradient that is simple and efficient to incorporate. Across personalization tasks, DTI improves text fidelity over TI and TI-variants while maintaining subject similarity. Crucially, DTI's hyperspherical parameterization enables smooth, semantically coherent interpolation between learned concepts (slerp), a capability that is absent in standard TI. Our findings suggest that direction-only optimization is a robust and scalable path for prompt-faithful personalization.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.CV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13672v1",
        "pdf": "https://arxiv.org/pdf/2512.13672v1"
      },
      "arxiv_id": "2512.13672v1",
      "comment": "Project page: https://kunheek.github.io/dti",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13671v1",
      "title": "AgentIAD: Tool-Augmented Single-Agent for Industrial Anomaly Detection",
      "authors": [
        "Junwen Miao",
        "Penghui Du",
        "Yi Liu",
        "Yu Wang",
        "Yan Wang"
      ],
      "abstract": "Industrial anomaly detection (IAD) is difficult due to the scarcity of normal reference samples and the subtle, localized nature of many defects. Single-pass vision-language models (VLMs) often overlook small abnormalities and lack explicit mechanisms to compare against canonical normal patterns. We propose AgentIAD, a tool-driven agentic framework that enables multi-stage visual inspection. The agent is equipped with a Perceptive Zoomer (PZ) for localized fine-grained analysis and a Comparative Retriever (CR) for querying normal exemplars when evidence is ambiguous. To teach these inspection behaviors, we construct structured perceptive and comparative trajectories from the MMAD dataset and train the model in two stages: supervised fine-tuning followed by reinforcement learning. A two-part reward design drives this process: a perception reward that supervises classification accuracy, spatial alignment, and type correctness, and a behavior reward that encourages efficient tool use. Together, these components enable the model to refine its judgment through step-wise observation, zooming, and verification. AgentIAD achieves a new state-of-the-art 97.62% classification accuracy on MMAD, surpassing prior MLLM-based approaches while producing transparent and interpretable inspection traces.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13671v1",
        "pdf": "https://arxiv.org/pdf/2512.13671v1"
      },
      "arxiv_id": "2512.13671v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13668v1",
      "title": "A Scientific Reasoning Model for Organic Synthesis Procedure Generation",
      "authors": [
        "Guoqing Liu",
        "Junren Li",
        "Zihan Zhao",
        "Eray Inanc",
        "Krzysztof Maziarz",
        "Jose Garrido Torres",
        "Victor Garcia Satorras",
        "Shoko Ueda",
        "Christopher M. Bishop",
        "Marwin Segler"
      ],
      "abstract": "Solving computer-aided synthesis planning is essential for enabling fully automated, robot-assisted synthesis workflows and improving the efficiency of drug discovery. A key challenge, however, is bridging the gap between computational route design and practical laboratory execution, particularly the accurate prediction of viable experimental procedures for each synthesis step. In this work, we present QFANG, a scientific reasoning language model capable of generating precise, structured experimental procedures directly from reaction equations, with explicit chain-of-thought reasoning. To develop QFANG, we curated a high-quality dataset comprising 905,990 chemical reactions paired with structured action sequences, extracted and processed from patent literature using large language models. We introduce a Chemistry-Guided Reasoning (CGR) framework that produces chain-of-thought data grounded in chemical knowledge at scale. The model subsequently undergoes supervised fine-tuning to elicit complex chemistry reasoning. Finally, we apply Reinforcement Learning from Verifiable Rewards (RLVR) to further enhance procedural accuracy. Experimental results demonstrate that QFANG outperforms advanced general-purpose reasoning models and nearest-neighbor retrieval baselines, measured by traditional NLP similarity metrics and a chemically aware evaluator using an LLM-as-a-judge. Moreover, QFANG generalizes to certain out-of-domain reaction classes and adapts to variations in laboratory conditions and user-specific constraints. We believe that QFANG's ability to generate high-quality synthesis procedures represents an important step toward bridging the gap between computational synthesis planning and fully automated laboratory synthesis.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13668v1",
        "pdf": "https://arxiv.org/pdf/2512.13668v1"
      },
      "arxiv_id": "2512.13668v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13666v1",
      "title": "SEDULity: A Proof-of-Learning Framework for Distributed and Secure Blockchains with Efficient Useful Work",
      "authors": [
        "Weihang Cao",
        "Mustafa Doger",
        "Sennur Ulukus"
      ],
      "abstract": "The security and decentralization of Proof-of-Work (PoW) have been well-tested in existing blockchain systems. However, its tremendous energy waste has raised concerns about sustainability. Proof-of-Useful-Work (PoUW) aims to redirect the meaningless computation to meaningful tasks such as solving machine learning (ML) problems, giving rise to the branch of Proof-of-Learning (PoL). While previous studies have proposed various PoLs, they all, to some degree, suffer from security, decentralization, or efficiency issues. In this paper, we propose a PoL framework that trains ML models efficiently while maintaining blockchain security in a fully distributed manner. We name the framework SEDULity, which stands for a Secure, Efficient, Distributed, and Useful Learning-based blockchain system. Specifically, we encode the template block into the training process and design a useful function that is difficult to solve but relatively easy to verify, as a substitute for the PoW puzzle. We show that our framework is distributed, secure, and efficiently trains ML models. We further demonstrate that the proposed PoL framework can be extended to other types of useful work and design an incentive mechanism to incentivize task verification. We show theoretically that a rational miner is incentivized to train fully honestly with well-designed system parameters. Finally, we present simulation results to demonstrate the performance of our framework and validate our analysis.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CR",
        "cs.DC",
        "cs.IT",
        "cs.LG"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13666v1",
        "pdf": "https://arxiv.org/pdf/2512.13666v1"
      },
      "arxiv_id": "2512.13666v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13665v1",
      "title": "Grab-3D: Detecting AI-Generated Videos from 3D Geometric Temporal Consistency",
      "authors": [
        "Wenhan Chen",
        "Sezer Karaoglu",
        "Theo Gevers"
      ],
      "abstract": "Recent advances in diffusion-based generation techniques enable AI models to produce highly realistic videos, heightening the need for reliable detection mechanisms. However, existing detection methods provide only limited exploration of the 3D geometric patterns present in generated videos. In this paper, we use vanishing points as an explicit representation of 3D geometry patterns, revealing fundamental discrepancies in geometric consistency between real and AI-generated videos. We introduce Grab-3D, a geometry-aware transformer framework for detecting AI-generated videos based on 3D geometric temporal consistency. To enable reliable evaluation, we construct an AI-generated video dataset of static scenes, allowing stable 3D geometric feature extraction. We propose a geometry-aware transformer equipped with geometric positional encoding, temporal-geometric attention, and an EMA-based geometric classifier head to explicitly inject 3D geometric awareness into temporal modeling. Experiments demonstrate that Grab-3D significantly outperforms state-of-the-art detectors, achieving robust cross-domain generalization to unseen generators.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13665v1",
        "pdf": "https://arxiv.org/pdf/2512.13665v1"
      },
      "arxiv_id": "2512.13665v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13660v1",
      "title": "RoboTracer: Mastering Spatial Trace with Reasoning in Vision-Language Models for Robotics",
      "authors": [
        "Enshen Zhou",
        "Cheng Chi",
        "Yibo Li",
        "Jingkun An",
        "Jiayuan Zhang",
        "Shanyu Rong",
        "Yi Han",
        "Yuheng Ji",
        "Mengzhen Liu",
        "Pengwei Wang",
        "Zhongyuan Wang",
        "Lu Sheng",
        "Shanghang Zhang"
      ],
      "abstract": "Spatial tracing, as a fundamental embodied interaction ability for robots, is inherently challenging as it requires multi-step metric-grounded reasoning compounded with complex spatial referring and real-world metric measurement. However, existing methods struggle with this compositional task. To this end, we propose RoboTracer, a 3D-aware VLM that first achieves both 3D spatial referring and measuring via a universal spatial encoder and a regression-supervised decoder to enhance scale awareness during supervised fine-tuning (SFT). Moreover, RoboTracer advances multi-step metric-grounded reasoning via reinforcement fine-tuning (RFT) with metric-sensitive process rewards, supervising key intermediate perceptual cues to accurately generate spatial traces. To support SFT and RFT training, we introduce TraceSpatial, a large-scale dataset of 30M QA pairs, spanning outdoor/indoor/tabletop scenes and supporting complex reasoning processes (up to 9 steps). We further present TraceSpatial-Bench, a challenging benchmark filling the gap to evaluate spatial tracing. Experimental results show that RoboTracer surpasses baselines in spatial understanding, measuring, and referring, with an average success rate of 79.1%, and also achieves SOTA performance on TraceSpatial-Bench by a large margin, exceeding Gemini-2.5-Pro by 36% accuracy. Notably, RoboTracer can be integrated with various control policies to execute long-horizon, dynamic tasks across diverse robots (UR5, G1 humanoid) in cluttered real-world scenes.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.RO",
        "cs.CV"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13660v1",
        "pdf": "https://arxiv.org/pdf/2512.13660v1"
      },
      "arxiv_id": "2512.13660v1",
      "comment": "Project page: https://zhoues.github.io/RoboTracer",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13658v1",
      "title": "Embedding-Based Rankings of Educational Resources based on Learning Outcome Alignment: Benchmarking, Expert Validation, and Learner Performance",
      "authors": [
        "Mohammadreza Molavi",
        "Mohammad Moein",
        "Mohammadreza Tavakoli",
        "Abdolali Faraji",
        "Stefan T. Mol",
        "Gábor Kismihók"
      ],
      "abstract": "As the online learning landscape evolves, the need for personalization is increasingly evident. Although educational resources are burgeoning, educators face challenges selecting materials that both align with intended learning outcomes and address diverse learner needs. Large Language Models (LLMs) are attracting growing interest for their potential to create learning resources that better support personalization, but verifying coverage of intended outcomes still requires human alignment review, which is costly and limits scalability. We propose a framework that supports the cost-effective automation of evaluating alignment between educational resources and intended learning outcomes. Using human-generated materials, we benchmarked LLM-based text-embedding models and found that the most accurate model (Voyage) achieved 79% accuracy in detecting alignment. We then applied the optimal model to LLM-generated resources and, via expert evaluation, confirmed that it reliably assessed correspondence to intended outcomes (83% accuracy). Finally, in a three-group experiment with 360 learners, higher alignment scores were positively related to greater learning performance, chi-squared(2, N = 360) = 15.39, p < 0.001. These findings show that embedding-based alignment scores can facilitate scalable personalization by confirming alignment with learning outcomes, which allows teachers to focus on tailoring content to diverse learner needs.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CY",
        "cs.AI"
      ],
      "primary_category": "cs.CY",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13658v1",
        "pdf": "https://arxiv.org/pdf/2512.13658v1"
      },
      "arxiv_id": "2512.13658v1",
      "comment": "Accepted for publication at the 16th International Conference on Learning Analytics & Knowledge (LAK 2026)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13654v1",
      "title": "Large-Language Memorization During the Classification of United States Supreme Court Cases",
      "authors": [
        "John E. Ortega",
        "Dhruv D. Joshi",
        "Matt P. Borkowski"
      ],
      "abstract": "Large-language models (LLMs) have been shown to respond in a variety of ways for classification tasks outside of question-answering. LLM responses are sometimes called \"hallucinations\" since the output is not what is ex pected. Memorization strategies in LLMs are being studied in detail, with the goal of understanding how LLMs respond. We perform a deep dive into a classification task based on United States Supreme Court (SCOTUS) decisions. The SCOTUS corpus is an ideal classification task to study for LLM memory accuracy because it presents significant challenges due to extensive sentence length, complex legal terminology, non-standard structure, and domain-specific vocabulary. Experimentation is performed with the latest LLM fine tuning and retrieval-based approaches, such as parameter-efficient fine-tuning, auto-modeling, and others, on two traditional category-based SCOTUS classification tasks: one with 15 labeled topics and another with 279. We show that prompt-based models with memories, such as DeepSeek, can be more robust than previous BERT-based models on both tasks scoring about 2 points better than previous models not based on prompting.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.ET",
        "cs.IR"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13654v1",
        "pdf": "https://arxiv.org/pdf/2512.13654v1"
      },
      "arxiv_id": "2512.13654v1",
      "comment": "7 pages, 1 figure, Appendix of Prompts",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13644v1",
      "title": "World Models Can Leverage Human Videos for Dexterous Manipulation",
      "authors": [
        "Raktim Gautam Goswami",
        "Amir Bar",
        "David Fan",
        "Tsung-Yen Yang",
        "Gaoyue Zhou",
        "Prashanth Krishnamurthy",
        "Michael Rabbat",
        "Farshad Khorrami",
        "Yann LeCun"
      ],
      "abstract": "Dexterous manipulation is challenging because it requires understanding how subtle hand motion influences the environment through contact with objects. We introduce DexWM, a Dexterous Manipulation World Model that predicts the next latent state of the environment conditioned on past states and dexterous actions. To overcome the scarcity of dexterous manipulation datasets, DexWM is trained on over 900 hours of human and non-dexterous robot videos. To enable fine-grained dexterity, we find that predicting visual features alone is insufficient; therefore, we introduce an auxiliary hand consistency loss that enforces accurate hand configurations. DexWM outperforms prior world models conditioned on text, navigation, and full-body actions, achieving more accurate predictions of future states. DexWM also demonstrates strong zero-shot generalization to unseen manipulation skills when deployed on a Franka Panda arm equipped with an Allegro gripper, outperforming Diffusion Policy by over 50% on average in grasping, placing, and reaching tasks.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.CV"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13644v1",
        "pdf": "https://arxiv.org/pdf/2512.13644v1"
      },
      "arxiv_id": "2512.13644v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13641v1",
      "title": "From Code to Field: Evaluating the Robustness of Convolutional Neural Networks for Disease Diagnosis in Mango Leaves",
      "authors": [
        "Gabriel Vitorino de Andrade",
        "Saulo Roberto dos Santos",
        "Itallo Patrick Castro Alves da Silva",
        "Emanuel Adler Medeiros Pereira",
        "Erick de Andrade Barboza"
      ],
      "abstract": "The validation and verification of artificial intelligence (AI) models through robustness assessment are essential to guarantee the reliable performance of intelligent systems facing real-world challenges, such as image corruptions including noise, blurring, and weather variations. Despite the global importance of mango (Mangifera indica L.), there is a lack of studies on the robustness of models for the diagnosis of disease in its leaves. This paper proposes a methodology to evaluate convolutional neural networks (CNNs) under adverse conditions. We adapted the MangoLeafDB dataset, generating MangoLeafDB-C with 19 types of artificial corruptions at five severity levels. We conducted a benchmark comparing five architectures: ResNet-50, ResNet-101, VGG-16, Xception, and LCNN (the latter being a lightweight architecture designed specifically for mango leaf diagnosis). The metrics include the F1 score, the corruption error (CE) and the relative mean corruption error (relative mCE). The results show that LCNN outperformed complex models in corruptions that can be present in real-world scenarios such as Defocus Blur, Motion Blur, while also achieving the lowest mCE. Modern architectures (e.g., ResNet-101) exhibited significant performance degradation in corrupted scenarios, despite their high accuracy under ideal conditions. These findings suggest that lightweight and specialized models may be more suitable for real-world applications in edge devices, where robustness and efficiency are critical. The study highlights the need to incorporate robustness assessments in the development of intelligent systems for agriculture, particularly in regions with technological limitations.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13641v1",
        "pdf": "https://arxiv.org/pdf/2512.13641v1"
      },
      "arxiv_id": "2512.13641v1",
      "comment": "This work was presented at the BRACIS 2025 conference in Fortaleza",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13639v1",
      "title": "Charge: A Comprehensive Novel View Synthesis Benchmark and Dataset to Bind Them All",
      "authors": [
        "Michal Nazarczuk",
        "Thomas Tanay",
        "Arthur Moreau",
        "Zhensong Zhang",
        "Eduardo Pérez-Pellitero"
      ],
      "abstract": "This paper presents a new dataset for Novel View Synthesis, generated from a high-quality, animated film with stunning realism and intricate detail. Our dataset captures a variety of dynamic scenes, complete with detailed textures, lighting, and motion, making it ideal for training and evaluating cutting-edge 4D scene reconstruction and novel view generation models. In addition to high-fidelity RGB images, we provide multiple complementary modalities, including depth, surface normals, object segmentation and optical flow, enabling a deeper understanding of scene geometry and motion. The dataset is organised into three distinct benchmarking scenarios: a dense multi-view camera setup, a sparse camera arrangement, and monocular video sequences, enabling a wide range of experimentation and comparison across varying levels of data sparsity. With its combination of visual richness, high-quality annotations, and diverse experimental setups, this dataset offers a unique resource for pushing the boundaries of view synthesis and 3D vision.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13639v1",
        "pdf": "https://arxiv.org/pdf/2512.13639v1"
      },
      "arxiv_id": "2512.13639v1",
      "comment": "Project page: https://charge-benchmark.github.io/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13636v1",
      "title": "MindDrive: A Vision-Language-Action Model for Autonomous Driving via Online Reinforcement Learning",
      "authors": [
        "Haoyu Fu",
        "Diankun Zhang",
        "Zongchuang Zhao",
        "Jianfeng Cui",
        "Hongwei Xie",
        "Bing Wang",
        "Guang Chen",
        "Dingkang Liang",
        "Xiang Bai"
      ],
      "abstract": "Current Vision-Language-Action (VLA) paradigms in autonomous driving primarily rely on Imitation Learning (IL), which introduces inherent challenges such as distribution shift and causal confusion. Online Reinforcement Learning offers a promising pathway to address these issues through trial-and-error learning. However, applying online reinforcement learning to VLA models in autonomous driving is hindered by inefficient exploration in continuous action spaces. To overcome this limitation, we propose MindDrive, a VLA framework comprising a large language model (LLM) with two distinct sets of LoRA parameters. The one LLM serves as a Decision Expert for scenario reasoning and driving decision-making, while the other acts as an Action Expert that dynamically maps linguistic decisions into feasible trajectories. By feeding trajectory-level rewards back into the reasoning space, MindDrive enables trial-and-error learning over a finite set of discrete linguistic driving decisions, instead of operating directly in a continuous action space. This approach effectively balances optimal decision-making in complex scenarios, human-like driving behavior, and efficient exploration in online reinforcement learning. MindDrive achieves strong closed-loop performance on the challenging Bench2Drive benchmark, with a Driving Score (DS) of 78.04 and a Success Rate (SR) of 55.09%. To the best of our knowledge, this is the first work to demonstrate the effectiveness of online reinforcement learning for the VLA model in autonomous driving.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.RO"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13636v1",
        "pdf": "https://arxiv.org/pdf/2512.13636v1"
      },
      "arxiv_id": "2512.13636v1",
      "comment": "16 pages, 12 figures, 6 tables; Project Page: https://xiaomi-mlab.github.io/MindDrive/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13635v1",
      "title": "SCR2-ST: Combine Single Cell with Spatial Transcriptomics for Efficient Active Sampling via Reinforcement Learning",
      "authors": [
        "Junchao Zhu",
        "Ruining Deng",
        "Junlin Guo",
        "Tianyuan Yao",
        "Chongyu Qu",
        "Juming Xiong",
        "Siqi Lu",
        "Zhengyi Lu",
        "Yanfan Zhu",
        "Marilyn Lionts",
        "Yuechen Yang",
        "Yalin Zheng",
        "Yu Wang",
        "Shilin Zhao",
        "Haichun Yang",
        "Yuankai Huo"
      ],
      "abstract": "Spatial transcriptomics (ST) is an emerging technology that enables researchers to investigate the molecular relationships underlying tissue morphology. However, acquiring ST data remains prohibitively expensive, and traditional fixed-grid sampling strategies lead to redundant measurements of morphologically similar or biologically uninformative regions, thus resulting in scarce data that constrain current methods. The well-established single-cell sequencing field, however, could provide rich biological data as an effective auxiliary source to mitigate this limitation. To bridge these gaps, we introduce SCR2-ST, a unified framework that leverages single-cell prior knowledge to guide efficient data acquisition and accurate expression prediction. SCR2-ST integrates a single-cell guided reinforcement learning-based (SCRL) active sampling and a hybrid regression-retrieval prediction network SCR2Net. SCRL combines single-cell foundation model embeddings with spatial density information to construct biologically grounded reward signals, enabling selective acquisition of informative tissue regions under constrained sequencing budgets. SCR2Net then leverages the actively sampled data through a hybrid architecture combining regression-based modeling with retrieval-augmented inference, where a majority cell-type filtering mechanism suppresses noisy matches and retrieved expression profiles serve as soft labels for auxiliary supervision. We evaluated SCR2-ST on three public ST datasets, demonstrating SOTA performance in both sampling efficiency and prediction accuracy, particularly under low-budget scenarios. Code is publicly available at: https://github.com/hrlblab/SCR2ST",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13635v1",
        "pdf": "https://arxiv.org/pdf/2512.13635v1"
      },
      "arxiv_id": "2512.13635v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13634v1",
      "title": "Universality of high-dimensional scaling limits of stochastic gradient descent",
      "authors": [
        "Reza Gheissari",
        "Aukosh Jagannath"
      ],
      "abstract": "We consider statistical tasks in high dimensions whose loss depends on the data only through its projection into a fixed-dimensional subspace spanned by the parameter vectors and certain ground truth vectors. This includes classifying mixture distributions with cross-entropy loss with one and two-layer networks, and learning single and multi-index models with one and two-layer networks. When the data is drawn from an isotropic Gaussian mixture distribution, it is known that the evolution of a finite family of summary statistics under stochastic gradient descent converges to an autonomous ordinary differential equation (ODE), as the dimension and sample size go to $\\infty$ and the step size goes to $0$ commensurately. Our main result is that these ODE limits are universal in that this convergence occurs even when the data is drawn from mixtures of product measures provided the first two moments match the corresponding Gaussian distribution and the initialization and ground truth vectors are sufficiently coordinate-delocalized. We complement this by proving two corresponding non-universality results. We provide a simple example where the ODE limits are non-universal if the initialization is coordinate aligned. We also show that the stochastic differential equation limits arising as fluctuations of the summary statistics around their ODE's fixed points are not universal.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "stat.ML",
        "cs.LG",
        "math.PR",
        "math.ST"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13634v1",
        "pdf": "https://arxiv.org/pdf/2512.13634v1"
      },
      "arxiv_id": "2512.13634v1",
      "comment": "30 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13632v1",
      "title": "StutterFuse: Mitigating Modality Collapse in Stuttering Detection with Jaccard-Weighted Metric Learning and Gated Fusion",
      "authors": [
        "Guransh Singh",
        "Md Shah Fahad"
      ],
      "abstract": "Stuttering detection breaks down when disfluencies overlap. Existing parametric models struggle to distinguish complex, simultaneous disfluencies (e.g., a 'block' with a 'prolongation') due to the scarcity of these specific combinations in training data. While Retrieval-Augmented Generation (RAG) has revolutionized NLP by grounding models in external knowledge, this paradigm remains unexplored in pathological speech processing. To bridge this gap, we introduce StutterFuse, the first Retrieval-Augmented Classifier (RAC) for multi-label stuttering detection. By conditioning a Conformer encoder on a non-parametric memory bank of clinical examples, we allow the model to classify by reference rather than memorization. We further identify and solve \"Modality Collapse\", an \"Echo Chamber\" effect where naive retrieval boosts recall but degrades precision. We mitigate this using: (1) SetCon, a Jaccard-Weighted Metric Learning objective that optimizes for multi-label set similarity, and (2) a Gated Mixture-of-Experts fusion strategy that dynamically arbitrates between acoustic evidence and retrieved context. On the SEP-28k dataset, StutterFuse achieves a weighted F1-score of 0.65, outperforming strong baselines and demonstrating remarkable zero-shot cross-lingual generalization.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13632v1",
        "pdf": "https://arxiv.org/pdf/2512.13632v1"
      },
      "arxiv_id": "2512.13632v1",
      "comment": "13 pages, 10 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13618v1",
      "title": "Temporal Tokenization Strategies for Event Sequence Modeling with Large Language Models",
      "authors": [
        "Zefang Liu",
        "Nam Nguyen",
        "Yinzhu Quan",
        "Austin Zhang"
      ],
      "abstract": "Representing continuous time is a critical and under-explored challenge in modeling temporal event sequences with large language models (LLMs). Various strategies like byte-level representations or calendar tokens have been proposed. However, the optimal approach remains unclear, especially given the diverse statistical distributions of real-world event data, which range from smooth log-normal to discrete, spiky patterns. This paper presents the first empirical study of temporal tokenization for event sequences, comparing distinct encoding strategies: naive numeric strings, high-precision byte-level representations, human-semantic calendar tokens, classic uniform binning, and adaptive residual scalar quantization. We evaluate these strategies by fine-tuning LLMs on real-world datasets that exemplify these diverse distributions. Our analysis reveals that no single strategy is universally superior; instead, prediction performance depends heavily on aligning the tokenizer with the data's statistical properties, with log-based strategies excelling on skewed distributions and human-centric formats proving robust for mixed modalities.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13618v1",
        "pdf": "https://arxiv.org/pdf/2512.13618v1"
      },
      "arxiv_id": "2512.13618v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13617v1",
      "title": "LightTopoGAT: Enhancing Graph Attention Networks with Topological Features for Efficient Graph Classification",
      "authors": [
        "Ankit Sharma",
        "Sayan Roy Gupta"
      ],
      "abstract": "Graph Neural Networks have demonstrated significant success in graph classification tasks, yet they often require substantial computational resources and struggle to capture global graph properties effectively. We introduce LightTopoGAT, a lightweight graph attention network that enhances node features through topological augmentation by incorporating node degree and local clustering coefficient to improve graph representation learning. The proposed approach maintains parameter efficiency through streamlined attention mechanisms while integrating structural information that is typically overlooked by local message passing schemes. Through comprehensive experiments on three benchmark datasets, MUTAG, ENZYMES, and PROTEINS, we show that LightTopoGAT achieves superior performance compared to established baselines including GCN, GraphSAGE, and standard GAT, with a 6.6 percent improvement in accuracy on MUTAG and a 2.2 percent improvement on PROTEINS. Ablation studies further confirm that these performance gains arise directly from the inclusion of topological features, demonstrating a simple yet effective strategy for enhancing graph neural network performance without increasing architectural complexity.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13617v1",
        "pdf": "https://arxiv.org/pdf/2512.13617v1"
      },
      "arxiv_id": "2512.13617v1",
      "comment": "9 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13609v1",
      "title": "Do-Undo: Generating and Reversing Physical Actions in Vision-Language Models",
      "authors": [
        "Shweta Mahajan",
        "Shreya Kadambi",
        "Hoang Le",
        "Munawar Hayat",
        "Fatih Porikli"
      ],
      "abstract": "We introduce the Do-Undo task and benchmark to address a critical gap in vision-language models: understanding and generating physically plausible scene transformations driven by real-world actions. Unlike prior work focused on object-level edits, Do-Undo requires models to simulate the outcome of a physical action and then accurately reverse it, reflecting true cause-and-effect in the visual world. We curate a large-scale dataset of reversible actions from real-world videos and design a training strategy enforcing consistency for robust action grounding. Our experiments reveal that current models struggle with physical reversibility, underscoring the importance of this task for embodied AI, robotics, and physics-aware generative modeling. Do-Undo establishes an intuitive testbed for evaluating and advancing physical reasoning in multimodal systems.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13609v1",
        "pdf": "https://arxiv.org/pdf/2512.13609v1"
      },
      "arxiv_id": "2512.13609v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13608v1",
      "title": "DBT-DINO: Towards Foundation model based analysis of Digital Breast Tomosynthesis",
      "authors": [
        "Felix J. Dorfner",
        "Manon A. Dorster",
        "Ryan Connolly",
        "Oscar Gentilhomme",
        "Edward Gibbs",
        "Steven Graham",
        "Seth Wander",
        "Thomas Schultz",
        "Manisha Bahl",
        "Dania Daye",
        "Albert E. Kim",
        "Christopher P. Bridge"
      ],
      "abstract": "Foundation models have shown promise in medical imaging but remain underexplored for three-dimensional imaging modalities. No foundation model currently exists for Digital Breast Tomosynthesis (DBT), despite its use for breast cancer screening.\n  To develop and evaluate a foundation model for DBT (DBT-DINO) across multiple clinical tasks and assess the impact of domain-specific pre-training.\n  Self-supervised pre-training was performed using the DINOv2 methodology on over 25 million 2D slices from 487,975 DBT volumes from 27,990 patients. Three downstream tasks were evaluated: (1) breast density classification using 5,000 screening exams; (2) 5-year risk of developing breast cancer using 106,417 screening exams; and (3) lesion detection using 393 annotated volumes.\n  For breast density classification, DBT-DINO achieved an accuracy of 0.79 (95\\% CI: 0.76--0.81), outperforming both the MetaAI DINOv2 baseline (0.73, 95\\% CI: 0.70--0.76, p<.001) and DenseNet-121 (0.74, 95\\% CI: 0.71--0.76, p<.001). For 5-year breast cancer risk prediction, DBT-DINO achieved an AUROC of 0.78 (95\\% CI: 0.76--0.80) compared to DINOv2's 0.76 (95\\% CI: 0.74--0.78, p=.57). For lesion detection, DINOv2 achieved a higher average sensitivity of 0.67 (95\\% CI: 0.60--0.74) compared to DBT-DINO with 0.62 (95\\% CI: 0.53--0.71, p=.60). DBT-DINO demonstrated better performance on cancerous lesions specifically with a detection rate of 78.8\\% compared to Dinov2's 77.3\\%.\n  Using a dataset of unprecedented size, we developed DBT-DINO, the first foundation model for DBT. DBT-DINO demonstrated strong performance on breast density classification and cancer risk prediction. However, domain-specific pre-training showed variable benefits on the detection task, with ImageNet baseline outperforming DBT-DINO on general lesion detection, indicating that localized detection tasks require further methodological development.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13608v1",
        "pdf": "https://arxiv.org/pdf/2512.13608v1"
      },
      "arxiv_id": "2512.13608v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13607v1",
      "title": "Nemotron-Cascade: Scaling Cascaded Reinforcement Learning for General-Purpose Reasoning Models",
      "authors": [
        "Boxin Wang",
        "Chankyu Lee",
        "Nayeon Lee",
        "Sheng-Chieh Lin",
        "Wenliang Dai",
        "Yang Chen",
        "Yangyi Chen",
        "Zhuolin Yang",
        "Zihan Liu",
        "Mohammad Shoeybi",
        "Bryan Catanzaro",
        "Wei Ping"
      ],
      "abstract": "Building general-purpose reasoning models with reinforcement learning (RL) entails substantial cross-domain heterogeneity, including large variation in inference-time response lengths and verification latency. Such variability complicates the RL infrastructure, slows training, and makes training curriculum (e.g., response length extension) and hyperparameter selection challenging. In this work, we propose cascaded domain-wise reinforcement learning (Cascade RL) to develop general-purpose reasoning models, Nemotron-Cascade, capable of operating in both instruct and deep thinking modes. Departing from conventional approaches that blend heterogeneous prompts from different domains, Cascade RL orchestrates sequential, domain-wise RL, reducing engineering complexity and delivering state-of-the-art performance across a wide range of benchmarks. Notably, RLHF for alignment, when used as a pre-step, boosts the model's reasoning ability far beyond mere preference optimization, and subsequent domain-wise RLVR stages rarely degrade the benchmark performance attained in earlier domains and may even improve it (see an illustration in Figure 1). Our 14B model, after RL, outperforms its SFT teacher, DeepSeek-R1-0528, on LiveCodeBench v5/v6/Pro and achieves silver-medal performance in the 2025 International Olympiad in Informatics (IOI). We transparently share our training and data recipes.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13607v1",
        "pdf": "https://arxiv.org/pdf/2512.13607v1"
      },
      "arxiv_id": "2512.13607v1",
      "comment": "We publicly release the Nemotron-Cascade models and the full collection of training data at: https://huggingface.co/collections/nvidia/nemotron-cascade",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13604v1",
      "title": "LongVie 2: Multimodal Controllable Ultra-Long Video World Model",
      "authors": [
        "Jianxiong Gao",
        "Zhaoxi Chen",
        "Xian Liu",
        "Junhao Zhuang",
        "Chengming Xu",
        "Jianfeng Feng",
        "Yu Qiao",
        "Yanwei Fu",
        "Chenyang Si",
        "Ziwei Liu"
      ],
      "abstract": "Building video world models upon pretrained video generation systems represents an important yet challenging step toward general spatiotemporal intelligence. A world model should possess three essential properties: controllability, long-term visual quality, and temporal consistency. To this end, we take a progressive approach-first enhancing controllability and then extending toward long-term, high-quality generation. We present LongVie 2, an end-to-end autoregressive framework trained in three stages: (1) Multi-modal guidance, which integrates dense and sparse control signals to provide implicit world-level supervision and improve controllability; (2) Degradation-aware training on the input frame, bridging the gap between training and long-term inference to maintain high visual quality; and (3) History-context guidance, which aligns contextual information across adjacent clips to ensure temporal consistency. We further introduce LongVGenBench, a comprehensive benchmark comprising 100 high-resolution one-minute videos covering diverse real-world and synthetic environments. Extensive experiments demonstrate that LongVie 2 achieves state-of-the-art performance in long-range controllability, temporal coherence, and visual fidelity, and supports continuous video generation lasting up to five minutes, marking a significant step toward unified video world modeling.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13604v1",
        "pdf": "https://arxiv.org/pdf/2512.13604v1"
      },
      "arxiv_id": "2512.13604v1",
      "comment": "Project Page: https://vchitect.github.io/LongVie2-project/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13600v1",
      "title": "DA-SSL: self-supervised domain adaptor to leverage foundational models in turbt histopathology slides",
      "authors": [
        "Haoyue Zhang",
        "Meera Chappidi",
        "Erolcan Sayar",
        "Helen Richards",
        "Zhijun Chen",
        "Lucas Liu",
        "Roxanne Wadia",
        "Peter A Humphrey",
        "Fady Ghali",
        "Alberto Contreras-Sanz",
        "Peter Black",
        "Jonathan Wright",
        "Stephanie Harmon",
        "Michael Haffner"
      ],
      "abstract": "Recent deep learning frameworks in histopathology, particularly multiple instance learning (MIL) combined with pathology foundational models (PFMs), have shown strong performance. However, PFMs exhibit limitations on certain cancer or specimen types due to domain shifts - these cancer types were rarely used for pretraining or specimens contain tissue-based artifacts rarely seen within the pretraining population. Such is the case for transurethral resection of bladder tumor (TURBT), which are essential for diagnosing muscle-invasive bladder cancer (MIBC), but contain fragmented tissue chips and electrocautery artifacts and were not widely used in publicly available PFMs. To address this, we propose a simple yet effective domain-adaptive self-supervised adaptor (DA-SSL) that realigns pretrained PFM features to the TURBT domain without fine-tuning the foundational model itself. We pilot this framework for predicting treatment response in TURBT, where histomorphological features are currently underutilized and identifying patients who will benefit from neoadjuvant chemotherapy (NAC) is challenging. In our multi-center study, DA-SSL achieved an AUC of 0.77+/-0.04 in five-fold cross-validation and an external test accuracy of 0.84, sensitivity of 0.71, and specificity of 0.91 using majority voting. Our results demonstrate that lightweight domain adaptation with self-supervision can effectively enhance PFM-based MIL pipelines for clinically challenging histopathology tasks. Code is Available at https://github.com/zhanghaoyue/DA_SSL_TURBT.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13600v1",
        "pdf": "https://arxiv.org/pdf/2512.13600v1"
      },
      "arxiv_id": "2512.13600v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13598v1",
      "title": "Textual Gradients are a Flawed Metaphor for Automatic Prompt Optimization",
      "authors": [
        "Daniel Melcer",
        "Qi Chen",
        "Wen-Hao Chiang",
        "Shweta Garg",
        "Pranav Garg",
        "Christian Bock"
      ],
      "abstract": "A well-engineered prompt can increase the performance of large language models; automatic prompt optimization techniques aim to increase performance without requiring human effort to tune the prompts. One leading class of prompt optimization techniques introduces the analogy of textual gradients. We investigate the behavior of these textual gradient methods through a series of experiments and case studies. While such methods often result in a performance improvement, our experiments suggest that the gradient analogy does not accurately explain their behavior. Our insights may inform the selection of prompt optimization strategies, and development of new approaches.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13598v1",
        "pdf": "https://arxiv.org/pdf/2512.13598v1"
      },
      "arxiv_id": "2512.13598v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13597v1",
      "title": "Lighting in Motion: Spatiotemporal HDR Lighting Estimation",
      "authors": [
        "Christophe Bolduc",
        "Julien Philip",
        "Li Ma",
        "Mingming He",
        "Paul Debevec",
        "Jean-François Lalonde"
      ],
      "abstract": "We present Lighting in Motion (LiMo), a diffusion-based approach to spatiotemporal lighting estimation. LiMo targets both realistic high-frequency detail prediction and accurate illuminance estimation. To account for both, we propose generating a set of mirrored and diffuse spheres at different exposures, based on their 3D positions in the input. Making use of diffusion priors, we fine-tune powerful existing diffusion models on a large-scale customized dataset of indoor and outdoor scenes, paired with spatiotemporal light probes. For accurate spatial conditioning, we demonstrate that depth alone is insufficient and we introduce a new geometric condition to provide the relative position of the scene to the target 3D position. Finally, we combine diffuse and mirror predictions at different exposures into a single HDRI map leveraging differentiable rendering. We thoroughly evaluate our method and design choices to establish LiMo as state-of-the-art for both spatial control and prediction accuracy.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13597v1",
        "pdf": "https://arxiv.org/pdf/2512.13597v1"
      },
      "arxiv_id": "2512.13597v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13593v1",
      "title": "Scalable Formal Verification via Autoencoder Latent Space Abstraction",
      "authors": [
        "Robert Reed",
        "Morteza Lahijanian",
        "Luca Laurenti"
      ],
      "abstract": "Finite Abstraction methods provide a powerful formal framework for proving that systems satisfy their specifications. However, these techniques face scalability challenges for high-dimensional systems, as they rely on state-space discretization which grows exponentially with dimension. Learning-based approaches to dimensionality reduction, utilizing neural networks and autoencoders, have shown great potential to alleviate this problem. However, ensuring the correctness of the resulting verification results remains an open question. In this work, we provide a formal approach to reduce the dimensionality of systems via convex autoencoders and learn the dynamics in the latent space through a kernel-based method. We then construct a finite abstraction from the learned model in the latent space and guarantee that the abstraction contains the true behaviors of the original system. We show that the verification results in the latent space can be mapped back to the original system. Finally, we demonstrate the effectiveness of our approach on multiple systems, including a 26D system controlled by a neural network, showing significant scalability improvements without loss of rigor.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13593v1",
        "pdf": "https://arxiv.org/pdf/2512.13593v1"
      },
      "arxiv_id": "2512.13593v1",
      "comment": "14 pages, 7 figures, under review",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13592v1",
      "title": "Image Diffusion Preview with Consistency Solver",
      "authors": [
        "Fu-Yun Wang",
        "Hao Zhou",
        "Liangzhe Yuan",
        "Sanghyun Woo",
        "Boqing Gong",
        "Bohyung Han",
        "Ming-Hsuan Yang",
        "Han Zhang",
        "Yukun Zhu",
        "Ting Liu",
        "Long Zhao"
      ],
      "abstract": "The slow inference process of image diffusion models significantly degrades interactive user experiences. To address this, we introduce Diffusion Preview, a novel paradigm employing rapid, low-step sampling to generate preliminary outputs for user evaluation, deferring full-step refinement until the preview is deemed satisfactory. Existing acceleration methods, including training-free solvers and post-training distillation, struggle to deliver high-quality previews or ensure consistency between previews and final outputs. We propose ConsistencySolver derived from general linear multistep methods, a lightweight, trainable high-order solver optimized via Reinforcement Learning, that enhances preview quality and consistency. Experimental results demonstrate that ConsistencySolver significantly improves generation quality and consistency in low-step scenarios, making it ideal for efficient preview-and-refine workflows. Notably, it achieves FID scores on-par with Multistep DPM-Solver using 47% fewer steps, while outperforming distillation baselines. Furthermore, user studies indicate our approach reduces overall user interaction time by nearly 50% while maintaining generation quality. Code is available at https://github.com/G-U-N/consolver.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.CV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13592v1",
        "pdf": "https://arxiv.org/pdf/2512.13592v1"
      },
      "arxiv_id": "2512.13592v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13586v1",
      "title": "ReFusion: A Diffusion Large Language Model with Parallel Autoregressive Decoding",
      "authors": [
        "Jia-Nan Li",
        "Jian Guan",
        "Wei Wu",
        "Chongxuan Li"
      ],
      "abstract": "Autoregressive models (ARMs) are hindered by slow sequential inference. While masked diffusion models (MDMs) offer a parallel alternative, they suffer from critical drawbacks: high computational overhead from precluding Key-Value (KV) caching, and incoherent generation arising from learning dependencies over an intractable space of token combinations. To address these limitations, we introduce ReFusion, a novel masked diffusion model that achieves superior performance and efficiency by elevating parallel decoding from the token level to a higher slot level, where each slot is a fixed-length, contiguous sub-sequence. This is achieved through an iterative ``plan-and-infill'' decoding process: a diffusion-based planning step first identifies a set of weakly dependent slots, and an autoregressive infilling step then decodes these selected slots in parallel. The slot-based design simultaneously unlocks full KV cache reuse with a unified causal framework and reduces the learning complexity from the token combination space to a manageable slot-level permutation space. Extensive experiments on seven diverse benchmarks show that ReFusion not only overwhelmingly surpasses prior MDMs with 34% performance gains and an over 18$\\times$ speedup on average, but also bridges the performance gap to strong ARMs while maintaining a 2.33$\\times$ average speedup.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13586v1",
        "pdf": "https://arxiv.org/pdf/2512.13586v1"
      },
      "arxiv_id": "2512.13586v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13583v1",
      "title": "DP-CSGP: Differentially Private Stochastic Gradient Push with Compressed Communication",
      "authors": [
        "Zehan Zhu",
        "Heng Zhao",
        "Yan Huang",
        "Joey Tianyi Zhou",
        "Shouling Ji",
        "Jinming Xu"
      ],
      "abstract": "In this paper, we propose a Differentially Private Stochastic Gradient Push with Compressed communication (termed DP-CSGP) for decentralized learning over directed graphs. Different from existing works, the proposed algorithm is designed to maintain high model utility while ensuring both rigorous differential privacy (DP) guarantees and efficient communication. For general non-convex and smooth objective functions, we show that the proposed algorithm achieves a tight utility bound of $\\mathcal{O}\\left( \\sqrt{d\\log \\left( \\frac{1}δ \\right)}/(\\sqrt{n}Jε) \\right)$ ($J$ and $d$ are the number of local samples and the dimension of decision variables, respectively) with $\\left(ε, δ\\right)$-DP guarantee for each node, matching that of decentralized counterparts with exact communication. Extensive experiments on benchmark tasks show that, under the same privacy budget, DP-CSGP achieves comparable model accuracy with significantly lower communication cost than existing decentralized counterparts with exact communication.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13583v1",
        "pdf": "https://arxiv.org/pdf/2512.13583v1"
      },
      "arxiv_id": "2512.13583v1",
      "comment": "13 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13573v1",
      "title": "MMhops-R1: Multimodal Multi-hop Reasoning",
      "authors": [
        "Tao Zhang",
        "Ziqi Zhang",
        "Zongyang Ma",
        "Yuxin Chen",
        "Bing Li",
        "Chunfeng Yuan",
        "Guangting Wang",
        "Fengyun Rao",
        "Ying Shan",
        "Weiming Hu"
      ],
      "abstract": "The ability to perform multi-modal multi-hop reasoning by iteratively integrating information across various modalities and external knowledge is critical for addressing complex real-world challenges. However, existing Multi-modal Large Language Models (MLLMs) are predominantly limited to single-step reasoning, as existing benchmarks lack the complexity needed to evaluate and drive multi-hop abilities. To bridge this gap, we introduce MMhops, a novel, large-scale benchmark designed to systematically evaluate and foster multi-modal multi-hop reasoning. MMhops dataset comprises two challenging task formats, Bridging and Comparison, which necessitate that models dynamically construct complex reasoning chains by integrating external knowledge. To tackle the challenges posed by MMhops, we propose MMhops-R1, a novel multi-modal Retrieval-Augmented Generation (mRAG) framework for dynamic reasoning. Our framework utilizes reinforcement learning to optimize the model for autonomously planning reasoning paths, formulating targeted queries, and synthesizing multi-level information. Comprehensive experiments demonstrate that MMhops-R1 significantly outperforms strong baselines on MMhops, highlighting that dynamic planning and multi-modal knowledge integration are crucial for complex reasoning. Moreover, MMhops-R1 demonstrates strong generalization to tasks requiring fixed-hop reasoning, underscoring the robustness of our dynamic planning approach. In conclusion, our work contributes a challenging new benchmark and a powerful baseline model, and we will release the associated code, data, and weights to catalyze future research in this critical area.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13573v1",
        "pdf": "https://arxiv.org/pdf/2512.13573v1"
      },
      "arxiv_id": "2512.13573v1",
      "comment": "Acceped by AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13568v1",
      "title": "Superposition as Lossy Compression: Measure with Sparse Autoencoders and Connect to Adversarial Vulnerability",
      "authors": [
        "Leonard Bereska",
        "Zoe Tzifa-Kratira",
        "Reza Samavi",
        "Efstratios Gavves"
      ],
      "abstract": "Neural networks achieve remarkable performance through superposition: encoding multiple features as overlapping directions in activation space rather than dedicating individual neurons to each feature. This challenges interpretability, yet we lack principled methods to measure superposition. We present an information-theoretic framework measuring a neural representation's effective degrees of freedom. We apply Shannon entropy to sparse autoencoder activations to compute the number of effective features as the minimum neurons needed for interference-free encoding. Equivalently, this measures how many \"virtual neurons\" the network simulates through superposition. When networks encode more effective features than actual neurons, they must accept interference as the price of compression. Our metric strongly correlates with ground truth in toy models, detects minimal superposition in algorithmic tasks, and reveals systematic reduction under dropout. Layer-wise patterns mirror intrinsic dimensionality studies on Pythia-70M. The metric also captures developmental dynamics, detecting sharp feature consolidation during grokking. Surprisingly, adversarial training can increase effective features while improving robustness, contradicting the hypothesis that superposition causes vulnerability. Instead, the effect depends on task complexity and network capacity: simple tasks with ample capacity allow feature expansion (abundance regime), while complex tasks or limited capacity force reduction (scarcity regime). By defining superposition as lossy compression, this work enables principled measurement of how neural networks organize information under computational constraints, connecting superposition to adversarial robustness.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13568v1",
        "pdf": "https://arxiv.org/pdf/2512.13568v1"
      },
      "arxiv_id": "2512.13568v1",
      "comment": "Accepted to TMLR, view HTML here: https://leonardbereska.github.io/blog/2025/superposition/",
      "journal_ref": "Transactions on Machine Learning Research, 2025",
      "has_code": true
    },
    {
      "id": "2512.13565v1",
      "title": "A Nonparametric Statistics Approach to Feature Selection in Deep Neural Networks with Theoretical Guarantees",
      "authors": [
        "Junye Du",
        "Zhenghao Li",
        "Zhutong Gu",
        "Long Feng"
      ],
      "abstract": "This paper tackles the problem of feature selection in a highly challenging setting: $\\mathbb{E}(y | \\boldsymbol{x}) = G(\\boldsymbol{x}_{\\mathcal{S}_0})$, where $\\mathcal{S}_0$ is the set of relevant features and $G$ is an unknown, potentially nonlinear function subject to mild smoothness conditions. Our approach begins with feature selection in deep neural networks, then generalizes the results to H{ö}lder smooth functions by exploiting the strong approximation capabilities of neural networks. Unlike conventional optimization-based deep learning methods, we reformulate neural networks as index models and estimate $\\mathcal{S}_0$ using the second-order Stein's formula. This gradient-descent-free strategy guarantees feature selection consistency with a sample size requirement of $n = Ω(p^2)$, where $p$ is the feature dimension. To handle high-dimensional scenarios, we further introduce a screening-and-selection mechanism that achieves nonlinear selection consistency when $n = Ω(s \\log p)$, with $s$ representing the sparsity level. Additionally, we refit a neural network on the selected features for prediction and establish performance guarantees under a relaxed sparsity assumption. Extensive simulations and real-data analyses demonstrate the strong performance of our method even in the presence of complex feature interactions.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "stat.ML",
        "cs.LG"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13565v1",
        "pdf": "https://arxiv.org/pdf/2512.13565v1"
      },
      "arxiv_id": "2512.13565v1",
      "comment": "64 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13564v1",
      "title": "Memory in the Age of AI Agents",
      "authors": [
        "Yuyang Hu",
        "Shichun Liu",
        "Yanwei Yue",
        "Guibin Zhang",
        "Boyang Liu",
        "Fangyi Zhu",
        "Jiahang Lin",
        "Honglin Guo",
        "Shihan Dou",
        "Zhiheng Xi",
        "Senjie Jin",
        "Jiejun Tan",
        "Yanbin Yin",
        "Jiongnan Liu",
        "Zeyu Zhang",
        "Zhongxiang Sun",
        "Yutao Zhu",
        "Hao Sun",
        "Boci Peng",
        "Zhenrong Cheng",
        "Xuanbo Fan",
        "Jiaxin Guo",
        "Xinlei Yu",
        "Zhenhong Zhou",
        "Zewen Hu",
        "Jiahao Huo",
        "Junhao Wang",
        "Yuwei Niu",
        "Yu Wang",
        "Zhenfei Yin",
        "Xiaobin Hu",
        "Yue Liao",
        "Qiankun Li",
        "Kun Wang",
        "Wangchunshu Zhou",
        "Yixin Liu",
        "Dawei Cheng",
        "Qi Zhang",
        "Tao Gui",
        "Shirui Pan",
        "Yan Zhang",
        "Philip Torr",
        "Zhicheng Dou",
        "Ji-Rong Wen",
        "Xuanjing Huang",
        "Yu-Gang Jiang",
        "Shuicheng Yan"
      ],
      "abstract": "Memory has emerged, and will continue to remain, a core capability of foundation model-based agents. As research on agent memory rapidly expands and attracts unprecedented attention, the field has also become increasingly fragmented. Existing works that fall under the umbrella of agent memory often differ substantially in their motivations, implementations, and evaluation protocols, while the proliferation of loosely defined memory terminologies has further obscured conceptual clarity. Traditional taxonomies such as long/short-term memory have proven insufficient to capture the diversity of contemporary agent memory systems. This work aims to provide an up-to-date landscape of current agent memory research. We begin by clearly delineating the scope of agent memory and distinguishing it from related concepts such as LLM memory, retrieval augmented generation (RAG), and context engineering. We then examine agent memory through the unified lenses of forms, functions, and dynamics. From the perspective of forms, we identify three dominant realizations of agent memory, namely token-level, parametric, and latent memory. From the perspective of functions, we propose a finer-grained taxonomy that distinguishes factual, experiential, and working memory. From the perspective of dynamics, we analyze how memory is formed, evolved, and retrieved over time. To support practical development, we compile a comprehensive summary of memory benchmarks and open-source frameworks. Beyond consolidation, we articulate a forward-looking perspective on emerging research frontiers, including memory automation, reinforcement learning integration, multimodal memory, multi-agent memory, and trustworthiness issues. We hope this survey serves not only as a reference for existing work, but also as a conceptual foundation for rethinking memory as a first-class primitive in the design of future agentic intelligence.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13564v1",
        "pdf": "https://arxiv.org/pdf/2512.13564v1"
      },
      "arxiv_id": "2512.13564v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13560v1",
      "title": "3D Human-Human Interaction Anomaly Detection",
      "authors": [
        "Shun Maeda",
        "Chunzhi Gu",
        "Koichiro Kamide",
        "Katsuya Hotta",
        "Shangce Gao",
        "Chao Zhang"
      ],
      "abstract": "Human-centric anomaly detection (AD) has been primarily studied to specify anomalous behaviors in a single person. However, as humans by nature tend to act in a collaborative manner, behavioral anomalies can also arise from human-human interactions. Detecting such anomalies using existing single-person AD models is prone to low accuracy, as these approaches are typically not designed to capture the complex and asymmetric dynamics of interactions. In this paper, we introduce a novel task, Human-Human Interaction Anomaly Detection (H2IAD), which aims to identify anomalous interactive behaviors within collaborative 3D human actions. To address H2IAD, we then propose Interaction Anomaly Detection Network (IADNet), which is formalized with a Temporal Attention Sharing Module (TASM). Specifically, in designing TASM, we share the encoded motion embeddings across both people such that collaborative motion correlations can be effectively synchronized. Moreover, we notice that in addition to temporal dynamics, human interactions are also characterized by spatial configurations between two people. We thus introduce a Distance-Based Relational Encoding Module (DREM) to better reflect social cues in H2IAD. The normalizing flow is eventually employed for anomaly scoring. Extensive experiments on human-human motion benchmarks demonstrate that IADNet outperforms existing Human-centric AD baselines in H2IAD.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13560v1",
        "pdf": "https://arxiv.org/pdf/2512.13560v1"
      },
      "arxiv_id": "2512.13560v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13559v1",
      "title": "Verifying Rumors via Stance-Aware Structural Modeling",
      "authors": [
        "Gibson Nkhata",
        "Uttamasha Anjally Oyshi",
        "Quan Mai",
        "Susan Gauch"
      ],
      "abstract": "Verifying rumors on social media is critical for mitigating the spread of false information. The stances of conversation replies often provide important cues to determine a rumor's veracity. However, existing models struggle to jointly capture semantic content, stance information, and conversation strructure, especially under the sequence length constraints of transformer-based encoders. In this work, we propose a stance-aware structural modeling that encodes each post in a discourse with its stance signal and aggregates reply embedddings by stance category enabling a scalable and semantically enriched representation of the entire thread. To enhance structural awareness, we introduce stance distribution and hierarchical depth as covariates, capturing stance imbalance and the influence of reply depth. Extensive experiments on benchmark datasets demonstrate that our approach significantly outperforms prior methods in the ability to predict truthfulness of a rumor. We also demonstrate that our model is versatile for early detection and cross-platfrom generalization.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CY"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13559v1",
        "pdf": "https://arxiv.org/pdf/2512.13559v1"
      },
      "arxiv_id": "2512.13559v1",
      "comment": "8 pages, 2 figures, published in The 24th IEEE/WIC International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT 2025), London, UK, 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13534v1",
      "title": "Pancakes: Consistent Multi-Protocol Image Segmentation Across Biomedical Domains",
      "authors": [
        "Marianne Rakic",
        "Siyu Gai",
        "Etienne Chollet",
        "John V. Guttag",
        "Adrian V. Dalca"
      ],
      "abstract": "A single biomedical image can be meaningfully segmented in multiple ways, depending on the desired application. For instance, a brain MRI can be segmented according to tissue types, vascular territories, broad anatomical regions, fine-grained anatomy, or pathology, etc. Existing automatic segmentation models typically either (1) support only a single protocol, the one they were trained on, or (2) require labor-intensive manual prompting to specify the desired segmentation. We introduce Pancakes, a framework that, given a new image from a previously unseen domain, automatically generates multi-label segmentation maps for multiple plausible protocols, while maintaining semantic consistency across related images. Pancakes introduces a new problem formulation that is not currently attainable by existing foundation models. In a series of experiments on seven held-out datasets, we demonstrate that our model can significantly outperform existing foundation models in producing several plausible whole-image segmentations, that are semantically coherent across images.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13534v1",
        "pdf": "https://arxiv.org/pdf/2512.13534v1"
      },
      "arxiv_id": "2512.13534v1",
      "comment": "Accepted at NeurIPS 2025. Code available at: https://github.com/mariannerakic/Pancakes",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13532v1",
      "title": "Adaptive Sampling for Hydrodynamic Stability",
      "authors": [
        "Anshima Singh",
        "David J. Silvester"
      ],
      "abstract": "An adaptive sampling approach for efficient detection of bifurcation boundaries in parametrized fluid flow problems is presented herein. The study extends the machine-learning approach of Silvester (Machine Learning for Hydrodynamic Stability, arXiv:2407.09572), where a classifier network was trained on preselected simulation data to identify bifurcated and nonbifurcated flow regimes. In contrast, the proposed methodology introduces adaptivity through a flow-based deep generative model that automatically refines the sampling of the parameter space. The strategy has two components: a classifier network maps the flow parameters to a bifurcation probability, and a probability density estimation technique (KRnet) for the generation of new samples at each adaptive step. The classifier output provides a probabilistic measure of flow stability, and the Shannon entropy of these predictions is employed as an uncertainty indicator. KRnet is trained to approximate a probability density function that concentrates sampling in regions of high entropy, thereby directing computational effort towards the evolving bifurcation boundary. This coupling between classification and generative modeling establishes a feedback-driven adaptive learning process analogous to error-indicator based refinement in contemporary partial differential equation solution strategies. Starting from a uniform parameter distribution, the new approach achieves accurate bifurcation boundary identification with significantly fewer Navier--Stokes simulations, providing a scalable foundation for high-dimensional stability analysis.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "physics.flu-dyn",
        "cs.LG"
      ],
      "primary_category": "physics.flu-dyn",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13532v1",
        "pdf": "https://arxiv.org/pdf/2512.13532v1"
      },
      "arxiv_id": "2512.13532v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13530v1",
      "title": "Actively Learning Joint Contours of Multiple Computer Experiments",
      "authors": [
        "Shih-Ni Prim",
        "Kevin R. Quinlan",
        "Paul Hawkins",
        "Jagadeesh Movva",
        "Annie S. Booth"
      ],
      "abstract": "Contour location$\\unicode{x2014}$the process of sequentially training a surrogate model to identify the design inputs that result in a pre-specified response value from a single computer experiment$\\unicode{x2014}$is a well-studied active learning problem. Here, we tackle a related but distinct problem: identifying the input configuration that returns pre-specified values of multiple independent computer experiments simultaneously. Motivated by computer experiments of the rotational torques acting upon a vehicle in flight, we aim to identify stable flight conditions which result in zero torque forces. We propose a \"joint contour location\" (jCL) scheme that strikes a strategic balance between exploring the multiple response surfaces while exploiting learning of the intersecting contours. We employ both shallow and deep Gaussian process surrogates, but our jCL procedure is applicable to any surrogate that can provide posterior predictive distributions. Our jCL designs significantly outperform existing (single response) CL strategies, enabling us to efficiently locate the joint contour of our motivating computer experiments.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "stat.ME",
        "cs.LG"
      ],
      "primary_category": "stat.ME",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13530v1",
        "pdf": "https://arxiv.org/pdf/2512.13530v1"
      },
      "arxiv_id": "2512.13530v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13529v1",
      "title": "Enhancing lithological interpretation from petrophysical well log of IODP expedition 390/393 using machine learning",
      "authors": [
        "Raj Sahu",
        "Saumen Maiti"
      ],
      "abstract": "Enhanced lithological interpretation from well logs plays a key role in geological resource exploration and mapping, as well as in geo-environmental modeling studies. Core and cutting information is useful for making sound interpretations of well logs; however, these are rarely collected at each depth due to high costs. Moreover, well log interpretation using traditional methods is constrained by poor borehole conditions. Traditional statistical methods are mostly linear, often failing to discriminate between lithology and rock facies, particularly when dealing with overlapping well log signals characterized by the structural and compositional variation of rock types. In this study, we develop multiple supervised and unsupervised machine learning algorithms to jointly analyze multivariate well log data from Integrated Ocean Drilling Program (IODP) expeditions 390 and 393 for enhanced lithological interpretations. Among the algorithms, Logistic Regression, Decision Trees, Gradient Boosting, Support Vector Machines (SVM), k-Nearest Neighbors (KNN), and Multi-Layer Perceptron (MLP) neural network models, the Decision Tree and Gradient Boosting models outperformed the others, achieving an accuracy of 0.9950 and an F1-score of 0.9951. While unsupervised machine learning (ML) provides the foundation for cluster information that inherently supports the classification algorithm, supervised ML is applied to devise a data-driven lithology clustering mechanism for IODP datasets. The joint ML-based method developed here has the potential to be further explored for analyzing other well log datasets from the world's oceans.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "physics.geo-ph",
        "cs.LG"
      ],
      "primary_category": "physics.geo-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13529v1",
        "pdf": "https://arxiv.org/pdf/2512.13529v1"
      },
      "arxiv_id": "2512.13529v1",
      "comment": "Accepted for presentation at the International Meeting for Applied Geoscience & Energy (IMAGE) 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13527v1",
      "title": "DarkSPARC: Dark-Blood Spectral Self-Calibrated Reconstruction of 3D Left Atrial LGE MRI for Post-Ablation Scar Imaging",
      "authors": [
        "Mohammed S. M. Elbaz"
      ],
      "abstract": "Purpose: To develop DarkSPARC, a retrospective, training-free, self-calibrated spectral reconstruction method that converts routine bright-blood 3D left atrial (LA) late gadolinium enhancement (LGE) MRI into a dark-blood image, and to quantify its impact on LA scar-pool CNR, SNR, effective CNR (eCNR), and scar quantification accuracy.\n  Methods: DarkSPARC embeds bright-blood LA LGE into a calibrator-conditioned (N+1)-dimensional spectral domain and reconstructs a dark-blood-like image using scan-specific spectral landmarks. A scan-specific 3D numerical phantom framework was built from LAScarQS post-ablation LGE by cloning remote myocardium into the LA wall and imposing controlled scar burden. Five baseline cases spanning the 5th-95th percentiles of native scar-pool CNR, each with multiple scar burdens and 10 CNR degradation levels, yielded 200 phantoms. For every phantom, LA scar-pool CNR, SNR, eCNR, and Scar% were measured on bright-blood and DarkSPARC images. In vivo performance was evaluated in 60 public post-ablation scans of atrial fibrillation patients.\n  Results: In scan-specific phantoms, DarkSPARC increased LA scar-pool CNR, SNR, and eCNR over bright-blood in all 200 experiments, with DarkSPARC/bright-blood ratios up to about 30-fold for CNR and about 6-fold for SNR in the lowest-CNR conditions. At 70% CNR degradation, bright-blood underestimated ground-truth LA Scar% by -37% to -54%, whereas DarkSPARC reduced bias to about -3% to -5%. In vivo, DarkSPARC similarly improved metrics: median scar-pool CNR, SNR, and eCNR increased from 20.0 to 135.9 (6.8x), 70.6 to 200.6 (2.8x), and 0.22 to 0.75 (3.4x), respectively (all p<0.001), and LA Scar% increased from 3.9% to 9.75%.\n  Conclusion: DarkSPARC is a self-calibrated, training-free reconstruction that yields dark-blood 3D LA LGE, boosting CNR/SNR/eCNR and stabilizing reliable scar quantification without extra scans.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "physics.med-ph",
        "eess.IV"
      ],
      "primary_category": "physics.med-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13527v1",
        "pdf": "https://arxiv.org/pdf/2512.13527v1"
      },
      "arxiv_id": "2512.13527v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13526v1",
      "title": "Async Control: Stress-testing Asynchronous Control Measures for LLM Agents",
      "authors": [
        "Asa Cooper Stickland",
        "Jan Michelfeit",
        "Arathi Mani",
        "Charlie Griffin",
        "Ollie Matthews",
        "Tomek Korbak",
        "Rogan Inglis",
        "Oliver Makins",
        "Alan Cooney"
      ],
      "abstract": "LLM-based software engineering agents are increasingly used in real-world development tasks, often with access to sensitive data or security-critical codebases. Such agents could intentionally sabotage these codebases if they were misaligned. We investigate asynchronous monitoring, in which a monitoring system reviews agent actions after the fact. Unlike synchronous monitoring, this approach does not impose runtime latency, while still attempting to disrupt attacks before irreversible harm occurs. We treat monitor development as an adversarial game between a blue team (who design monitors) and a red team (who create sabotaging agents). We attempt to set the game rules such that they upper bound the sabotage potential of an agent based on Claude 4.1 Opus. To ground this game in a realistic, high-stakes deployment scenario, we develop a suite of 5 diverse software engineering environments that simulate tasks that an agent might perform within an AI developer's internal infrastructure. Over the course of the game, we develop an ensemble monitor that achieves a 6% false negative rate at 1% false positive rate on a held out test environment. Then, we estimate risk of sabotage at deployment time by extrapolating from our monitor's false negative rate. We describe one simple model for this extrapolation, present a sensitivity analysis, and describe situations in which the model would be invalid. Code is available at: https://github.com/UKGovernmentBEIS/async-control.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13526v1",
        "pdf": "https://arxiv.org/pdf/2512.13526v1"
      },
      "arxiv_id": "2512.13526v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13517v1",
      "title": "A Deep Learning Model of Mental Rotation Informed by Interactive VR Experiments",
      "authors": [
        "Raymond Khazoum",
        "Daniela Fernandes",
        "Aleksandr Krylov",
        "Qin Li",
        "Stephane Deny"
      ],
      "abstract": "Mental rotation -- the ability to compare objects seen from different viewpoints -- is a fundamental example of mental simulation and spatial world modelling in humans. Here we propose a mechanistic model of human mental rotation, leveraging advances in deep, equivariant, and neuro-symbolic learning. Our model consists of three stacked components: (1) an equivariant neural encoder, taking images as input and producing 3D spatial representations of objects, (2) a neuro-symbolic object encoder, deriving symbolic descriptions of objects from these spatial representations, and (3) a neural decision agent, comparing these symbolic descriptions to prescribe rotation simulations in 3D latent space via a recurrent pathway. Our model design is guided by the abundant experimental literature on mental rotation, which we complemented with experiments in VR where participants could at times manipulate the objects to compare, providing us with additional insights into the cognitive process of mental rotation. Our model captures well the performance, response times and behavior of participants in our and others' experiments. The necessity of each model component is shown through systematic ablations. Our work adds to a recent collection of deep neural models of human spatial reasoning, further demonstrating the potency of integrating deep, equivariant, and symbolic representations to model the human mind.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "q-bio.NC",
        "cs.LG"
      ],
      "primary_category": "q-bio.NC",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13517v1",
        "pdf": "https://arxiv.org/pdf/2512.13517v1"
      },
      "arxiv_id": "2512.13517v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13511v1",
      "title": "TARA: Simple and Efficient Time Aware Retrieval Adaptation of MLLMs for Video Understanding",
      "authors": [
        "Piyush Bagad",
        "Andrew Zisserman"
      ],
      "abstract": "Our objective is to build a general time-aware video-text embedding model for retrieval. To that end, we propose a simple and efficient recipe, dubbed TARA (Time Aware Retrieval Adaptation), to adapt Multimodal LLMs (MLLMs) to a time-aware video-text embedding model without using any video data at all. For evaluating time-awareness in retrieval, we propose a new benchmark with temporally opposite (chiral) actions as hard negatives and curated splits for chiral and non-chiral actions. We show that TARA outperforms all existing video-text models on this chiral benchmark while also achieving strong results on standard benchmarks. Furthermore, we discover additional benefits of TARA beyond time-awareness: (i) TARA embeddings are negation-aware as shown in NegBench benchmark that evaluates negation in video retrieval, (ii) TARA achieves state of the art performance on verb and adverb understanding in videos. Overall, TARA yields a strong, versatile, time-aware video-text embedding model with state of the art zero-shot performance.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.IR"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13511v1",
        "pdf": "https://arxiv.org/pdf/2512.13511v1"
      },
      "arxiv_id": "2512.13511v1",
      "comment": "18 Pages. Project page at http://bpiyush.github.io/tara-website",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13510v1",
      "title": "MedCEG: Reinforcing Verifiable Medical Reasoning with Critical Evidence Graph",
      "authors": [
        "Linjie Mu",
        "Yannian Gu",
        "Zhongzhen Huang",
        "Yakun Zhu",
        "Shaoting Zhang",
        "Xiaofan Zhang"
      ],
      "abstract": "Large language models with reasoning capabilities have demonstrated impressive performance across a wide range of domains. In clinical applications, a transparent, step-by-step reasoning process provides physicians with strong evidence to support decision-making. While reinforcement learning has effectively enhanced reasoning performance in medical contexts, the clinical reliability of these reasoning processes remains limited because their accuracy and validity are often overlooked during training. To address this gap, we propose MedCEG, a framework that augments medical language models with clinically valid reasoning pathways by explicitly supervising the reasoning process through a Critical Evidence Graph (CEG). We curate a dataset of challenging clinical cases and algorithmically construct a CEG for each sample to represent a high-quality verifiable reasoning pathway. To guide the reasoning process, we introduce a Clinical Reasoning Procedure Reward, which evaluates Node Coverage, Structural Correctness, and Chain Completeness, thereby providing a holistic assessment of reasoning quality. Experimental results show that MedCEG surpasses existing methods in performance while producing clinically valid reasoning chains, representing a solid advancement in reliable medical AI reasoning. The code and models are available at https://github.com/LinjieMu/MedCEG.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13510v1",
        "pdf": "https://arxiv.org/pdf/2512.13510v1"
      },
      "arxiv_id": "2512.13510v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13507v1",
      "title": "Seedance 1.5 pro: A Native Audio-Visual Joint Generation Foundation Model",
      "authors": [
        "Siyan Chen",
        "Yanfei Chen",
        "Ying Chen",
        "Zhuo Chen",
        "Feng Cheng",
        "Xuyan Chi",
        "Jian Cong",
        "Qinpeng Cui",
        "Qide Dong",
        "Junliang Fan",
        "Jing Fang",
        "Zetao Fang",
        "Chengjian Feng",
        "Han Feng",
        "Mingyuan Gao",
        "Yu Gao",
        "Qiushan Guo",
        "Boyang Hao",
        "Qingkai Hao",
        "Bibo He",
        "Qian He",
        "Tuyen Hoang",
        "Ruoqing Hu",
        "Xi Hu",
        "Weilin Huang",
        "Zhaoyang Huang",
        "Zhongyi Huang",
        "Siqi Jiang",
        "Wei Jiang",
        "Yunpu Jiang",
        "Zhuo Jiang",
        "Ashley Kim",
        "Jianan Kong",
        "Zhichao Lai",
        "Shanshan Lao",
        "Ai Li",
        "Feiya Li",
        "Gen Li",
        "Huixia Li",
        "JiaShi Li",
        "Liang Li",
        "Ming Li",
        "Tao Li",
        "Xian Li",
        "Xiaojie Li",
        "Xiaoyang Li",
        "Xingxing Li",
        "Yameng Li",
        "Yifu Li",
        "Yiying Li",
        "Chao Liang",
        "Ying Liang",
        "Zhiqiang Liang",
        "Wang Liao",
        "Yalin Liao",
        "Heng Lin",
        "Kengyu Lin",
        "Shanchuan Lin",
        "Xi Lin",
        "Zhijie Lin",
        "Feng Ling",
        "Fangfang Liu",
        "Gaohong Liu",
        "Jiawei Liu",
        "Jie Liu",
        "Shouda Liu",
        "Shu Liu",
        "Sichao Liu",
        "Songwei Liu",
        "Xin Liu",
        "Xue Liu",
        "Yibo Liu",
        "Zikun Liu",
        "Zuxi Liu",
        "Junlin Lyu",
        "Lecheng Lyu",
        "Qian Lyu",
        "Han Mu",
        "Xiaonan Nie",
        "Jingzhe Ning",
        "Xitong Pan",
        "Yanghua Peng",
        "Lianke Qin",
        "Xueqiong Qu",
        "Yuxi Ren",
        "Yuchen Shen",
        "Guang Shi",
        "Lei Shi",
        "Yan Song",
        "Yinglong Song",
        "Fan Sun",
        "Li Sun",
        "Renfei Sun",
        "Zeyu Sun",
        "Wenjing Tang",
        "Zirui Tao",
        "Feng Wang",
        "Furui Wang",
        "Jinran Wang",
        "Junkai Wang",
        "Ke Wang",
        "Kexin Wang",
        "Qingyi Wang",
        "Rui Wang",
        "Sen Wang",
        "Shuai Wang",
        "Tingru Wang",
        "Weichen Wang",
        "Xin Wang",
        "Yanhui Wang",
        "Yue Wang",
        "Yuping Wang",
        "Yuxuan Wang",
        "Ziyu Wang",
        "Guoqiang Wei",
        "Wanru Wei",
        "Di Wu",
        "Guohong Wu",
        "Hanjie Wu",
        "Jian Wu",
        "Jie Wu",
        "Ruolan Wu",
        "Xinglong Wu",
        "Yonghui Wu",
        "Ruiqi Xia",
        "Liang Xiang",
        "Fei Xiao",
        "XueFeng Xiao",
        "Pan Xie",
        "Shuangyi Xie",
        "Shuang Xu",
        "Jinlan Xue",
        "Bangbang Yang",
        "Ceyuan Yang",
        "Jiaqi Yang",
        "Runkai Yang",
        "Tao Yang",
        "Yang Yang",
        "Yihang Yang",
        "ZhiXian Yang",
        "Ziyan Yang",
        "Yifan Yao",
        "Zilyu Ye",
        "Bowen Yu",
        "Chujie Yuan",
        "Linxiao Yuan",
        "Sichun Zeng",
        "Weihong Zeng",
        "Xuejiao Zeng",
        "Yan Zeng",
        "Chuntao Zhang",
        "Heng Zhang",
        "Jingjie Zhang",
        "Kuo Zhang",
        "Liang Zhang",
        "Liying Zhang",
        "Manlin Zhang",
        "Ting Zhang",
        "Weida Zhang",
        "Xiaohe Zhang",
        "Xinyan Zhang",
        "Yan Zhang",
        "Yuan Zhang",
        "Zixiang Zhang",
        "Fengxuan Zhao",
        "Huating Zhao",
        "Yang Zhao",
        "Hao Zheng",
        "Jianbin Zheng",
        "Xiaozheng Zheng",
        "Yangyang Zheng",
        "Yijie Zheng",
        "Jiexin Zhou",
        "Kuan Zhu",
        "Shenhan Zhu",
        "Wenjia Zhu",
        "Benhui Zou",
        "Feilong Zuo"
      ],
      "abstract": "Recent strides in video generation have paved the way for unified audio-visual generation. In this work, we present Seedance 1.5 pro, a foundational model engineered specifically for native, joint audio-video generation. Leveraging a dual-branch Diffusion Transformer architecture, the model integrates a cross-modal joint module with a specialized multi-stage data pipeline, achieving exceptional audio-visual synchronization and superior generation quality. To ensure practical utility, we implement meticulous post-training optimizations, including Supervised Fine-Tuning (SFT) on high-quality datasets and Reinforcement Learning from Human Feedback (RLHF) with multi-dimensional reward models. Furthermore, we introduce an acceleration framework that boosts inference speed by over 10X. Seedance 1.5 pro distinguishes itself through precise multilingual and dialect lip-syncing, dynamic cinematic camera control, and enhanced narrative coherence, positioning it as a robust engine for professional-grade content creation. Seedance 1.5 pro is now accessible on Volcano Engine at https://console.volcengine.com/ark/region:ark+cn-beijing/experience/vision?type=GenVideo.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13507v1",
        "pdf": "https://arxiv.org/pdf/2512.13507v1"
      },
      "arxiv_id": "2512.13507v1",
      "comment": "Seedance 1.5 pro Technical Report",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13506v1",
      "title": "Learning under Distributional Drift: Reproducibility as an Intrinsic Statistical Resource",
      "authors": [
        "Sofiya Zaichyk"
      ],
      "abstract": "Statistical learning under distributional drift remains insufficiently characterized: when each observation alters the data-generating law, classical generalization bounds can collapse. We introduce a new statistical primitive, the reproducibility budget $C_T$, which quantifies a system's finite capacity for statistical reproducibility - the extent to which its sampling process can remain governed by a consistent underlying distribution in the presence of both exogenous change and endogenous feedback. Formally, $C_T$ is defined as the cumulative Fisher-Rao path length of the coupled learner-environment evolution, measuring the total distributional motion accumulated during learning. From this construct we derive a drift-feedback generalization bound of order $O(T^{-1/2} + C_T/T)$, and we prove a matching minimax lower bound showing that this rate is minimax-optimal. Consequently, the results establish a reproducibility speed limit: no algorithm can achieve smaller worst-case generalization error than that imposed by the average Fisher-Rao drift rate $C_T/T$ of the data-generating process. The framework situates exogenous drift, adaptive data analysis, and performative prediction within a common geometric structure, with $C_T$ emerging as the intrinsic quantity measuring distributional motion across these settings.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13506v1",
        "pdf": "https://arxiv.org/pdf/2512.13506v1"
      },
      "arxiv_id": "2512.13506v1",
      "comment": "37 pages, 4 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13505v1",
      "title": "Defending the Hierarchical Result Models of Precedential Constraint",
      "authors": [
        "Henry Prakken",
        "Wijnand van Woerkom"
      ],
      "abstract": "In recent years, hierarchical case-based-reasoning models of precedential constraint have been proposed. In various papers, Trevor Bench-Capon criticised these models on the grounds that they would give incorrect outcomes in some cases. In particular, the models would not account for the possibility that intermediate factors are established with different strengths by different base-level factors. In this paper we respond to these criticisms for van Woerkom's result-based hierarchical models. We argue that in some examples Bench-Capon seems to interpret intermediate factors as dimensions, and that applying van Woerkom's dimension-based version of the hierarchical result model to these examples avoids Bench-Capon's criticisms.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13505v1",
        "pdf": "https://arxiv.org/pdf/2512.13505v1"
      },
      "arxiv_id": "2512.13505v1",
      "comment": "This is the long version of a paper with the same title presented at the 38th International Conference on Legal Knowledge and Information Systems",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13501v1",
      "title": "Behavior-Aware and Generalizable Defense Against Black-Box Adversarial Attacks for ML-Based IDS",
      "authors": [
        "Sabrine Ennaji",
        "Elhadj Benkhelifa",
        "Luigi Vincenzo Mancini"
      ],
      "abstract": "Machine learning based intrusion detection systems are increasingly targeted by black box adversarial attacks, where attackers craft evasive inputs using indirect feedback such as binary outputs or behavioral signals like response time and resource usage. While several defenses have been proposed, including input transformation, adversarial training, and surrogate detection, they often fall short in practice. Most are tailored to specific attack types, require internal model access, or rely on static mechanisms that fail to generalize across evolving attack strategies. Furthermore, defenses such as input transformation can degrade intrusion detection system performance, making them unsuitable for real time deployment.\n  To address these limitations, we propose Adaptive Feature Poisoning, a lightweight and proactive defense mechanism designed specifically for realistic black box scenarios. Adaptive Feature Poisoning assumes that probing can occur silently and continuously, and introduces dynamic and context aware perturbations to selected traffic features, corrupting the attacker feedback loop without impacting detection capabilities. The method leverages traffic profiling, change point detection, and adaptive scaling to selectively perturb features that an attacker is likely exploiting, based on observed deviations.\n  We evaluate Adaptive Feature Poisoning against multiple realistic adversarial attack strategies, including silent probing, transferability based attacks, and decision boundary based attacks. The results demonstrate its ability to confuse attackers, degrade attack effectiveness, and preserve detection performance. By offering a generalizable, attack agnostic, and undetectable defense, Adaptive Feature Poisoning represents a significant step toward practical and robust adversarial resilience in machine learning based intrusion detection systems.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CR",
        "cs.AI"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13501v1",
        "pdf": "https://arxiv.org/pdf/2512.13501v1"
      },
      "arxiv_id": "2512.13501v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13497v1",
      "title": "On-Device Continual Learning for Unsupervised Visual Anomaly Detection in Dynamic Manufacturing",
      "authors": [
        "Haoyu Ren",
        "Kay Koehle",
        "Kirill Dorofeev",
        "Darko Anicic"
      ],
      "abstract": "In modern manufacturing, Visual Anomaly Detection (VAD) is essential for automated inspection and consistent product quality. Yet, increasingly dynamic and flexible production environments introduce key challenges: First, frequent product changes in small-batch and on-demand manufacturing require rapid model updates. Second, legacy edge hardware lacks the resources to train and run large AI models. Finally, both anomalous and normal training data are often scarce, particularly for newly introduced product variations. We investigate on-device continual learning for unsupervised VAD with localization, extending the PatchCore to incorporate online learning for real-world industrial scenarios. The proposed method leverages a lightweight feature extractor and an incremental coreset update mechanism based on k-center selection, enabling rapid, memory-efficient adaptation from limited data while eliminating costly cloud retraining. Evaluations on an industrial use case are conducted using a testbed designed to emulate flexible production with frequent variant changes in a controlled environment. Our method achieves a 12% AUROC improvement over the baseline, an 80% reduction in memory usage, and faster training compared to batch retraining. These results confirm that our method delivers accurate, resource-efficient, and adaptive VAD suitable for dynamic and smart manufacturing.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.CV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13497v1",
        "pdf": "https://arxiv.org/pdf/2512.13497v1"
      },
      "arxiv_id": "2512.13497v1",
      "comment": "Accepted by European Conference on EDGE AI Technologies and Applications (EEAI) 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13495v1",
      "title": "Soul: Breathe Life into Digital Human for High-fidelity Long-term Multimodal Animation",
      "authors": [
        "Jiangning Zhang",
        "Junwei Zhu",
        "Zhenye Gan",
        "Donghao Luo",
        "Chuming Lin",
        "Feifan Xu",
        "Xu Peng",
        "Jianlong Hu",
        "Yuansen Liu",
        "Yijia Hong",
        "Weijian Cao",
        "Han Feng",
        "Xu Chen",
        "Chencan Fu",
        "Keke He",
        "Xiaobin Hu",
        "Chengjie Wang"
      ],
      "abstract": "We propose a multimodal-driven framework for high-fidelity long-term digital human animation termed $\\textbf{Soul}$, which generates semantically coherent videos from a single-frame portrait image, text prompts, and audio, achieving precise lip synchronization, vivid facial expressions, and robust identity preservation. We construct Soul-1M, containing 1 million finely annotated samples with a precise automated annotation pipeline (covering portrait, upper-body, full-body, and multi-person scenes) to mitigate data scarcity, and we carefully curate Soul-Bench for comprehensive and fair evaluation of audio-/text-guided animation methods. The model is built on the Wan2.2-5B backbone, integrating audio-injection layers and multiple training strategies together with threshold-aware codebook replacement to ensure long-term generation consistency. Meanwhile, step/CFG distillation and a lightweight VAE are used to optimize inference efficiency, achieving an 11.4$\\times$ speedup with negligible quality loss. Extensive experiments show that Soul significantly outperforms current leading open-source and commercial models on video quality, video-text alignment, identity preservation, and lip-synchronization accuracy, demonstrating broad applicability in real-world scenarios such as virtual anchors and film production. Project page at https://zhangzjn.github.io/projects/Soul/",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13495v1",
        "pdf": "https://arxiv.org/pdf/2512.13495v1"
      },
      "arxiv_id": "2512.13495v1",
      "comment": "Project page: https://zhangzjn.github.io/projects/Soul/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13494v1",
      "title": "SkipCat: Rank-Maximized Low-Rank Compression of Large Language Models via Shared Projection and Block Skipping",
      "authors": [
        "Yu-Chen Lu",
        "Sheng-Feng Yu",
        "Hui-Hsien Weng",
        "Pei-Shuo Wang",
        "Yu-Fang Hu",
        "Liang Hung-Chun",
        "Hung-Yueh Chiang",
        "Kai-Chiang Wu"
      ],
      "abstract": "Large language models (LLM) have achieved remarkable performance across a wide range of tasks. However, their substantial parameter sizes pose significant challenges for deployment on edge devices with limited computational and memory resources. Low-rank compression is a promising approach to address this issue, as it reduces both computational and memory costs, making LLM more suitable for resource-constrained environments. Nonetheless, naïve low-rank compression methods require a significant reduction in the retained rank to achieve meaningful memory and computation savings. For a low-rank model, the ranks need to be reduced by more than half to yield efficiency gains. Such aggressive truncation, however, typically results in substantial performance degradation. To address this trade-off, we propose SkipCat, a novel low-rank compression framework that enables the use of higher ranks while achieving the same compression rates. First, we introduce an intra-layer shared low-rank projection method, where multiple matrices that share the same input use a common projection. This reduces redundancy and improves compression efficiency. Second, we propose a block skipping technique that omits computations and memory transfers for selected sub-blocks within the low-rank decomposition. These two techniques jointly enable our compressed model to retain more effective ranks under the same compression budget. Experimental results show that, without any additional fine-tuning, our method outperforms previous low-rank compression approaches by 7% accuracy improvement on zero-shot tasks under the same compression rate. These results highlight the effectiveness of our rank-maximized compression strategy in preserving model performance under tight resource constraints.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13494v1",
        "pdf": "https://arxiv.org/pdf/2512.13494v1"
      },
      "arxiv_id": "2512.13494v1",
      "comment": "Accepted by AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13492v1",
      "title": "Transform Trained Transformer: Accelerating Naive 4K Video Generation Over 10$\\times$",
      "authors": [
        "Jiangning Zhang",
        "Junwei Zhu",
        "Teng Hu",
        "Yabiao Wang",
        "Donghao Luo",
        "Weijian Cao",
        "Zhenye Gan",
        "Xiaobin Hu",
        "Zhucun Xue",
        "Chengjie Wang"
      ],
      "abstract": "Native 4K (2160$\\times$3840) video generation remains a critical challenge due to the quadratic computational explosion of full-attention as spatiotemporal resolution increases, making it difficult for models to strike a balance between efficiency and quality. This paper proposes a novel Transformer retrofit strategy termed $\\textbf{T3}$ ($\\textbf{T}$ransform $\\textbf{T}$rained $\\textbf{T}$ransformer) that, without altering the core architecture of full-attention pretrained models, significantly reduces compute requirements by optimizing their forward logic. Specifically, $\\textbf{T3-Video}$ introduces a multi-scale weight-sharing window attention mechanism and, via hierarchical blocking together with an axis-preserving full-attention design, can effect an \"attention pattern\" transformation of a pretrained model using only modest compute and data. Results on 4K-VBench show that $\\textbf{T3-Video}$ substantially outperforms existing approaches: while delivering performance improvements (+4.29$\\uparrow$ VQA and +0.08$\\uparrow$ VTC), it accelerates native 4K video generation by more than 10$\\times$. Project page at https://zhangzjn.github.io/projects/T3-Video",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13492v1",
        "pdf": "https://arxiv.org/pdf/2512.13492v1"
      },
      "arxiv_id": "2512.13492v1",
      "comment": "Project page: https://zhangzjn.github.io/projects/T3-Video",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13491v1",
      "title": "From Zipf's Law to Neural Scaling through Heaps' Law and Hilberg's Hypothesis",
      "authors": [
        "Łukasz Dębowski"
      ],
      "abstract": "We inspect the deductive connection between the neural scaling law and Zipf's law -- two statements discussed in machine learning and quantitative linguistics. The neural scaling law describes how the cross entropy rate of a foundation model -- such as a large language model -- changes with respect to the amount of training tokens, parameters, and compute. By contrast, Zipf's law posits that the distribution of tokens exhibits a power law tail. Whereas similar claims have been made in more specific settings, we show that the neural scaling law is a consequence of Zipf's law under certain broad assumptions that we reveal systematically. The derivation steps are as follows: We derive Heaps' law on the vocabulary growth from Zipf's law, Hilberg's hypothesis on the entropy scaling from Heaps' law, and the neural scaling from Hilberg's hypothesis. We illustrate these inference steps by a toy example of the Santa Fe process that satisfies all the four statistical laws.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.IT",
        "cs.LG",
        "math.ST"
      ],
      "primary_category": "cs.IT",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13491v1",
        "pdf": "https://arxiv.org/pdf/2512.13491v1"
      },
      "arxiv_id": "2512.13491v1",
      "comment": "32 pages, no figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13482v1",
      "title": "Real-Time AI-Driven Milling Digital Twin Towards Extreme Low-Latency",
      "authors": [
        "Wenyi Liu",
        "R. Sharma",
        "W. \"Grace\" Guo",
        "J. Yi",
        "Y. B. Guo"
      ],
      "abstract": "Digital twin (DT) enables smart manufacturing by leveraging real-time data, AI models, and intelligent control systems. This paper presents a state-of-the-art analysis on the emerging field of DTs in the context of milling. The critical aspects of DT are explored through the lens of virtual models of physical milling, data flow from physical milling to virtual model, and feedback from virtual model to physical milling. Live data streaming protocols and virtual modeling methods are highlighted. A case study showcases the transformative capability of a real-time machine learning-driven live DT of tool-work contact in a milling process. Future research directions are outlined to achieve the goals of Industry 4.0 and beyond.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "eess.SY",
        "cs.LG"
      ],
      "primary_category": "eess.SY",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13482v1",
        "pdf": "https://arxiv.org/pdf/2512.13482v1"
      },
      "arxiv_id": "2512.13482v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13481v1",
      "title": "neuralFOMO: Can LLMs Handle Being Second Best? Measuring Envy-Like Preferences in Multi-Agent Settings",
      "authors": [
        "Ojas Pungalia",
        "Rashi Upadhyay",
        "Abhishek Mishra",
        "Abhiram H",
        "Tejasvi Alladi",
        "Sujan Yenuganti",
        "Dhruv Kumar"
      ],
      "abstract": "Envy is a common human behavior that shapes competitiveness and can alter outcomes in team settings. As large language models (LLMs) increasingly act on behalf of humans in collaborative and competitive workflows, there is a pressing need to evaluate whether and under what conditions they exhibit envy-like preferences. In this paper, we test whether LLMs show envy-like behavior toward each other. We considered two scenarios: (1) A point allocation game that tests whether a model tries to win over its peer. (2) A workplace setting observing behaviour when recognition is unfair. Our findings reveal consistent evidence of envy-like patterns in certain LLMs, with large variation across models and contexts. For instance, GPT-5-mini and Claude-3.7-Sonnet show a clear tendency to pull down the peer model to equalize outcomes, whereas Mistral-Small-3.2-24B instead focuses on maximizing its own individual gains. These results highlight the need to consider competitive dispositions as a safety and design factor in LLM-based multi-agent systems.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.CY"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13481v1",
        "pdf": "https://arxiv.org/pdf/2512.13481v1"
      },
      "arxiv_id": "2512.13481v1",
      "comment": "Under Review",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13480v1",
      "title": "Element-wise Modulation of Random Matrices for Efficient Neural Layers",
      "authors": [
        "Maksymilian Szorc"
      ],
      "abstract": "Fully connected layers are a primary source of memory and computational overhead in deep neural networks due to their dense, often redundant parameterization. While various compression techniques exist, they frequently introduce complex engineering trade-offs or degrade model performance. We propose the Parametrized Random Projection (PRP) layer, a novel approach that decouples feature mixing from adaptation by utilizing a fixed random matrix modulated by lightweight, learnable element-wise parameters. This architecture drastically reduces the trainable parameter count to a linear scale while retaining reliable accuracy across various benchmarks. The design serves as a stable, computationally efficient solution for architectural scaling and deployment in resource-limited settings.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13480v1",
        "pdf": "https://arxiv.org/pdf/2512.13480v1"
      },
      "arxiv_id": "2512.13480v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13478v1",
      "title": "Non-Resolution Reasoning: A Framework for Preserving Semantic Ambiguity in Language Models",
      "authors": [
        "Kei Saito"
      ],
      "abstract": "Premature semantic collapse -- the forced early commitment to a single meaning -- remains a core architectural limitation of current language models. Softmax-driven competition and greedy decoding cause models to discard valid interpretations before sufficient context is available, resulting in brittle reasoning and context failures. We introduce Non-Resolution Reasoning (NRR), a general computational framework that preserves semantic ambiguity during inference and performs resolution only when explicitly required. NRR integrates three components: (1) Multi-Vector Embeddings that maintain multiple viable interpretations per token, (2) Non-Collapsing Attention that prevents winner-take-all dynamics across layers, and (3) Contextual Identity Tracking (CIT), which assigns context-specific identities to recurring entities (e.g., distinguishing \"Dr. Smith the cardiologist\" from \"Dr. Smith the researcher\"). These mechanisms are unified by an external Resolution Operator $ρ$ that makes semantic commitment explicit, controllable, and task-dependent. Unlike standard architectures, NRR separates representation from resolution, allowing a single model to shift between creative, factual, and ambiguity-preserving reasoning without retraining. A synthetic evaluation demonstrates NRR's ability to preserve ambiguity and track context: CIT-enhanced models achieve 90.9% accuracy on out-of-distribution identity-shift tasks, compared to 9.1% for transformer baselines. NRR provides a principled alternative to premature collapse, reframing ambiguity as an explicit representational state rather than a failure mode. The question is not whether AI should resolve ambiguity, but when, how, and under whose control.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13478v1",
        "pdf": "https://arxiv.org/pdf/2512.13478v1"
      },
      "arxiv_id": "2512.13478v1",
      "comment": "19 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13465v1",
      "title": "PoseAnything: Universal Pose-guided Video Generation with Part-aware Temporal Coherence",
      "authors": [
        "Ruiyan Wang",
        "Teng Hu",
        "Kaihui Huang",
        "Zihan Su",
        "Ran Yi",
        "Lizhuang Ma"
      ],
      "abstract": "Pose-guided video generation refers to controlling the motion of subjects in generated video through a sequence of poses. It enables precise control over subject motion and has important applications in animation. However, current pose-guided video generation methods are limited to accepting only human poses as input, thus generalizing poorly to pose of other subjects. To address this issue, we propose PoseAnything, the first universal pose-guided video generation framework capable of handling both human and non-human characters, supporting arbitrary skeletal inputs. To enhance consistency preservation during motion, we introduce Part-aware Temporal Coherence Module, which divides the subject into different parts, establishes part correspondences, and computes cross-attention between corresponding parts across frames to achieve fine-grained part-level consistency. Additionally, we propose Subject and Camera Motion Decoupled CFG, a novel guidance strategy that, for the first time, enables independent camera movement control in pose-guided video generation, by separately injecting subject and camera motion control information into the positive and negative anchors of CFG. Furthermore, we present XPose, a high-quality public dataset containing 50,000 non-human pose-video pairs, along with an automated pipeline for annotation and filtering. Extensive experiments demonstrate that Pose-Anything significantly outperforms state-of-the-art methods in both effectiveness and generalization.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13465v1",
        "pdf": "https://arxiv.org/pdf/2512.13465v1"
      },
      "arxiv_id": "2512.13465v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13460v1",
      "title": "DP-EMAR: A Differentially Private Framework for Autonomous Model Weight Repair in Federated IoT Systems",
      "authors": [
        "Chethana Prasad Kabgere",
        "Shylaja S S"
      ],
      "abstract": "Federated Learning (FL) enables decentralized model training without sharing raw data, but model weight distortion remains a major challenge in resource constrained IoT networks. In multi tier Federated IoT (Fed-IoT) systems, unstable connectivity and adversarial interference can silently alter transmitted parameters, degrading convergence. We propose DP-EMAR, a differentially private, error model based autonomous repair framework that detects and reconstructs transmission induced distortions during FL aggregation. DP-EMAR estimates corruption patterns and applies adaptive correction before privacy noise is added, enabling reliable in network repair without violating confidentiality. By integrating Differential Privacy (DP) with Secure Aggregation (SA), the framework distinguishes DP noise from genuine transmission errors. Experiments on heterogeneous IoT sensor and graph datasets show that DP-EMAR preserves convergence stability and maintains near baseline performance under communication corruption while ensuring strict (epsilon, delta)-DP guarantees. The framework enhances robustness, communication efficiency, and trust in privacy preserving Federated IoT learning.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "math.NA"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13460v1",
        "pdf": "https://arxiv.org/pdf/2512.13460v1"
      },
      "arxiv_id": "2512.13460v1",
      "comment": "Accepted and presented at the AI-IoT Workshop, co-located with COMSNETS 2025",
      "journal_ref": "Proc. International Conference on Communication Systems and Networks (COMSNETS), 2025",
      "has_code": false
    },
    {
      "id": "2512.13458v1",
      "title": "SSAS: Cross-subject EEG-based Emotion Recognition through Source Selection with Adversarial Strategy",
      "authors": [
        "Yici Liu",
        "Qi Wei Oung",
        "Hoi Leong Lee"
      ],
      "abstract": "Electroencephalographic (EEG) signals have long been applied in the field of affective brain-computer interfaces (aBCIs). Cross-subject EEG-based emotion recognition has demonstrated significant potential in practical applications due to its suitability across diverse people. However, most studies on cross-subject EEG-based emotion recognition neglect the presence of inter-individual variability and negative transfer phenomena during model training. To address this issue, a cross-subject EEG-based emotion recognition through source selection with adversarial strategy is introduced in this paper. The proposed method comprises two modules: the source selection network (SS) and the adversarial strategies network (AS). The SS uses domain labels to reverse-engineer the training process of domain adaptation. Its key idea is to disrupt class separability and magnify inter-domain differences, thereby raising the classification difficulty and forcing the model to learn domain-invariant yet emotion-relevant representations. The AS gets the source domain selection results and the pretrained domain discriminators from SS. The pretrained domain discriminators compute a novel loss aimed at enhancing the performance of domain classification during adversarial training, ensuring the balance of adversarial strategies. This paper provides theoretical insights into the proposed method and achieves outstanding performance on two EEG-based emotion datasets, SEED and SEED-IV. The code can be found at https://github.com/liuyici/SSAS.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.AI",
        "eess.SP"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13458v1",
        "pdf": "https://arxiv.org/pdf/2512.13458v1"
      },
      "arxiv_id": "2512.13458v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13454v1",
      "title": "Test-Time Modification: Inverse Domain Transformation for Robust Perception",
      "authors": [
        "Arpit Jadon",
        "Joshua Niemeijer",
        "Yuki M. Asano"
      ],
      "abstract": "Generative foundation models contain broad visual knowledge and can produce diverse image variations, making them particularly promising for advancing domain generalization tasks. While they can be used for training data augmentation, synthesizing comprehensive target-domain variations remains slow, expensive, and incomplete. We propose an alternative: using diffusion models at test time to map target images back to the source distribution where the downstream model was trained. This approach requires only a source domain description, preserves the task model, and eliminates large-scale synthetic data generation. We demonstrate consistent improvements across segmentation, detection, and classification tasks under challenging environmental shifts in real-to-real domain generalization scenarios with unknown target distributions. Our analysis spans multiple generative and downstream models, including an ensemble variant for enhanced robustness. The method achieves substantial relative gains: 137% on BDD100K-Night, 68% on ImageNet-R, and 62% on DarkZurich.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13454v1",
        "pdf": "https://arxiv.org/pdf/2512.13454v1"
      },
      "arxiv_id": "2512.13454v1",
      "comment": "Preprint",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13442v1",
      "title": "XNNTab -- Interpretable Neural Networks for Tabular Data using Sparse Autoencoders",
      "authors": [
        "Khawla Elhadri",
        "Jörg Schlötterer",
        "Christin Seifert"
      ],
      "abstract": "In data-driven applications relying on tabular data, where interpretability is key, machine learning models such as decision trees and linear regression are applied. Although neural networks can provide higher predictive performance, they are not used because of their blackbox nature. In this work, we present XNNTab, a neural architecture that combines the expressiveness of neural networks and interpretability. XNNTab first learns highly non-linear feature representations, which are decomposed into monosemantic features using a sparse autoencoder (SAE). These features are then assigned human-interpretable concepts, making the overall model prediction intrinsically interpretable. XNNTab outperforms interpretable predictive models, and achieves comparable performance to its non-interpretable counterparts.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13442v1",
        "pdf": "https://arxiv.org/pdf/2512.13442v1"
      },
      "arxiv_id": "2512.13442v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13440v1",
      "title": "IMILIA: interpretable multiple instance learning for inflammation prediction in IBD from H&E whole slide images",
      "authors": [
        "Thalyssa Baiocco-Rodrigues",
        "Antoine Olivier",
        "Reda Belbahri",
        "Thomas Duboudin",
        "Pierre-Antoine Bannier",
        "Benjamin Adjadj",
        "Katharina Von Loga",
        "Nathan Noiry",
        "Maxime Touzot",
        "Hector Roux de Bezieux"
      ],
      "abstract": "As the therapeutic target for Inflammatory Bowel Disease (IBD) shifts toward histologic remission, the accurate assessment of microscopic inflammation has become increasingly central for evaluating disease activity and response to treatment. In this work, we introduce IMILIA (Interpretable Multiple Instance Learning for Inflammation Analysis), an end-to-end framework designed for the prediction of inflammation presence in IBD digitized slides stained with hematoxylin and eosin (H&E), followed by the automated computation of markers characterizing tissue regions driving the predictions. IMILIA is composed of an inflammation prediction module, consisting of a Multiple Instance Learning (MIL) model, and an interpretability module, divided in two blocks: HistoPLUS, for cell instance detection, segmentation and classification; and EpiSeg, for epithelium segmentation. IMILIA achieves a cross-validation ROC-AUC of 0.83 on the discovery cohort, and a ROC-AUC of 0.99 and 0.84 on two external validation cohorts. The interpretability module yields biologically consistent insights: tiles with higher predicted scores show increased densities of immune cells (lymphocytes, plasmocytes, neutrophils and eosinophils), whereas lower-scored tiles predominantly contain normal epithelial cells. Notably, these patterns were consistent across all datasets. Code and models to partially replicate the results on the public IBDColEpi dataset can be found at https://github.com/owkin/imilia.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13440v1",
        "pdf": "https://arxiv.org/pdf/2512.13440v1"
      },
      "arxiv_id": "2512.13440v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13438v1",
      "title": "From User Interface to Agent Interface: Efficiency Optimization of UI Representations for LLM Agents",
      "authors": [
        "Dezhi Ran",
        "Zhi Gong",
        "Yuzhe Guo",
        "Mengzhou Wu",
        "Yuan Cao",
        "Haochuan Lu",
        "Hengyu Zhang",
        "Xia Zeng",
        "Gang Cao",
        "Liangchao Yao",
        "Yuetang Deng",
        "Wei Yang",
        "Tao Xie"
      ],
      "abstract": "While Large Language Model (LLM) agents show great potential for automated UI navigation such as automated UI testing and AI assistants, their efficiency has been largely overlooked. Our motivating study reveals that inefficient UI representation creates a critical performance bottleneck. However, UI representation optimization, formulated as the task of automatically generating programs that transform UI representations, faces two unique challenges. First, the lack of Boolean oracles, which traditional program synthesis uses to decisively validate semantic correctness, poses a fundamental challenge to co-optimization of token efficiency and completeness. Second, the need to process large, complex UI trees as input while generating long, compositional transformation programs, making the search space vast and error-prone. Toward addressing the preceding limitations, we present UIFormer, the first automated optimization framework that synthesizes UI transformation programs by conducting constraint-based optimization with structured decomposition of the complex synthesis task. First, UIFormer restricts the program space using a domain-specific language (DSL) that captures UI-specific operations. Second, UIFormer conducts LLM-based iterative refinement with correctness and efficiency rewards, providing guidance for achieving the efficiency-completeness co-optimization. UIFormer operates as a lightweight plugin that applies transformation programs for seamless integration with existing LLM agents, requiring minimal modifications to their core logic. Evaluations across three UI navigation benchmarks spanning Android and Web platforms with five LLMs demonstrate that UIFormer achieves 48.7% to 55.8% token reduction with minimal runtime overhead while maintaining or improving agent performance. Real-world industry deployment at WeChat further validates the practical impact of UIFormer.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.SE",
        "cs.AI"
      ],
      "primary_category": "cs.SE",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13438v1",
        "pdf": "https://arxiv.org/pdf/2512.13438v1"
      },
      "arxiv_id": "2512.13438v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13434v1",
      "title": "Self-Supervised Ultrasound Representation Learning for Renal Anomaly Prediction in Prenatal Imaging",
      "authors": [
        "Youssef Megahed",
        "Inok Lee",
        "Robin Ducharme",
        "Kevin Dick",
        "Adrian D. C. Chan",
        "Steven Hawken",
        "Mark C. Walker"
      ],
      "abstract": "Prenatal ultrasound is the cornerstone for detecting congenital anomalies of the kidneys and urinary tract, but diagnosis is limited by operator dependence and suboptimal imaging conditions. We sought to assess the performance of a self-supervised ultrasound foundation model for automated fetal renal anomaly classification using a curated dataset of 969 two-dimensional ultrasound images. A pretrained Ultrasound Self-Supervised Foundation Model with Masked Autoencoding (USF-MAE) was fine-tuned for binary and multi-class classification of normal kidneys, urinary tract dilation, and multicystic dysplastic kidney. Models were compared with a DenseNet-169 convolutional baseline using cross-validation and an independent test set. USF-MAE consistently improved upon the baseline across all evaluation metrics in both binary and multi-class settings. USF-MAE achieved an improvement of about 1.87% (AUC) and 7.8% (F1-score) on the validation set, 2.32% (AUC) and 4.33% (F1-score) on the independent holdout test set. The largest gains were observed in the multi-class setting, where the improvement in AUC was 16.28% and 46.15% in F1-score. To facilitate model interpretability, Score-CAM visualizations were adapted for a transformer architecture and show that model predictions were informed by known, clinically relevant renal structures, including the renal pelvis in urinary tract dilation and cystic regions in multicystic dysplastic kidney. These results show that ultrasound-specific self-supervised learning can generate a useful representation as a foundation for downstream diagnostic tasks. The proposed framework offers a robust, interpretable approach to support the prenatal detection of renal anomalies and demonstrates the promise of foundation models in obstetric imaging.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "eess.IV",
        "cs.CV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13434v1",
        "pdf": "https://arxiv.org/pdf/2512.13434v1"
      },
      "arxiv_id": "2512.13434v1",
      "comment": "14 pages, 8 figures, 4 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13428v1",
      "title": "A Domain-Adapted Lightweight Ensemble for Resource-Efficient Few-Shot Plant Disease Classification",
      "authors": [
        "Anika Islam",
        "Tasfia Tahsin",
        "Zaarin Anjum",
        "Md. Bakhtiar Hasan",
        "Md. Hasanul Kabir"
      ],
      "abstract": "Accurate and timely identification of plant leaf diseases is essential for resilient and sustainable agriculture, yet most deep learning approaches rely on large annotated datasets and computationally intensive models that are unsuitable for data-scarce and resource-constrained environments. To address these challenges we present a few-shot learning approach within a lightweight yet efficient framework that combines domain-adapted MobileNetV2 and MobileNetV3 models as feature extractors, along with a feature fusion technique to generate robust feature representation. For the classification task, the fused features are passed through a Bi-LSTM classifier enhanced with attention mechanisms to capture sequential dependencies and focus on the most relevant features, thereby achieving optimal classification performance even in complex, real-world environments with noisy or cluttered backgrounds. The proposed framework was evaluated across multiple experimental setups, including both laboratory-controlled and field-captured datasets. On tomato leaf diseases from the PlantVillage dataset, it consistently improved performance across 1 to 15 shot scenarios, reaching 98.23+-0.33% at 15 shot, closely approaching the 99.98% SOTA benchmark achieved by a Transductive LSTM with attention, while remaining lightweight and mobile-friendly. Under real-world conditions using field images from the Dhan Shomadhan dataset, it maintained robust performance, reaching 69.28+-1.49% at 15-shot and demonstrating strong resilience to complex backgrounds. Notably, it also outperformed the previous SOTA accuracy of 96.0% on six diseases from PlantVillage, achieving 99.72% with only 15-shot learning. With a compact model size of approximately 40 MB and inference complexity of approximately 1.12 GFLOPs, this work establishes a scalable, mobile-ready foundation for precise plant disease diagnostics in data-scarce regions.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13428v1",
        "pdf": "https://arxiv.org/pdf/2512.13428v1"
      },
      "arxiv_id": "2512.13428v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13427v1",
      "title": "MineTheGap: Automatic Mining of Biases in Text-to-Image Models",
      "authors": [
        "Noa Cohen",
        "Nurit Spingarn-Eliezer",
        "Inbar Huberman-Spiegelglas",
        "Tomer Michaeli"
      ],
      "abstract": "Text-to-Image (TTI) models generate images based on text prompts, which often leave certain aspects of the desired image ambiguous. When faced with these ambiguities, TTI models have been shown to exhibit biases in their interpretations. These biases can have societal impacts, e.g., when showing only a certain race for a stated occupation. They can also affect user experience when creating redundancy within a set of generated images instead of spanning diverse possibilities. Here, we introduce MineTheGap - a method for automatically mining prompts that cause a TTI model to generate biased outputs. Our method goes beyond merely detecting bias for a given prompt. Rather, it leverages a genetic algorithm to iteratively refine a pool of prompts, seeking for those that expose biases. This optimization process is driven by a novel bias score, which ranks biases according to their severity, as we validate on a dataset with known biases. For a given prompt, this score is obtained by comparing the distribution of generated images to the distribution of LLM-generated texts that constitute variations on the prompt. Code and examples are available on the project's webpage.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13427v1",
        "pdf": "https://arxiv.org/pdf/2512.13427v1"
      },
      "arxiv_id": "2512.13427v1",
      "comment": "Code and examples are available on the project's webpage at https://noa-cohen.github.io/MineTheGap/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13421v1",
      "title": "RecTok: Reconstruction Distillation along Rectified Flow",
      "authors": [
        "Qingyu Shi",
        "Size Wu",
        "Jinbin Bai",
        "Kaidong Yu",
        "Yujing Wang",
        "Yunhai Tong",
        "Xiangtai Li",
        "Xuelong Li"
      ],
      "abstract": "Visual tokenizers play a crucial role in diffusion models. The dimensionality of latent space governs both reconstruction fidelity and the semantic expressiveness of the latent feature. However, a fundamental trade-off is inherent between dimensionality and generation quality, constraining existing methods to low-dimensional latent spaces. Although recent works have leveraged vision foundation models to enrich the semantics of visual tokenizers and accelerate convergence, high-dimensional tokenizers still underperform their low-dimensional counterparts. In this work, we propose RecTok, which overcomes the limitations of high-dimensional visual tokenizers through two key innovations: flow semantic distillation and reconstruction--alignment distillation. Our key insight is to make the forward flow in flow matching semantically rich, which serves as the training space of diffusion transformers, rather than focusing on the latent space as in previous works. Specifically, our method distills the semantic information in VFMs into the forward flow trajectories in flow matching. And we further enhance the semantics by introducing a masked feature reconstruction loss. Our RecTok achieves superior image reconstruction, generation quality, and discriminative performance. It achieves state-of-the-art results on the gFID-50K under both with and without classifier-free guidance settings, while maintaining a semantically rich latent space structure. Furthermore, as the latent dimensionality increases, we observe consistent improvements. Code and model are available at https://shi-qingyu.github.io/rectok.github.io.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13421v1",
        "pdf": "https://arxiv.org/pdf/2512.13421v1"
      },
      "arxiv_id": "2512.13421v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13416v1",
      "title": "Learning to Generate Cross-Task Unexploitable Examples",
      "authors": [
        "Haoxuan Qu",
        "Qiuchi Xiang",
        "Yujun Cai",
        "Yirui Wu",
        "Majid Mirmehdi",
        "Hossein Rahmani",
        "Jun Liu"
      ],
      "abstract": "Unexploitable example generation aims to transform personal images into their unexploitable (unlearnable) versions before they are uploaded online, thereby preventing unauthorized exploitation of online personal images. Recently, this task has garnered significant research attention due to its critical relevance to personal data privacy. Yet, despite recent progress, existing methods for this task can still suffer from limited practical applicability, as they can fail to generate examples that are broadly unexploitable across different real-world computer vision tasks. To deal with this problem, in this work, we propose a novel Meta Cross-Task Unexploitable Example Generation (MCT-UEG) framework. At the core of our framework, to optimize the unexploitable example generator for effectively producing broadly unexploitable examples, we design a flat-minima-oriented meta training and testing scheme. Extensive experiments show the efficacy of our framework.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13416v1",
        "pdf": "https://arxiv.org/pdf/2512.13416v1"
      },
      "arxiv_id": "2512.13416v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13415v1",
      "title": "USTM: Unified Spatial and Temporal Modeling for Continuous Sign Language Recognition",
      "authors": [
        "Ahmed Abul Hasanaath",
        "Hamzah Luqman"
      ],
      "abstract": "Continuous sign language recognition (CSLR) requires precise spatio-temporal modeling to accurately recognize sequences of gestures in videos. Existing frameworks often rely on CNN-based spatial backbones combined with temporal convolution or recurrent modules. These techniques fail in capturing fine-grained hand and facial cues and modeling long-range temporal dependencies. To address these limitations, we propose the Unified Spatio-Temporal Modeling (USTM) framework, a spatio-temporal encoder that effectively models complex patterns using a combination of a Swin Transformer backbone enhanced with lightweight temporal adapter with positional embeddings (TAPE). Our framework captures fine-grained spatial features alongside short and long-term temporal context, enabling robust sign language recognition from RGB videos without relying on multi-stream inputs or auxiliary modalities. Extensive experiments on benchmarked datasets including PHOENIX14, PHOENIX14T, and CSL-Daily demonstrate that USTM achieves state-of-the-art performance against RGB-based as well as multi-modal CSLR approaches, while maintaining competitive performance against multi-stream approaches. These results highlight the strength and efficacy of the USTM framework for CSLR. The code is available at https://github.com/gufranSabri/USTM",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13415v1",
        "pdf": "https://arxiv.org/pdf/2512.13415v1"
      },
      "arxiv_id": "2512.13415v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13411v1",
      "title": "Computer vision training dataset generation for robotic environments using Gaussian splatting",
      "authors": [
        "Patryk Niżeniec",
        "Marcin Iwanowski"
      ],
      "abstract": "This paper introduces a novel pipeline for generating large-scale, highly realistic, and automatically labeled datasets for computer vision tasks in robotic environments. Our approach addresses the critical challenges of the domain gap between synthetic and real-world imagery and the time-consuming bottleneck of manual annotation. We leverage 3D Gaussian Splatting (3DGS) to create photorealistic representations of the operational environment and objects. These assets are then used in a game engine where physics simulations create natural arrangements. A novel, two-pass rendering technique combines the realism of splats with a shadow map generated from proxy meshes. This map is then algorithmically composited with the image to add both physically plausible shadows and subtle highlights, significantly enhancing realism. Pixel-perfect segmentation masks are generated automatically and formatted for direct use with object detection models like YOLO. Our experiments show that a hybrid training strategy, combining a small set of real images with a large volume of our synthetic data, yields the best detection and segmentation performance, confirming this as an optimal strategy for efficiently achieving robust and accurate models.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.GR"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13411v1",
        "pdf": "https://arxiv.org/pdf/2512.13411v1"
      },
      "arxiv_id": "2512.13411v1",
      "comment": "Code available at: https://patrykni.github.io/UnitySplat2Data/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13410v1",
      "title": "Multiclass Graph-Based Large Margin Classifiers: Unified Approach for Support Vectors and Neural Networks",
      "authors": [
        "Vítor M. Hanriot",
        "Luiz C. B. Torres",
        "Antônio P. Braga"
      ],
      "abstract": "While large margin classifiers are originally an outcome of an optimization framework, support vectors (SVs) can be obtained from geometric approaches. This article presents advances in the use of Gabriel graphs (GGs) in binary and multiclass classification problems. For Chipclass, a hyperparameter-less and optimization-less GG-based binary classifier, we discuss how activation functions and support edge (SE)-centered neurons affect the classification, proposing smoother functions and structural SV (SSV)-centered neurons to achieve margins with low probabilities and smoother classification contours. We extend the neural network architecture, which can be trained with backpropagation with a softmax function and a cross-entropy loss, or by solving a system of linear equations. A new subgraph-/distance-based membership function for graph regularization is also proposed, along with a new GG recomputation algorithm that is less computationally expensive than the standard approach. Experimental results with the Friedman test show that our method was better than previous GG-based classifiers and statistically equivalent to tree-based models.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13410v1",
        "pdf": "https://arxiv.org/pdf/2512.13410v1"
      },
      "arxiv_id": "2512.13410v1",
      "comment": "Accepted to the IEEE Transactions on Neural Networks and Learning Systems (TNNLS)",
      "journal_ref": "IEEE Transactions on Neural Networks and Learning Systems (Volume: 36, Issue: 5, May 2025, Pages: 8307 - 8316)",
      "has_code": false
    },
    {
      "id": "2512.13402v1",
      "title": "End2Reg: Learning Task-Specific Segmentation for Markerless Registration in Spine Surgery",
      "authors": [
        "Lorenzo Pettinari",
        "Sidaty El Hadramy",
        "Michael Wehrli",
        "Philippe C. Cattin",
        "Daniel Studer",
        "Carol C. Hasler",
        "Maria Licci"
      ],
      "abstract": "Purpose: Intraoperative navigation in spine surgery demands millimeter-level accuracy. Current systems based on intraoperative radiographic imaging and bone-anchored markers are invasive, radiation-intensive and workflow disruptive. Recent markerless RGB-D registration methods offer a promising alternative, but existing approaches rely on weak segmentation labels to isolate relevant anatomical structures, which can propagate errors throughout registration. Methods: We present End2Reg an end-to-end deep learning framework that jointly optimizes segmentation and registration, eliminating the need for weak segmentation labels and manual steps. The network learns segmentation masks specifically optimized for registration, guided solely by the registration objective without direct segmentation supervision. Results: The proposed framework achieves state-of-the-art performance on ex- and in-vivo benchmarks, reducing median Target Registration Error by 32% to 1.83mm and mean Root Mean Square Error by 45% to 3.95mm, respectively. An ablation study confirms that end-to-end optimization significantly improves registration accuracy. Conclusion: The presented end-to-end RGB-D registration pipeline removes dependency on weak labels and manual steps, advancing towards fully automatic, markerless intraoperative navigation. Code and interactive visualizations are available at: https://lorenzopettinari.github.io/end-2-reg/.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13402v1",
        "pdf": "https://arxiv.org/pdf/2512.13402v1"
      },
      "arxiv_id": "2512.13402v1",
      "comment": "Code and interactive visualizations: https://lorenzopettinari.github.io/end-2-reg/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13399v1",
      "title": "Differentiable Evolutionary Reinforcement Learning",
      "authors": [
        "Sitao Cheng",
        "Tianle Li",
        "Xuhan Huang",
        "Xunjian Yin",
        "Difan Zou"
      ],
      "abstract": "The design of effective reward functions presents a central and often arduous challenge in reinforcement learning (RL), particularly when developing autonomous agents for complex reasoning tasks. While automated reward optimization approaches exist, they typically rely on derivative-free evolutionary heuristics that treat the reward function as a black box, failing to capture the causal relationship between reward structure and task performance. To bridge this gap, we propose Differentiable Evolutionary Reinforcement Learning (DERL), a bilevel framework that enables the autonomous discovery of optimal reward signals. In DERL, a Meta-Optimizer evolves a reward function (i.e., Meta-Reward) by composing structured atomic primitives, guiding the training of an inner-loop policy. Crucially, unlike previous evolution, DERL is differentiable in its metaoptimization: it treats the inner-loop validation performance as a signal to update the Meta-Optimizer via reinforcement learning. This allows DERL to approximate the \"meta-gradient\" of task success, progressively learning to generate denser and more actionable feedback. We validate DERL across three distinct domains: robotic agent (ALFWorld), scientific simulation (ScienceWorld), and mathematical reasoning (GSM8k, MATH). Experimental results show that DERL achieves state-of-the-art performance on ALFWorld and ScienceWorld, significantly outperforming methods relying on heuristic rewards, especially in out-of-distribution scenarios. Analysis of the evolutionary trajectory demonstrates that DERL successfully captures the intrinsic structure of tasks, enabling selfimproving agent alignment without human intervention.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13399v1",
        "pdf": "https://arxiv.org/pdf/2512.13399v1"
      },
      "arxiv_id": "2512.13399v1",
      "comment": "Work in Progress. We release our code and model at https://github.com/sitaocheng/DERL",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.13397v1",
      "title": "rNCA: Self-Repairing Segmentation Masks",
      "authors": [
        "Malte Silbernagel",
        "Albert Alonso",
        "Jens Petersen",
        "Bulat Ibragimov",
        "Marleen de Bruijne",
        "Madeleine K. Wyburd"
      ],
      "abstract": "Accurately predicting topologically correct masks remains a difficult task for general segmentation models, which often produce fragmented or disconnected outputs. Fixing these artifacts typically requires hand-crafted refinement rules or architectures specialized to a particular task. Here, we show that Neural Cellular Automata (NCA) can be directly re-purposed as an effective refinement mechanism, using local, iterative updates guided by image context to repair segmentation masks. By training on imperfect masks and ground truths, the automaton learns the structural properties of the target shape while relying solely on local information. When applied to coarse, globally predicted masks, the learned dynamics progressively reconnect broken regions, prune loose fragments and converge towards stable, topologically consistent results. We show how refinement NCA (rNCA) can be easily applied to repair common topological errors produced by different base segmentation models and tasks: for fragmented retinal vessels, it yields 2-3% gains in Dice/clDice and improves Betti errors, reducing $β_0$ errors by 60% and $β_1$ by 20%; for myocardium, it repairs 61.5% of broken cases in a zero-shot setting while lowering ASSD and HD by 19% and 16%, respectively. This showcases NCA as effective and broadly applicable refiners.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.LG",
        "eess.IV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13397v1",
        "pdf": "https://arxiv.org/pdf/2512.13397v1"
      },
      "arxiv_id": "2512.13397v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13392v1",
      "title": "Beyond the Visible: Disocclusion-Aware Editing via Proxy Dynamic Graphs",
      "authors": [
        "Anran Qi",
        "Changjian Li",
        "Adrien Bousseau",
        "Niloy J. Mitra"
      ],
      "abstract": "We address image-to-video generation with explicit user control over the final frame's disoccluded regions. Current image-to-video pipelines produce plausible motion but struggle to generate predictable, articulated motions while enforcing user-specified content in newly revealed areas. Our key idea is to separate motion specification from appearance synthesis: we introduce a lightweight, user-editable Proxy Dynamic Graph (PDG) that deterministically yet approximately drives part motion, while a frozen diffusion prior is used to synthesize plausible appearance that follows that motion. In our training-free pipeline, the user loosely annotates and reposes a PDG, from which we compute a dense motion flow to leverage diffusion as a motion-guided shader. We then let the user edit appearance in the disoccluded areas of the image, and exploit the visibility information encoded by the PDG to perform a latent-space composite that reconciles motion with user intent in these areas. This design yields controllable articulation and user control over disocclusions without fine-tuning. We demonstrate clear advantages against state-of-the-art alternatives towards images turned into short videos of articulated objects, furniture, vehicles, and deformables. Our method mixes generative control, in the form of loose pose and structure, with predictable controls, in the form of appearance specification in the final frame in the disoccluded regions, unlocking a new image-to-video workflow. Code will be released on acceptance. Project page: https://anranqi.github.io/beyondvisible.github.io/",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13392v1",
        "pdf": "https://arxiv.org/pdf/2512.13392v1"
      },
      "arxiv_id": "2512.13392v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13381v1",
      "title": "Dual-Phase Federated Deep Unlearning via Weight-Aware Rollback and Reconstruction",
      "authors": [
        "Changjun Zhou",
        "Jintao Zheng",
        "Leyou Yang",
        "Pengfei Wang"
      ],
      "abstract": "Federated Unlearning (FUL) focuses on client data and computing power to offer a privacy-preserving solution. However, high computational demands, complex incentive mechanisms, and disparities in client-side computing power often lead to long times and higher costs. To address these challenges, many existing methods rely on server-side knowledge distillation that solely removes the updates of the target client, overlooking the privacy embedded in the contributions of other clients, which can lead to privacy leakage. In this work, we introduce DPUL, a novel server-side unlearning method that deeply unlearns all influential weights to prevent privacy pitfalls. Our approach comprises three components: (i) identifying high-weight parameters by filtering client update magnitudes, and rolling them back to ensure deep removal. (ii) leveraging the variational autoencoder (VAE) to reconstruct and eliminate low-weight parameters. (iii) utilizing a projection-based technique to recover the model. Experimental results on four datasets demonstrate that DPUL surpasses state-of-the-art baselines, providing a 1%-5% improvement in accuracy and up to 12x reduction in time cost.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13381v1",
        "pdf": "https://arxiv.org/pdf/2512.13381v1"
      },
      "arxiv_id": "2512.13381v1",
      "comment": "10 pages, submitted to INFOCOM 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13376v1",
      "title": "Unlocking Generalization in Polyp Segmentation with DINO Self-Attention \"keys\"",
      "authors": [
        "Carla Monteiro",
        "Valentina Corbetta",
        "Regina Beets-Tan",
        "Luís F. Teixeira",
        "Wilson Silva"
      ],
      "abstract": "Automatic polyp segmentation is crucial for improving the clinical identification of colorectal cancer (CRC). While Deep Learning (DL) techniques have been extensively researched for this problem, current methods frequently struggle with generalization, particularly in data-constrained or challenging settings. Moreover, many existing polyp segmentation methods rely on complex, task-specific architectures. To address these limitations, we present a framework that leverages the intrinsic robustness of DINO self-attention \"key\" features for robust segmentation. Unlike traditional methods that extract tokens from the deepest layers of the Vision Transformer (ViT), our approach leverages the key features of the self-attention module with a simple convolutional decoder to predict polyp masks, resulting in enhanced performance and better generalizability. We validate our approach using a multi-center dataset under two rigorous protocols: Domain Generalization (DG) and Extreme Single Domain Generalization (ESDG). Our results, supported by a comprehensive statistical analysis, demonstrate that this pipeline achieves state-of-the-art (SOTA) performance, significantly enhancing generalization, particularly in data-scarce and challenging scenarios. While avoiding a polyp-specific architecture, we surpass well-established models like nnU-Net and UM-Net. Additionally, we provide a systematic benchmark of the DINO framework's evolution, quantifying the specific impact of architectural advancements on downstream polyp segmentation performance.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13376v1",
        "pdf": "https://arxiv.org/pdf/2512.13376v1"
      },
      "arxiv_id": "2512.13376v1",
      "comment": "29 pages, 10 figures, 8 tables, under review at MIDL 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13374v1",
      "title": "Behavior and Representation in Large Language Models for Combinatorial Optimization: From Feature Extraction to Algorithm Selection",
      "authors": [
        "Francesca Da Ros",
        "Luca Di Gaspero",
        "Kevin Roitero"
      ],
      "abstract": "Recent advances in Large Language Models (LLMs) have opened new perspectives for automation in optimization. While several studies have explored how LLMs can generate or solve optimization models, far less is understood about what these models actually learn regarding problem structure or algorithmic behavior. This study investigates how LLMs internally represent combinatorial optimization problems and whether such representations can support downstream decision tasks. We adopt a twofold methodology combining direct querying, which assesses LLM capacity to explicitly extract instance features, with probing analyses that examine whether such information is implicitly encoded within their hidden layers. The probing framework is further extended to a per-instance algorithm selection task, evaluating whether LLM-derived representations can predict the best-performing solver. Experiments span four benchmark problems and three instance representations. Results show that LLMs exhibit moderate ability to recover feature information from problem instances, either through direct querying or probing. Notably, the predictive power of LLM hidden-layer representations proves comparable to that achieved through traditional feature extraction, suggesting that LLMs capture meaningful structural information relevant to optimization performance.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13374v1",
        "pdf": "https://arxiv.org/pdf/2512.13374v1"
      },
      "arxiv_id": "2512.13374v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13363v1",
      "title": "Detecting Emotion Drift in Mental Health Text Using Pre-Trained Transformers",
      "authors": [
        "Shibani Sankpal"
      ],
      "abstract": "This study investigates emotion drift: the change in emotional state across a single text, within mental health-related messages. While sentiment analysis typically classifies an entire message as positive, negative, or neutral, the nuanced shift of emotions over the course of a message is often overlooked. This study detects sentence-level emotions and measures emotion drift scores using pre-trained transformer models such as DistilBERT and RoBERTa. The results provide insights into patterns of emotional escalation or relief in mental health conversations. This methodology can be applied to better understand emotional dynamics in content.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13363v1",
        "pdf": "https://arxiv.org/pdf/2512.13363v1"
      },
      "arxiv_id": "2512.13363v1",
      "comment": "14 pages, 12 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13361v1",
      "title": "Automated User Identification from Facial Thermograms with Siamese Networks",
      "authors": [
        "Elizaveta Prozorova",
        "Anton Konev",
        "Vladimir Faerman"
      ],
      "abstract": "The article analyzes the use of thermal imaging technologies for biometric identification based on facial thermograms. It presents a comparative analysis of infrared spectral ranges (NIR, SWIR, MWIR, and LWIR). The paper also defines key requirements for thermal cameras used in biometric systems, including sensor resolution, thermal sensitivity, and a frame rate of at least 30 Hz. Siamese neural networks are proposed as an effective approach for automating the identification process. In experiments conducted on a proprietary dataset, the proposed method achieved an accuracy of approximately 80%. The study also examines the potential of hybrid systems that combine visible and infrared spectra to overcome the limitations of individual modalities. The results indicate that thermal imaging is a promising technology for developing reliable security systems.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.CR"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13361v1",
        "pdf": "https://arxiv.org/pdf/2512.13361v1"
      },
      "arxiv_id": "2512.13361v1",
      "comment": "5 pages, 2 figures, reported on 21st International Scientific and Practical Conference 'Electronic Means and Control Systems', dedicated to the 80th anniversary of radio engineering education beyond the Urals, Tomsk, 24 November 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13359v1",
      "title": "Fast Policy Learning for 6-DOF Position Control of Underwater Vehicles",
      "authors": [
        "Sümer Tunçay",
        "Alain Andres",
        "Ignacio Carlucho"
      ],
      "abstract": "Autonomous Underwater Vehicles (AUVs) require reliable six-degree-of-freedom (6-DOF) position control to operate effectively in complex and dynamic marine environments. Traditional controllers are effective under nominal conditions but exhibit degraded performance when faced with unmodeled dynamics or environmental disturbances. Reinforcement learning (RL) provides a powerful alternative but training is typically slow and sim-to-real transfer remains challenging. This work introduces a GPU-accelerated RL training pipeline built in JAX and MuJoCo-XLA (MJX). By jointly JIT-compiling large-scale parallel physics simulation and learning updates, we achieve training times of under two minutes.Through systematic evaluation of multiple RL algorithms, we show robust 6-DOF trajectory tracking and effective disturbance rejection in real underwater experiments, with policies transferred zero-shot from simulation. Our results provide the first explicit real-world demonstration of RL-based AUV position control across all six degrees of freedom.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.RO",
        "cs.LG"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13359v1",
        "pdf": "https://arxiv.org/pdf/2512.13359v1"
      },
      "arxiv_id": "2512.13359v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13356v1",
      "title": "Control of a Twin Rotor using Twin Delayed Deep Deterministic Policy Gradient (TD3)",
      "authors": [
        "Zeyad Gamal",
        "Youssef Mahran",
        "Ayman El-Badawy"
      ],
      "abstract": "This paper proposes a reinforcement learning (RL) framework for controlling and stabilizing the Twin Rotor Aerodynamic System (TRAS) at specific pitch and azimuth angles and tracking a given trajectory. The complex dynamics and non-linear characteristics of the TRAS make it challenging to control using traditional control algorithms. However, recent developments in RL have attracted interest due to their potential applications in the control of multirotors. The Twin Delayed Deep Deterministic Policy Gradient (TD3) algorithm was used in this paper to train the RL agent. This algorithm is used for environments with continuous state and action spaces, similar to the TRAS, as it does not require a model of the system. The simulation results illustrated the effectiveness of the RL control method. Next, external disturbances in the form of wind disturbances were used to test the controller's effectiveness compared to conventional PID controllers. Lastly, experiments on a laboratory setup were carried out to confirm the controller's effectiveness in real-world applications.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13356v1",
        "pdf": "https://arxiv.org/pdf/2512.13356v1"
      },
      "arxiv_id": "2512.13356v1",
      "comment": "This is the Author Accepted Manuscript version of a paper accepted for publication. The final published version is available via IEEE Xplore",
      "journal_ref": "2024 28th IEEE International Conference on System Theory, Control and Computing (ICSTCC)",
      "has_code": false
    },
    {
      "id": "2512.13352v1",
      "title": "On the Effectiveness of Membership Inference in Targeted Data Extraction from Large Language Models",
      "authors": [
        "Ali Al Sahili",
        "Ali Chehab",
        "Razane Tajeddine"
      ],
      "abstract": "Large Language Models (LLMs) are prone to memorizing training data, which poses serious privacy risks. Two of the most prominent concerns are training data extraction and Membership Inference Attacks (MIAs). Prior research has shown that these threats are interconnected: adversaries can extract training data from an LLM by querying the model to generate a large volume of text and subsequently applying MIAs to verify whether a particular data point was included in the training set. In this study, we integrate multiple MIA techniques into the data extraction pipeline to systematically benchmark their effectiveness. We then compare their performance in this integrated setting against results from conventional MIA benchmarks, allowing us to evaluate their practical utility in real-world extraction scenarios.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.CL",
        "cs.CR"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13352v1",
        "pdf": "https://arxiv.org/pdf/2512.13352v1"
      },
      "arxiv_id": "2512.13352v1",
      "comment": "Accepted to IEEE Conference on Secure and Trustworthy Machine Learning (SaTML) 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13340v1",
      "title": "Link-Aware Energy-Frugal Continual Learning for Fault Detection in IoT Networks",
      "authors": [
        "Henrik C. M. Frederiksen",
        "Junya Shiraishi",
        "Cedomir Stefanovic",
        "Hei Victor Cheng",
        "Shashi Raj Pandey"
      ],
      "abstract": "The use of lightweight machine learning (ML) models in internet of things (IoT) networks enables resource constrained IoT devices to perform on-device inference for several critical applications. However, the inference accuracy deteriorates due to the non-stationarity in the IoT environment and limited initial training data. To counteract this, the deployed models can be updated occasionally with new observed data samples. However, this approach consumes additional energy, which is undesirable for energy constrained IoT devices. This letter introduces an event-driven communication framework that strategically integrates continual learning (CL) in IoT networks for energy-efficient fault detection. Our framework enables the IoT device and the edge server (ES) to collaboratively update the lightweight ML model by adapting to the wireless link conditions for communication and the available energy budget. Evaluation on real-world datasets show that the proposed approach can outperform both periodic sampling and non-adaptive CL in terms of inference recall; our proposed approach achieves up to a 42.8% improvement, even under tight energy and bandwidth constraint.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.NI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13340v1",
        "pdf": "https://arxiv.org/pdf/2512.13340v1"
      },
      "arxiv_id": "2512.13340v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13337v1",
      "title": "FROC: A Unified Framework with Risk-Optimized Control for Machine Unlearning in LLMs",
      "authors": [
        "Si Qi Goh",
        "Yongsen Zheng",
        "Ziyao Liu",
        "Sami Hormi",
        "Kwok-Yan Lam"
      ],
      "abstract": "Machine unlearning (MU) seeks to eliminate the influence of specific training examples from deployed models. As large language models (LLMs) become widely used, managing risks arising from insufficient forgetting or utility loss is increasingly crucial. Current MU techniques lack effective mechanisms for evaluating and controlling these risks, hindering the selection of strategies that appropriately balance safety and utility, and raising trust concerns surrounding the \"right to be forgotten.\" To address these issues, we propose FROC, a unified framework with Risk-Optimized Control for machine unlearning in LLMs. FROC is built around a conformal-style risk-control formulation that expresses a user-specified risk budget on unlearning behavior. This probability-based constraint enables FROC to compare MU strategies, identify feasible operating regions, and guide hyperparameter selection according to desired trade-offs between forgetting sufficiency and utility preservation. To operationalize this constraint, FROC introduces a smoothly varying continuous risk model that aggregates forgetting deficiency and utility degradation into a single configuration-level score. Building on conformal risk analysis, FROC computes (1) the Conformal Unlearning Risk (CUR), a data-driven estimated value on the probability that forgotten samples continue to influence model predictions, and (2) risk-controlled configuration sets, which identify unlearning hyperparameters that are valid under the specified risk budget. Experiments across multiple LLM MU methods demonstrate that FROC produces stable, interpretable risk landscapes and reveals consistent relationships between unlearning configurations, semantic shift, and utility impact. FROC reframes MU as a controllable, risk-aware process and offers a practical foundation for managing unlearning behavior in large-scale LLM deployments.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13337v1",
        "pdf": "https://arxiv.org/pdf/2512.13337v1"
      },
      "arxiv_id": "2512.13337v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13336v1",
      "title": "KD-PINN: Knowledge-Distilled PINNs for ultra-low-latency real-time neural PDE solvers",
      "authors": [
        "Karim Bounja",
        "Lahcen Laayouni",
        "Abdeljalil Sakat"
      ],
      "abstract": "This work introduces Knowledge-Distilled Physics-Informed Neural Networks (KD-PINN), a framework that transfers the predictive accuracy of a high-capacity teacher model to a compact student through a continuous adaptation of the Kullback-Leibler divergence. To confirm its generality for various dynamics and dimensionalities, the framework is evaluated on a representative set of partial differential equations (PDEs). In all tested cases, the student model preserved the teacher's physical accuracy, with a mean RMSE increase below 0.64%, and achieved inference speedups ranging from 4.8x (Navier-Stokes) to 6.9x (Burgers). The distillation process also revealed a regularizing effect. With an average inference latency of 5.3 ms on CPU, the distilled models enter the ultra-low-latency real-time regime defined by sub-10 ms performance. Finally, this study examines how knowledge distillation reduces inference latency in PINNs to contribute to the development of accurate ultra-low-latency neural PDE solvers.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "math.NA"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13336v1",
        "pdf": "https://arxiv.org/pdf/2512.13336v1"
      },
      "arxiv_id": "2512.13336v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13330v1",
      "title": "FIN-bench-v2: A Unified and Robust Benchmark Suite for Evaluating Finnish Large Language Models",
      "authors": [
        "Joona Kytöniemi",
        "Jousia Piha",
        "Akseli Reunamo",
        "Fedor Vitiugin",
        "Farrokh Mehryary",
        "Sampo Pyysalo"
      ],
      "abstract": "We introduce FIN-bench-v2, a unified benchmark suite for evaluating large language models in Finnish. FIN-bench-v2 consolidates Finnish versions of widely used benchmarks together with an updated and expanded version of the original FIN-bench into a single, consistently formatted collection, covering multiple-choice and generative tasks across reading comprehension, commonsense reasoning, sentiment analysis, world knowledge, and alignment. All datasets are converted to HuggingFace Datasets, which include both cloze and multiple-choice prompt formulations with five variants per task, and we incorporate human annotation or review for machine-translated resources such as GoldenSwag and XED. To select robust tasks, we pretrain a set of 2.15B-parameter decoder-only models and use their learning curves to compute monotonicity, signal-to-noise, non-random performance, and model ordering consistency, retaining only tasks that satisfy all criteria. We further evaluate a set of larger instruction-tuned models to characterize performance across tasks and prompt formulations. All datasets, prompts, and evaluation configurations are publicly available via our fork of the Language Model Evaluation Harness at https://github.com/LumiOpen/lm-evaluation-harness. Supplementary resources are released in a separate repository at https://github.com/TurkuNLP/FIN-bench-v2.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13330v1",
        "pdf": "https://arxiv.org/pdf/2512.13330v1"
      },
      "arxiv_id": "2512.13330v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13325v1",
      "title": "Security and Detectability Analysis of Unicode Text Watermarking Methods Against Large Language Models",
      "authors": [
        "Malte Hellmeier"
      ],
      "abstract": "Securing digital text is becoming increasingly relevant due to the widespread use of large language models. Individuals' fear of losing control over data when it is being used to train such machine learning models or when distinguishing model-generated output from text written by humans. Digital watermarking provides additional protection by embedding an invisible watermark within the data that requires protection. However, little work has been taken to analyze and verify if existing digital text watermarking methods are secure and undetectable by large language models. In this paper, we investigate the security-related area of watermarking and machine learning models for text data. In a controlled testbed of three experiments, ten existing Unicode text watermarking methods were implemented and analyzed across six large language models: GPT-5, GPT-4o, Teuken 7B, Llama 3.3, Claude Sonnet 4, and Gemini 2.5 Pro. The findings of our experiments indicate that, especially the latest reasoning models, can detect a watermarked text. Nevertheless, all models fail to extract the watermark unless implementation details in the form of source code are provided. We discuss the implications for security researchers and practitioners and outline future research opportunities to address security concerns.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CR",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13325v1",
        "pdf": "https://arxiv.org/pdf/2512.13325v1"
      },
      "arxiv_id": "2512.13325v1",
      "comment": "Accepted for publication at the ICISSP 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13323v1",
      "title": "Error-Driven Prompt Optimization for Arithmetic Reasoning",
      "authors": [
        "Árpád Pándy",
        "Róbert Lakatos",
        "András Hajdu"
      ],
      "abstract": "Recent advancements in artificial intelligence have sparked interest in industrial agents capable of supporting analysts in regulated sectors, such as finance and healthcare, within tabular data workflows. A key capability for such systems is performing accurate arithmetic operations on structured data while ensuring sensitive information never leaves secure, on-premises environments. Here, we introduce an error-driven optimization framework for arithmetic reasoning that enhances a Code Generation Agent (CGA), specifically applied to on-premises small language models (SLMs). Through a systematic evaluation of a leading SLM (Qwen3 4B), we find that while the base model exhibits fundamental limitations in arithmetic tasks, our proposed error-driven method, which clusters erroneous predictions to refine prompt-rules iteratively, dramatically improves performance, elevating the model's accuracy to 70.8\\%. Our results suggest that developing reliable, interpretable, and industrially deployable AI assistants can be achieved not only through costly fine-tuning but also via systematic, error-driven prompt optimization, enabling small models to surpass larger language models (GPT-3.5 Turbo) in a privacy-compliant manner.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13323v1",
        "pdf": "https://arxiv.org/pdf/2512.13323v1"
      },
      "arxiv_id": "2512.13323v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13317v1",
      "title": "Face Identity Unlearning for Retrieval via Embedding Dispersion",
      "authors": [
        "Mikhail Zakharov"
      ],
      "abstract": "Face recognition systems rely on learning highly discriminative and compact identity clusters to enable accurate retrieval. However, as with other surveillance-oriented technologies, such systems raise serious privacy concerns due to their potential for unauthorized identity tracking. While several works have explored machine unlearning as a means of privacy protection, their applicability to face retrieval - especially for modern embedding-based recognition models - remains largely unexplored. In this work, we study the problem of face identity unlearning for retrieval systems and present its inherent challenges. The goal is to make selected identities unretrievable by dispersing their embeddings on the hypersphere and preventing the formation of compact identity clusters that enable re-identification in the gallery. The primary challenge is to achieve this forgetting effect while preserving the discriminative structure of the embedding space and the retrieval performance of the model for the remaining identities. To address this, we evaluate several existing approximate class unlearning methods (e.g., Random Labeling, Gradient Ascent, Boundary Unlearning, and other recent approaches) in the context of face retrieval and propose a simple yet effective dispersion-based unlearning approach. Extensive experiments on standard benchmarks (VGGFace2, CelebA) demonstrate that our method achieves superior forgetting behavior while preserving retrieval utility.",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13317v1",
        "pdf": "https://arxiv.org/pdf/2512.13317v1"
      },
      "arxiv_id": "2512.13317v1",
      "comment": "12 pages, 1 figure, 5 tables, 10 equations. Preprint",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.13316v1",
      "title": "ALIGN-FL: Architecture-independent Learning through Invariant Generative component sharing in Federated Learning",
      "authors": [
        "Mayank Gulati",
        "Benedikt Groß",
        "Gerhard Wunder"
      ],
      "abstract": "We present ALIGN-FL, a novel approach to distributed learning that addresses the challenge of learning from highly disjoint data distributions through selective sharing of generative components. Instead of exchanging full model parameters, our framework enables privacy-preserving learning by transferring only generative capabilities across clients, while the server performs global training using synthetic samples. Through complementary privacy mechanisms: DP-SGD with adaptive clipping and Lipschitz regularized VAE decoders and a stateful architecture supporting heterogeneous clients, we experimentally validate our approach on MNIST and Fashion-MNIST datasets with cross-domain outliers. Our analysis demonstrates that both privacy mechanisms effectively map sensitive outliers to typical data points while maintaining utility in extreme Non-IID scenarios typical of cross-silo collaborations.\n  Index Terms: Client-invariant Learning, Federated Learning (FL), Privacy-preserving Generative Models, Non-Independent and Identically Distributed (Non-IID), Heterogeneous Architectures",
      "published": "2025-12-15",
      "updated": "2025-12-15",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.13316v1",
        "pdf": "https://arxiv.org/pdf/2512.13316v1"
      },
      "arxiv_id": "2512.13316v1",
      "comment": "Accepted at 2025 International Conference on Cyber-Enabled Distributed Computing and Knowledge Discovery (CyberC)",
      "journal_ref": "",
      "has_code": false
    }
  ]
}