{
  "fetched_at": "2026-01-14T00:27:52.403572",
  "total_papers": 100,
  "papers": [
    {
      "id": "2601.07835v1",
      "title": "SecureCAI: Injection-Resilient LLM Assistants for Cybersecurity Operations",
      "authors": [
        "Mohammed Himayath Ali",
        "Mohammed Aqib Abdullah",
        "Mohammed Mudassir Uddin",
        "Shahnawaz Alam"
      ],
      "abstract": "Large Language Models have emerged as transformative tools for Security Operations Centers, enabling automated log analysis, phishing triage, and malware explanation; however, deployment in adversarial cybersecurity environments exposes critical vulnerabilities to prompt injection attacks where malicious instructions embedded in security artifacts manipulate model behavior. This paper introduces SecureCAI, a novel defense framework extending Constitutional AI principles with security-aware guardrails, adaptive constitution evolution, and Direct Preference Optimization for unlearning unsafe response patterns, addressing the unique challenges of high-stakes security contexts where traditional safety mechanisms prove insufficient against sophisticated adversarial manipulation. Experimental evaluation demonstrates that SecureCAI reduces attack success rates by 94.7% compared to baseline models while maintaining 95.1% accuracy on benign security analysis tasks, with the framework incorporating continuous red-teaming feedback loops enabling dynamic adaptation to emerging attack strategies and achieving constitution adherence scores exceeding 0.92 under sustained adversarial pressure, thereby establishing a foundation for trustworthy integration of language model capabilities into operational cybersecurity workflows and addressing a critical gap in current approaches to AI safety within adversarial domains.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CR",
        "cs.CV"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07835v1",
        "pdf": "https://arxiv.org/pdf/2601.07835v1"
      },
      "arxiv_id": "2601.07835v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07834v1",
      "title": "A Complete Decomposition of Stochastic Differential Equations",
      "authors": [
        "Samuel Duffield"
      ],
      "abstract": "We show that any stochastic differential equation with prescribed time-dependent marginal distributions admits a decomposition into three components: a unique scalar field governing marginal evolution, a symmetric positive-semidefinite diffusion matrix field and a skew-symmetric matrix field.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "math.PR",
        "cs.LG",
        "math.ST"
      ],
      "primary_category": "math.PR",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07834v1",
        "pdf": "https://arxiv.org/pdf/2601.07834v1"
      },
      "arxiv_id": "2601.07834v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07833v1",
      "title": "Tuning-free Visual Effect Transfer across Videos",
      "authors": [
        "Maxwell Jones",
        "Rameen Abdal",
        "Or Patashnik",
        "Ruslan Salakhutdinov",
        "Sergey Tulyakov",
        "Jun-Yan Zhu",
        "Kuan-Chieh Jackson Wang"
      ],
      "abstract": "We present RefVFX, a new framework that transfers complex temporal effects from a reference video onto a target video or image in a feed-forward manner. While existing methods excel at prompt-based or keyframe-conditioned editing, they struggle with dynamic temporal effects such as dynamic lighting changes or character transformations, which are difficult to describe via text or static conditions. Transferring a video effect is challenging, as the model must integrate the new temporal dynamics with the input video's existing motion and appearance. % To address this, we introduce a large-scale dataset of triplets, where each triplet consists of a reference effect video, an input image or video, and a corresponding output video depicting the transferred effect. Creating this data is non-trivial, especially the video-to-video effect triplets, which do not exist naturally. To generate these, we propose a scalable automated pipeline that creates high-quality paired videos designed to preserve the input's motion and structure while transforming it based on some fixed, repeatable effect. We then augment this data with image-to-video effects derived from LoRA adapters and code-based temporal effects generated through programmatic composition. Building on our new dataset, we train our reference-conditioned model using recent text-to-video backbones. Experimental results demonstrate that RefVFX produces visually consistent and temporally coherent edits, generalizes across unseen effect categories, and outperforms prompt-only baselines in both quantitative metrics and human preference. See our website $\\href{https://tuningfreevisualeffects-maker.github.io/Tuning-free-Visual-Effect-Transfer-across-Videos-Project-Page/}{at\\ this\\ URL}$.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07833v1",
        "pdf": "https://arxiv.org/pdf/2601.07833v1"
      },
      "arxiv_id": "2601.07833v1",
      "comment": "Project Page: $\\href{https://tuningfreevisualeffects-maker.github.io/Tuning-free-Visual-Effect-Transfer-across-Videos-Project-Page/}{this\\ URL}$",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2601.07832v1",
      "title": "MHLA: Restoring Expressivity of Linear Attention via Token-Level Multi-Head",
      "authors": [
        "Kewei Zhang",
        "Ye Huang",
        "Yufan Deng",
        "Jincheng Yu",
        "Junsong Chen",
        "Huan Ling",
        "Enze Xie",
        "Daquan Zhou"
      ],
      "abstract": "While the Transformer architecture dominates many fields, its quadratic self-attention complexity hinders its use in large-scale applications. Linear attention offers an efficient alternative, but its direct application often degrades performance, with existing fixes typically re-introducing computational overhead through extra modules (e.g., depthwise separable convolution) that defeat the original purpose. In this work, we identify a key failure mode in these methods: global context collapse, where the model loses representational diversity. To address this, we propose Multi-Head Linear Attention (MHLA), which preserves this diversity by computing attention within divided heads along the token dimension. We prove that MHLA maintains linear complexity while recovering much of the expressive power of softmax attention, and verify its effectiveness across multiple domains, achieving a 3.6\\% improvement on ImageNet classification, a 6.3\\% gain on NLP, a 12.6\\% improvement on image generation, and a 41\\% enhancement on video generation under the same time complexity.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07832v1",
        "pdf": "https://arxiv.org/pdf/2601.07832v1"
      },
      "arxiv_id": "2601.07832v1",
      "comment": "Code: https://github.com/DAGroup-PKU/MHLA/ Project website: https://dagroup-pku.github.io/MHLA/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2601.07830v1",
      "title": "Optimal Learning Rate Schedule for Balancing Effort and Performance",
      "authors": [
        "Valentina Njaradi",
        "Rodrigo Carrasco-Davis",
        "Peter E. Latham",
        "Andrew Saxe"
      ],
      "abstract": "Learning how to learn efficiently is a fundamental challenge for biological agents and a growing concern for artificial ones. To learn effectively, an agent must regulate its learning speed, balancing the benefits of rapid improvement against the costs of effort, instability, or resource use. We introduce a normative framework that formalizes this problem as an optimal control process in which the agent maximizes cumulative performance while incurring a cost of learning. From this objective, we derive a closed-form solution for the optimal learning rate, which has the form of a closed-loop controller that depends only on the agent's current and expected future performance. Under mild assumptions, this solution generalizes across tasks and architectures and reproduces numerically optimized schedules in simulations. In simple learning models, we can mathematically analyze how agent and task parameters shape learning-rate scheduling as an open-loop control solution. Because the optimal policy depends on expectations of future performance, the framework predicts how overconfidence or underconfidence influence engagement and persistence, linking the control of learning speed to theories of self-regulated learning. We further show how a simple episodic memory mechanism can approximate the required performance expectations by recalling similar past learning experiences, providing a biologically plausible route to near-optimal behaviour. Together, these results provide a normative and biologically plausible account of learning speed control, linking self-regulated learning, effort allocation, and episodic memory estimation within a unified and tractable mathematical framework.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.NE",
        "q-bio.NC"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07830v1",
        "pdf": "https://arxiv.org/pdf/2601.07830v1"
      },
      "arxiv_id": "2601.07830v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07821v1",
      "title": "Failure-Aware RL: Reliable Offline-to-Online Reinforcement Learning with Self-Recovery for Real-World Manipulation",
      "authors": [
        "Huanyu Li",
        "Kun Lei",
        "Sheng Zang",
        "Kaizhe Hu",
        "Yongyuan Liang",
        "Bo An",
        "Xiaoli Li",
        "Huazhe Xu"
      ],
      "abstract": "Post-training algorithms based on deep reinforcement learning can push the limits of robotic models for specific objectives, such as generalizability, accuracy, and robustness. However, Intervention-requiring Failures (IR Failures) (e.g., a robot spilling water or breaking fragile glass) during real-world exploration happen inevitably, hindering the practical deployment of such a paradigm. To tackle this, we introduce Failure-Aware Offline-to-Online Reinforcement Learning (FARL), a new paradigm minimizing failures during real-world reinforcement learning. We create FailureBench, a benchmark that incorporates common failure scenarios requiring human intervention, and propose an algorithm that integrates a world-model-based safety critic and a recovery policy trained offline to prevent failures during online exploration. Extensive simulation and real-world experiments demonstrate the effectiveness of FARL in significantly reducing IR Failures while improving performance and generalization during online reinforcement learning post-training. FARL reduces IR Failures by 73.1% while elevating performance by 11.3% on average during real-world RL post-training. Videos and code are available at https://failure-aware-rl.github.io.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07821v1",
        "pdf": "https://arxiv.org/pdf/2601.07821v1"
      },
      "arxiv_id": "2601.07821v1",
      "comment": "Project page: https://failure-aware-rl.github.io",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2601.07812v1",
      "title": "More Images, More Problems? A Controlled Analysis of VLM Failure Modes",
      "authors": [
        "Anurag Das",
        "Adrian Bulat",
        "Alberto Baldrati",
        "Ioannis Maniadis Metaxas",
        "Bernt Schiele",
        "Georgios Tzimiropoulos",
        "Brais Martinez"
      ],
      "abstract": "Large Vision Language Models (LVLMs) have demonstrated remarkable capabilities, yet their proficiency in understanding and reasoning over multiple images remains largely unexplored. While existing benchmarks have initiated the evaluation of multi-image models, a comprehensive analysis of their core weaknesses and their causes is still lacking. In this work, we introduce MIMIC (Multi-Image Model Insights and Challenges), a new benchmark designed to rigorously evaluate the multi-image capabilities of LVLMs. Using MIMIC, we conduct a series of diagnostic experiments that reveal pervasive issues: LVLMs often fail to aggregate information across images and struggle to track or attend to multiple concepts simultaneously. To address these failures, we propose two novel complementary remedies. On the data side, we present a procedural data-generation strategy that composes single-image annotations into rich, targeted multi-image training examples. On the optimization side, we analyze layer-wise attention patterns and derive an attention-masking scheme tailored for multi-image inputs. Experiments substantially improved cross-image aggregation, while also enhancing performance on existing multi-image benchmarks, outperforming prior state of the art across tasks. Data and code will be made available at https://github.com/anurag-198/MIMIC.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07812v1",
        "pdf": "https://arxiv.org/pdf/2601.07812v1"
      },
      "arxiv_id": "2601.07812v1",
      "comment": "19 pages, 16 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07806v1",
      "title": "The Confidence Trap: Gender Bias and Predictive Certainty in LLMs",
      "authors": [
        "Ahmed Sabir",
        "Markus Kängsepp",
        "Rajesh Sharma"
      ],
      "abstract": "The increased use of Large Language Models (LLMs) in sensitive domains leads to growing interest in how their confidence scores correspond to fairness and bias. This study examines the alignment between LLM-predicted confidence and human-annotated bias judgments. Focusing on gender bias, the research investigates probability confidence calibration in contexts involving gendered pronoun resolution. The goal is to evaluate if calibration metrics based on predicted confidence scores effectively capture fairness-related disparities in LLMs. The results show that, among the six state-of-the-art models, Gemma-2 demonstrates the worst calibration according to the gender bias benchmark. The primary contribution of this work is a fairness-aware evaluation of LLMs' confidence calibration, offering guidance for ethical deployment. In addition, we introduce a new calibration metric, Gender-ECE, designed to measure gender disparities in resolution tasks.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07806v1",
        "pdf": "https://arxiv.org/pdf/2601.07806v1"
      },
      "arxiv_id": "2601.07806v1",
      "comment": "AAAI 2026 (AISI Track), Oral. Project page: https://bit.ly/4p8OKQD",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07805v1",
      "title": "Exchange Is All You Need for Remote Sensing Change Detection",
      "authors": [
        "Sijun Dong",
        "Siming Fu",
        "Kaiyu Li",
        "Xiangyong Cao",
        "Xiaoliang Meng",
        "Bo Du"
      ],
      "abstract": "Remote sensing change detection fundamentally relies on the effective fusion and discrimination of bi-temporal features. Prevailing paradigms typically utilize Siamese encoders bridged by explicit difference computation modules, such as subtraction or concatenation, to identify changes. In this work, we challenge this complexity with SEED (Siamese Encoder-Exchange-Decoder), a streamlined paradigm that replaces explicit differencing with parameter-free feature exchange. By sharing weights across both Siamese encoders and decoders, SEED effectively operates as a single parameter set model. Theoretically, we formalize feature exchange as an orthogonal permutation operator and prove that, under pixel consistency, this mechanism preserves mutual information and Bayes optimal risk, whereas common arithmetic fusion methods often introduce information loss. Extensive experiments across five benchmarks, including SYSU-CD, LEVIR-CD, PX-CLCD, WaterCD, and CDD, and three backbones, namely SwinT, EfficientNet, and ResNet, demonstrate that SEED matches or surpasses state of the art methods despite its simplicity. Furthermore, we reveal that standard semantic segmentation models can be transformed into competitive change detectors solely by inserting this exchange mechanism, referred to as SEG2CD. The proposed paradigm offers a robust, unified, and interpretable framework for change detection, demonstrating that simple feature exchange is sufficient for high performance information fusion. Code and full training and evaluation protocols will be released at https://github.com/dyzy41/open-rscd.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07805v1",
        "pdf": "https://arxiv.org/pdf/2601.07805v1"
      },
      "arxiv_id": "2601.07805v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07795v1",
      "title": "Vision-Language Model for Accurate Crater Detection",
      "authors": [
        "Patrick Bauer",
        "Marius Schwinning",
        "Florian Renk",
        "Andreas Weinmann",
        "Hichem Snoussi"
      ],
      "abstract": "The European Space Agency (ESA), driven by its ambitions on planned lunar missions with the Argonaut lander, has a profound interest in reliable crater detection, since craters pose a risk to safe lunar landings. This task is usually addressed with automated crater detection algorithms (CDA) based on deep learning techniques. It is non-trivial due to the vast amount of craters of various sizes and shapes, as well as challenging conditions such as varying illumination and rugged terrain. Therefore, we propose a deep-learning CDA based on the OWLv2 model, which is built on a Vision Transformer, that has proven highly effective in various computer vision tasks. For fine-tuning, we utilize a manually labeled dataset fom the IMPACT project, that provides crater annotations on high-resolution Lunar Reconnaissance Orbiter Camera Calibrated Data Record images. We insert trainable parameters using a parameter-efficient fine-tuning strategy with Low-Rank Adaptation, and optimize a combined loss function consisting of Complete Intersection over Union (CIoU) for localization and a contrastive loss for classification. We achieve satisfactory visual results, along with a maximum recall of 94.0% and a maximum precision of 73.1% on a test dataset from IMPACT. Our method achieves reliable crater detection across challenging lunar imaging conditions, paving the way for robust crater analysis in future lunar exploration.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07795v1",
        "pdf": "https://arxiv.org/pdf/2601.07795v1"
      },
      "arxiv_id": "2601.07795v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07794v1",
      "title": "Kinship Data Benchmark for Multi-hop Reasoning",
      "authors": [
        "Tianda Sun",
        "Dimitar Kazakov"
      ],
      "abstract": "Large language models (LLMs) are increasingly evaluated on their ability to perform multi-hop reasoning, i.e., to combine multiple pieces of information into a coherent inference. We introduce KinshipQA, a benchmark designed to probe this capability through reasoning over kinship relations. The central contribution of our work is a generative pipeline that produces, on demand, large-scale, realistic, and culture-specific genealogical data: collections of interconnected family trees that satisfy explicit marriage constraints associated with different kinship systems. This allows task difficulty, cultural assumptions, and relational depth to be systematically controlled and varied. From these genealogies, we derive textual inference tasks that require reasoning over implicit relational chains. We evaluate the resulting benchmark using six state-of-the-art LLMs, spanning both open-source and closed-source models, under a uniform zero-shot protocol with deterministic decoding. Performance is measured using exact-match and set-based metrics. Our results demonstrate that KinshipQA yields a wide spread of outcomes and exposes systematic differences in multi-hop reasoning across models and cultural settings.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07794v1",
        "pdf": "https://arxiv.org/pdf/2601.07794v1"
      },
      "arxiv_id": "2601.07794v1",
      "comment": "11 pages, 2 figures, 9 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07790v1",
      "title": "Benchmarking Small Language Models and Small Reasoning Language Models on System Log Severity Classification",
      "authors": [
        "Yahya Masri",
        "Emily Ma",
        "Zifu Wang",
        "Joseph Rogers",
        "Chaowei Yang"
      ],
      "abstract": "System logs are crucial for monitoring and diagnosing modern computing infrastructure, but their scale and complexity require reliable and efficient automated interpretation. Since severity levels are predefined metadata in system log messages, having a model merely classify them offers limited standalone practical value, revealing little about its underlying ability to interpret system logs. We argue that severity classification is more informative when treated as a benchmark for probing runtime log comprehension rather than as an end task. Using real-world journalctl data from Linux production servers, we evaluate nine small language models (SLMs) and small reasoning language models (SRLMs) under zero-shot, few-shot, and retrieval-augmented generation (RAG) prompting. The results reveal strong stratification. Qwen3-4B achieves the highest accuracy at 95.64% with RAG, while Gemma3-1B improves from 20.25% under few-shot prompting to 85.28% with RAG. Notably, the tiny Qwen3-0.6B reaches 88.12% accuracy despite weak performance without retrieval. In contrast, several SRLMs, including Qwen3-1.7B and DeepSeek-R1-Distill-Qwen-1.5B, degrade substantially when paired with RAG. Efficiency measurements further separate models: most Gemma and Llama variants complete inference in under 1.2 seconds per log, whereas Phi-4-Mini-Reasoning exceeds 228 seconds per log while achieving <10% accuracy. These findings suggest that (1) architectural design, (2) training objectives, and (3) the ability to integrate retrieved context under strict output constraints jointly determine performance. By emphasizing small, deployable models, this benchmark aligns with real-time requirements of digital twin (DT) systems and shows that severity classification serves as a lens for evaluating model competence and real-time deployability, with implications for root cause analysis (RCA) and broader DT integration.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07790v1",
        "pdf": "https://arxiv.org/pdf/2601.07790v1"
      },
      "arxiv_id": "2601.07790v1",
      "comment": "28 pages, 5 figures, 7 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07782v1",
      "title": "Beyond Single-Shot: Multi-step Tool Retrieval via Query Planning",
      "authors": [
        "Wei Fang",
        "James Glass"
      ],
      "abstract": "LLM agents operating over massive, dynamic tool libraries rely on effective retrieval, yet standard single-shot dense retrievers struggle with complex requests. These failures primarily stem from the disconnect between abstract user goals and technical documentation, and the limited capacity of fixed-size embeddings to model combinatorial tool compositions. To address these challenges, we propose TOOLQP, a lightweight framework that models retrieval as iterative query planning. Instead of single-shot matching, TOOLQP decomposes instructions into sub-tasks and dynamically generates queries to interact with the retriever, effectively bridging the semantic gap by targeting the specific sub-tasks required for composition. We train TOOLQP using synthetic query trajectories followed by optimization via Reinforcement Learning with Verifiable Rewards (RLVR). Experiments demonstrate that TOOLQP achieves state-of-the-art performance, exhibiting superior zero-shot generalization, robustness across diverse retrievers, and significant improvements in downstream agentic execution.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.IR"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07782v1",
        "pdf": "https://arxiv.org/pdf/2601.07782v1"
      },
      "arxiv_id": "2601.07782v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07779v1",
      "title": "OS-Symphony: A Holistic Framework for Robust and Generalist Computer-Using Agent",
      "authors": [
        "Bowen Yang",
        "Kaiming Jin",
        "Zhenyu Wu",
        "Zhaoyang Liu",
        "Qiushi Sun",
        "Zehao Li",
        "JingJing Xie",
        "Zhoumianze Liu",
        "Fangzhi Xu",
        "Kanzhi Cheng",
        "Qingyun Li",
        "Yian Wang",
        "Yu Qiao",
        "Zun Wang",
        "Zichen Ding"
      ],
      "abstract": "While Vision-Language Models (VLMs) have significantly advanced Computer-Using Agents (CUAs), current frameworks struggle with robustness in long-horizon workflows and generalization in novel domains. These limitations stem from a lack of granular control over historical visual context curation and the absence of visual-aware tutorial retrieval. To bridge these gaps, we introduce OS-Symphony, a holistic framework that comprises an Orchestrator coordinating two key innovations for robust automation: (1) a Reflection-Memory Agent that utilizes milestone-driven long-term memory to enable trajectory-level self-correction, effectively mitigating visual context loss in long-horizon tasks; (2) Versatile Tool Agents featuring a Multimodal Searcher that adopts a SeeAct paradigm to navigate a browser-based sandbox to synthesize live, visually aligned tutorials, thereby resolving fidelity issues in unseen scenarios. Experimental results demonstrate that OS-Symphony delivers substantial performance gains across varying model scales, establishing new state-of-the-art results on three online benchmarks, notably achieving 65.84% on OSWorld.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.MA",
        "cs.AI",
        "cs.CL",
        "cs.CV",
        "cs.HC"
      ],
      "primary_category": "cs.MA",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07779v1",
        "pdf": "https://arxiv.org/pdf/2601.07779v1"
      },
      "arxiv_id": "2601.07779v1",
      "comment": "31 pages, 11 figures, 12 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07778v1",
      "title": "DT-ICU: Towards Explainable Digital Twins for ICU Patient Monitoring via Multi-Modal and Multi-Task Iterative Inference",
      "authors": [
        "Wen Guo"
      ],
      "abstract": "We introduce DT-ICU, a multimodal digital twin framework for continuous risk estimation in intensive care. DT-ICU integrates variable-length clinical time series with static patient information in a unified multitask architecture, enabling predictions to be updated as new observations accumulate over the ICU stay. We evaluate DT-ICU on the large, publicly available MIMIC-IV dataset, where it consistently outperforms established baseline models under different evaluation settings. Our test-length analysis shows that meaningful discrimination is achieved shortly after admission, while longer observation windows further improve the ranking of high-risk patients in highly imbalanced cohorts. To examine how the model leverages heterogeneous data sources, we perform systematic modality ablations, revealing that the model learnt a reasonable structured reliance on interventions, physiological response observations, and contextual information. These analyses provide interpretable insights into how multimodal signals are combined and how trade-offs between sensitivity and precision emerge. Together, these results demonstrate that DT-ICU delivers accurate, temporally robust, and interpretable predictions, supporting its potential as a practical digital twin framework for continuous patient monitoring in critical care. The source code and trained model weights for DT-ICU are publicly available at https://github.com/GUO-W/DT-ICU-release.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07778v1",
        "pdf": "https://arxiv.org/pdf/2601.07778v1"
      },
      "arxiv_id": "2601.07778v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07773v1",
      "title": "Beyond External Guidance: Unleashing the Semantic Richness Inside Diffusion Transformers for Improved Training",
      "authors": [
        "Lingchen Sun",
        "Rongyuan Wu",
        "Zhengqiang Zhang",
        "Ruibin Li",
        "Yujing Sun",
        "Shuaizheng Liu",
        "Lei Zhang"
      ],
      "abstract": "Recent works such as REPA have shown that guiding diffusion models with external semantic features (e.g., DINO) can significantly accelerate the training of diffusion transformers (DiTs). However, this requires the use of pretrained external networks, introducing additional dependencies and reducing flexibility. In this work, we argue that DiTs actually have the power to guide the training of themselves, and propose \\textbf{Self-Transcendence}, a simple yet effective method that achieves fast convergence using internal feature supervision only. It is found that the slow convergence in DiT training primarily stems from the difficulty of representation learning in shallow layers. To address this, we initially train the DiT model by aligning its shallow features with the latent representations from the pretrained VAE for a short phase (e.g., 40 epochs), then apply classifier-free guidance to the intermediate features, enhancing their discriminative capability and semantic expressiveness. These enriched internal features, learned entirely within the model, are used as supervision signals to guide a new DiT training. Compared to existing self-contained methods, our approach brings a significant performance boost. It can even surpass REPA in terms of generation quality and convergence speed, but without the need for any external pretrained models. Our method is not only more flexible for different backbones but also has the potential to be adopted for a wider range of diffusion-based generative tasks. The source code of our method can be found at https://github.com/csslc/Self-Transcendence.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07773v1",
        "pdf": "https://arxiv.org/pdf/2601.07773v1"
      },
      "arxiv_id": "2601.07773v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07767v1",
      "title": "Are LLM Decisions Faithful to Verbal Confidence?",
      "authors": [
        "Jiawei Wang",
        "Yanfei Zhou",
        "Siddartha Devic",
        "Deqing Fu"
      ],
      "abstract": "Large Language Models (LLMs) can produce surprisingly sophisticated estimates of their own uncertainty. However, it remains unclear to what extent this expressed confidence is tied to the reasoning, knowledge, or decision making of the model. To test this, we introduce $\\textbf{RiskEval}$: a framework designed to evaluate whether models adjust their abstention policies in response to varying error penalties. Our evaluation of several frontier models reveals a critical dissociation: models are neither cost-aware when articulating their verbal confidence, nor strategically responsive when deciding whether to engage or abstain under high-penalty conditions. Even when extreme penalties render frequent abstention the mathematically optimal strategy, models almost never abstain, resulting in utility collapse. This indicates that calibrated verbal confidence scores may not be sufficient to create trustworthy and interpretable AI systems, as current models lack the strategic agency to convert uncertainty signals into optimal and risk-sensitive decisions.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.CL"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07767v1",
        "pdf": "https://arxiv.org/pdf/2601.07767v1"
      },
      "arxiv_id": "2601.07767v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07761v1",
      "title": "Video Evidence to Reasoning Efficient Video Understanding via Explicit Evidence Grounding",
      "authors": [
        "Yanxiang Huang",
        "Guohua Gao",
        "Zhaoyang Wei",
        "Jianyuan Ni"
      ],
      "abstract": "Large Vision-Language Models (LVLMs) face a fundamental dilemma in video reasoning: they are caught between the prohibitive computational costs of verbose reasoning and the hallucination risks of efficient, ungrounded approaches. To resolve this, we introduce the Chain of Evidence (CoE), a novel framework that architecturally decouples and co-optimizes perceptual grounding and reasoning efficiency. CoE incorporates two core innovations: (1) A lightweight Evidence Grounding Module (EGM) that acts as a query-guided filter, dynamically identifying and extracting a compact set of high-fidelity visual evidence; and (2) An Evidence-Anchoring Protocol optimized via Reinforcement Learning. Crucially, we design a composite reward mechanism that enforces process alignment, compelling the model to strictly reference identified temporal anchors during deduction, thereby mitigating hallucinations. To enable this, we construct CoE-Instruct, a large-scale dataset (164k samples) featuring a novel dual-annotation schema for separate perception and reasoning supervision. Extensive experiments on five benchmarks, including Video-MME, MVBench, and VSI-Bench, demonstrate that CoE-enhanced models establish a new state-of-the-art. They significantly outperform existing methods in accuracy, proving CoE to be a powerful and practical paradigm for reliable video understanding.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07761v1",
        "pdf": "https://arxiv.org/pdf/2601.07761v1"
      },
      "arxiv_id": "2601.07761v1",
      "comment": "6 pages",
      "journal_ref": "ICME 2026",
      "has_code": false
    },
    {
      "id": "2601.07760v1",
      "title": "Free-RBF-KAN: Kolmogorov-Arnold Networks with Adaptive Radial Basis Functions for Efficient Function Learning",
      "authors": [
        "Shao-Ting Chiu",
        "Siu Wun Cheung",
        "Ulisses Braga-Neto",
        "Chak Shing Lee",
        "Rui Peng Li"
      ],
      "abstract": "Kolmogorov-Arnold Networks (KANs) have shown strong potential for efficiently approximating complex nonlinear functions. However, the original KAN formulation relies on B-spline basis functions, which incur substantial computational overhead due to De Boor's algorithm. To address this limitation, recent work has explored alternative basis functions such as radial basis functions (RBFs) that can improve computational efficiency and flexibility. Yet, standard RBF-KANs often sacrifice accuracy relative to the original KAN design. In this work, we propose Free-RBF-KAN, a RBF-based KAN architecture that incorporates adaptive learning grids and trainable smoothness to close this performance gap. Our method employs freely learnable RBF shapes that dynamically align grid representations with activation patterns, enabling expressive and adaptive function approximation. Additionally, we treat smoothness as a kernel parameter optimized jointly with network weights, without increasing computational complexity. We provide a general universality proof for RBF-KANs, which encompasses our Free-RBF-KAN formulation. Through a broad set of experiments, including multiscale function approximation, physics-informed machine learning, and PDE solution operator learning, Free-RBF-KAN achieves accuracy comparable to the original B-spline-based KAN while delivering faster training and inference. These results highlight Free-RBF-KAN as a compelling balance between computational efficiency and adaptive resolution, particularly for high-dimensional structured modeling tasks.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "math.NA"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07760v1",
        "pdf": "https://arxiv.org/pdf/2601.07760v1"
      },
      "arxiv_id": "2601.07760v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07756v1",
      "title": "Learning to bin: differentiable and Bayesian optimization for multi-dimensional discriminants in high-energy physics",
      "authors": [
        "Johannes Erdmann",
        "Nitish Kumar Kasaraguppe",
        "Florian Mausolf"
      ],
      "abstract": "Categorizing events using discriminant observables is central to many high-energy physics analyses. Yet, bin boundaries are often chosen by hand. A simple, popular choice is to apply argmax projections of multi-class scores and equidistant binning of one-dimensional discriminants. We propose a binning optimization for signal significance directly in multi-dimensional discriminants. We use a Gaussian Mixture Model (GMM) to define flexible bin boundary shapes for multi-class scores, while in one dimension (binary classification) we move bin boundaries directly. On this binning model, we study two optimization strategies: a differentiable and a Bayesian optimization approach. We study two toy setups: a binary classification and a three-class problem with two signals and backgrounds. In the one-dimensional case, both approaches achieve similar gains in signal sensitivity compared to equidistant binnings for a given number of bins. In the multi-dimensional case, the GMM-based binning defines sensitive categories as well, with the differentiable approach performing best. We show that, in particular for limited separability of the signal processes, our approach outperforms argmax classification even with optimized binning in the one-dimensional projections. Both methods are released as lightweight Python plugins intended for straightforward integration into existing analyses.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "physics.data-an",
        "cs.LG",
        "hep-ex"
      ],
      "primary_category": "physics.data-an",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07756v1",
        "pdf": "https://arxiv.org/pdf/2601.07756v1"
      },
      "arxiv_id": "2601.07756v1",
      "comment": "13 pages, 5 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07752v1",
      "title": "Riesz Representer Fitting under Bregman Divergence: A Unified Framework for Debiased Machine Learning",
      "authors": [
        "Masahiro Kato"
      ],
      "abstract": "Estimating the Riesz representer is a central problem in debiased machine learning for causal and structural parameter estimation. Various methods for Riesz representer estimation have been proposed, including Riesz regression and covariate balancing. This study unifies these methods within a single framework. Our framework fits a Riesz representer model to the true Riesz representer under a Bregman divergence, which includes the squared loss and the Kullback--Leibler (KL) divergence as special cases. We show that the squared loss corresponds to Riesz regression, and the KL divergence corresponds to tailored loss minimization, where the dual solutions correspond to stable balancing weights and entropy balancing weights, respectively, under specific model specifications. We refer to our method as generalized Riesz regression, and we refer to the associated duality as automatic covariate balancing. Our framework also generalizes density ratio fitting under a Bregman divergence to Riesz representer estimation, and it includes various applications beyond density ratio estimation. We also provide a convergence analysis for both cases where the model class is a reproducing kernel Hilbert space (RKHS) and where it is a neural network.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "econ.EM",
        "cs.LG",
        "math.ST",
        "stat.ME",
        "stat.ML"
      ],
      "primary_category": "econ.EM",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07752v1",
        "pdf": "https://arxiv.org/pdf/2601.07752v1"
      },
      "arxiv_id": "2601.07752v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07749v1",
      "title": "On the application of the Wasserstein metric to 2D curves classification",
      "authors": [
        "Agnieszka Kaliszewska",
        "Monika Syga"
      ],
      "abstract": "In this work we analyse a number of variants of the Wasserstein distance which allow to focus the classification on the prescribed parts (fragments) of classified 2D curves. These variants are based on the use of a number of discrete probability measures which reflect the importance of given fragments of curves. The performance of this approach is tested through a series of experiments related to the clustering analysis of 2D curves performed on data coming from the field of archaeology.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07749v1",
        "pdf": "https://arxiv.org/pdf/2601.07749v1"
      },
      "arxiv_id": "2601.07749v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07748v1",
      "title": "Improving Domain Generalization in Contrastive Learning using Adaptive Temperature Control",
      "authors": [
        "Robert Lewis",
        "Katie Matton",
        "Rosalind W. Picard",
        "John Guttag"
      ],
      "abstract": "Self-supervised pre-training with contrastive learning is a powerful method for learning from sparsely labeled data. However, performance can drop considerably when there is a shift in the distribution of data from training to test time. We study this phenomenon in a setting in which the training data come from multiple domains, and the test data come from a domain not seen at training that is subject to significant covariate shift. We present a new method for contrastive learning that incorporates domain labels to increase the domain invariance of learned representations, leading to improved out-of-distribution generalization. Our method adjusts the temperature parameter in the InfoNCE loss -- which controls the relative weighting of negative pairs -- using the probability that a negative sample comes from the same domain as the anchor. This upweights pairs from more similar domains, encouraging the model to discriminate samples based on domain-invariant attributes. Through experiments on a variant of the MNIST dataset, we demonstrate that our method yields better out-of-distribution performance than domain generalization baselines. Furthermore, our method maintains strong in-distribution task performance, substantially outperforming baselines on this measure.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07748v1",
        "pdf": "https://arxiv.org/pdf/2601.07748v1"
      },
      "arxiv_id": "2601.07748v1",
      "comment": "NeurIPS SSL Workshop 2023",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07742v1",
      "title": "PFT: Phonon Fine-tuning for Machine Learned Interatomic Potentials",
      "authors": [
        "Teddy Koker",
        "Abhijeet Gangan",
        "Mit Kotak",
        "Jaime Marian",
        "Tess Smidt"
      ],
      "abstract": "Many materials properties depend on higher-order derivatives of the potential energy surface, yet machine learned interatomic potentials (MLIPs) trained with standard a standard loss on energy, force, and stress errors can exhibit error in curvature, degrading the prediction of vibrational properties. We introduce phonon fine-tuning (PFT), which directly supervises second-order force constants of materials by matching MLIP energy Hessians to DFT-computed force constants from finite displacement phonon calculations. To scale to large supercells, PFT stochastically samples Hessian columns and computes the loss with a single Hessian-vector product. We also use a simple co-training scheme to incorporate upstream data to mitigate catastrophic forgetting. On the MDR Phonon benchmark, PFT improves Nequix MP (trained on Materials Project) by 55% on average across phonon thermodynamic properties and achieves state-of-the-art performance among models trained on Materials Project trajectories. PFT also generalizes to improve properties beyond second-derivatives, improving thermal conductivity predictions that rely on third-order derivatives of the potential energy.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cond-mat.mtrl-sci",
        "cs.LG"
      ],
      "primary_category": "cond-mat.mtrl-sci",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07742v1",
        "pdf": "https://arxiv.org/pdf/2601.07742v1"
      },
      "arxiv_id": "2601.07742v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07737v1",
      "title": "Evaluating the encoding competence of visual language models using uncommon actions",
      "authors": [
        "Chen Ling",
        "Nai Ding"
      ],
      "abstract": "We propose UAIT (Uncommon-sense Action Image-Text) dataset, a new evaluation benchmark designed to test the semantic understanding ability of visual language models (VLMs) in uncommon-sense action scenes. Unlike previous datasets that focus on common visual scenes with statistical frequency advantages, UAIT challenges models with grammatically reasonable but semantically counter-common sense image-text pairs. Such tasks require models to go beyond superficial pattern recognition and demonstrate a deep understanding of agent-patient relationships and physical feasibility. To build UAIT, we designed a semi-automated process to synthesize high-quality uncommon-sense image-text samples using large language models, few-shot prompt engineering, and text-to-image generation. Each sample is accompanied by a carefully designed multiple-choice question to test the model's competence in fine-grained reasoning. We evaluate multiple state-of-the-art visual language models and compare them with models based on contrastive learning. Experiments show that all models perform significantly worse than humans in semantic judgment, especially in distinguishing grammatical correctness from semantic rationality. Further experiments show that even the lightweight model can improve its accuracy after fine-tuning, demonstrating the great potential of directional adaptation. This study not only reveals the key weaknesses of VLMs, but also provides diagnostic tools and research directions for the development of robust models with real visual semantic reasoning capabilities.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07737v1",
        "pdf": "https://arxiv.org/pdf/2601.07737v1"
      },
      "arxiv_id": "2601.07737v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07733v1",
      "title": "Backward Reconstruction of the Chafee--Infante Equation via Physics-Informed WGAN-GP",
      "authors": [
        "Joseph L. Shomberg"
      ],
      "abstract": "We present a physics-informed Wasserstein GAN with gradient penalty (WGAN-GP) for solving the inverse Chafee--Infante problem on two-dimensional domains with Dirichlet boundary conditions. The objective is to reconstruct an unknown initial condition from a near-equilibrium state obtained after 100 explicit forward Euler iterations of the reaction-diffusion equation \\[ u_t - γΔu + κ\\left(u^3 - u\\right)=0. \\] Because this mapping strongly damps high-frequency content, the inverse problem is severely ill-posed and sensitive to noise.\n  Our approach integrates a U-Net generator, a PatchGAN critic with spectral normalization, Wasserstein loss with gradient penalty, and several physics-informed auxiliary terms, including Lyapunov energy matching, distributional statistics, and a crucial forward-simulation penalty. This penalty enforces consistency between the predicted initial condition and its forward evolution under the \\emph{same} forward Euler discretization used for dataset generation. Earlier experiments employing an Eyre-type semi-implicit solver were not compatible with this residual mechanism due to the cost and instability of Newton iterations within batched GPU training.\n  On a dataset of 50k training and 10k testing pairs on $128\\times128$ grids (with natural $[-1,1]$ amplitude scaling), the best trained model attains a mean absolute error (MAE) of approximately \\textbf{0.23988159} on the full test set, with a sample-wise standard deviation of about \\textbf{0.00266345}. The results demonstrate stable inversion, accurate recovery of interfacial structure, and robustness to high-frequency noise in the initial data.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "math.AP",
        "cs.LG"
      ],
      "primary_category": "math.AP",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07733v1",
        "pdf": "https://arxiv.org/pdf/2601.07733v1"
      },
      "arxiv_id": "2601.07733v1",
      "comment": "5 pages, 9 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07723v1",
      "title": "FMAC: a Fair Fiducial Marker Accuracy Comparison Software",
      "authors": [
        "Guillaume J. Laurent",
        "Patrick Sandoz"
      ],
      "abstract": "This paper presents a method for carrying fair comparisons of the accuracy of pose estimation using fiducial markers. These comparisons rely on large sets of high-fidelity synthetic images enabling deep exploration of the 6 degrees of freedom. A low-discrepancy sampling of the space allows to check the correlations between each degree of freedom and the pose errors by plotting the 36 pairs of combinations. The images are rendered using a physically based ray tracing code that has been specifically developed to use the standard calibration coefficients of any camera directly. The software reproduces image distortions, defocus and diffraction blur. Furthermore, sub-pixel sampling is applied to sharp edges to enhance the fidelity of the rendered image. After introducing the rendering algorithm and its experimental validation, the paper proposes a method for evaluating the pose accuracy. This method is applied to well-known markers, revealing their strengths and weaknesses for pose estimation. The code is open source and available on GitHub.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV",
        "cs.RO"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07723v1",
        "pdf": "https://arxiv.org/pdf/2601.07723v1"
      },
      "arxiv_id": "2601.07723v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07718v1",
      "title": "Hiking in the Wild: A Scalable Perceptive Parkour Framework for Humanoids",
      "authors": [
        "Shaoting Zhu",
        "Ziwen Zhuang",
        "Mengjie Zhao",
        "Kun-Ying Lee",
        "Hang Zhao"
      ],
      "abstract": "Achieving robust humanoid hiking in complex, unstructured environments requires transitioning from reactive proprioception to proactive perception. However, integrating exteroception remains a significant challenge: mapping-based methods suffer from state estimation drift; for instance, LiDAR-based methods do not handle torso jitter well. Existing end-to-end approaches often struggle with scalability and training complexity; specifically, some previous works using virtual obstacles are implemented case-by-case. In this work, we present \\textit{Hiking in the Wild}, a scalable, end-to-end parkour perceptive framework designed for robust humanoid hiking. To ensure safety and training stability, we introduce two key mechanisms: a foothold safety mechanism combining scalable \\textit{Terrain Edge Detection} with \\textit{Foot Volume Points} to prevent catastrophic slippage on edges, and a \\textit{Flat Patch Sampling} strategy that mitigates reward hacking by generating feasible navigation targets. Our approach utilizes a single-stage reinforcement learning scheme, mapping raw depth inputs and proprioception directly to joint actions, without relying on external state estimation. Extensive field experiments on a full-size humanoid demonstrate that our policy enables robust traversal of complex terrains at speeds up to 2.5 m/s. The training and deployment code is open-sourced to facilitate reproducible research and deployment on real robots with minimal hardware modifications.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07718v1",
        "pdf": "https://arxiv.org/pdf/2601.07718v1"
      },
      "arxiv_id": "2601.07718v1",
      "comment": "Project Page: https://project-instinct.github.io/hiking-in-the-wild",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2601.07701v1",
      "title": "Deep Whole-body Parkour",
      "authors": [
        "Ziwen Zhuang",
        "Shaoting Zhu",
        "Mengjie Zhao",
        "Hang Zhao"
      ],
      "abstract": "Current approaches to humanoid control generally fall into two paradigms: perceptive locomotion, which handles terrain well but is limited to pedal gaits, and general motion tracking, which reproduces complex skills but ignores environmental capabilities. This work unites these paradigms to achieve perceptive general motion control. We present a framework where exteroceptive sensing is integrated into whole-body motion tracking, permitting a humanoid to perform highly dynamic, non-locomotion tasks on uneven terrain. By training a single policy to perform multiple distinct motions across varied terrestrial features, we demonstrate the non-trivial benefit of integrating perception into the control loop. Our results show that this framework enables robust, highly dynamic multi-contact motions, such as vaulting and dive-rolling, on unstructured terrain, significantly expanding the robot's traversability beyond simple walking or running. https://project-instinct.github.io/deep-whole-body-parkour",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07701v1",
        "pdf": "https://arxiv.org/pdf/2601.07701v1"
      },
      "arxiv_id": "2601.07701v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07700v1",
      "title": "Hidden Monotonicity: Explaining Deep Neural Networks via their DC Decomposition",
      "authors": [
        "Jakob Paul Zimmermann",
        "Georg Loho"
      ],
      "abstract": "It has been demonstrated in various contexts that monotonicity leads to better explainability in neural networks. However, not every function can be well approximated by a monotone neural network. We demonstrate that monotonicity can still be used in two ways to boost explainability. First, we use an adaptation of the decomposition of a trained ReLU network into two monotone and convex parts, thereby overcoming numerical obstacles from an inherent blowup of the weights in this procedure. Our proposed saliency methods -- SplitCAM and SplitLRP -- improve on state of the art results on both VGG16 and Resnet18 networks on ImageNet-S across all Quantus saliency metric categories. Second, we exhibit that training a model as the difference between two monotone neural networks results in a system with strong self-explainability properties.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07700v1",
        "pdf": "https://arxiv.org/pdf/2601.07700v1"
      },
      "arxiv_id": "2601.07700v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07695v1",
      "title": "Smooth Operator: Smooth Verifiable Reward Activates Spatial Reasoning Ability of Vision-Language Model",
      "authors": [
        "Siwen Jiao",
        "Tianxiong Lv",
        "Kangan Qian",
        "Chenxu Zhao",
        "Xiuyuan Zhu",
        "Tianlun Li",
        "Xiaolong Cheng",
        "Jinyu Li",
        "Zhihao Liao",
        "Yang Cai"
      ],
      "abstract": "Vision-Language Models (VLMs) face a critical bottleneck in achieving precise numerical prediction for 3D scene understanding. Traditional reinforcement learning (RL) approaches, primarily based on relative ranking, often suffer from severe reward sparsity and gradient instability, failing to effectively exploit the verifiable signals provided by 3D physical constraints. Notably, in standard GRPO frameworks, relative normalization causes \"near-miss\" samples (characterized by small but non-zero errors) to suffer from advantage collapse. This leads to a severe data utilization bottleneck where valuable boundary samples are discarded during optimization. To address this, we introduce the Smooth Numerical Reward Activation (SNRA) operator and the Absolute-Preserving GRPO (AP-GRPO) framework. SNRA employs a dynamically parameterized Sigmoid function to transform raw feedback into a dense, continuous reward continuum. Concurrently, AP-GRPO integrates absolute scalar gradients to mitigate the numerical information loss inherent in conventional relative-ranking mechanisms. By leveraging this approach, we constructed Numerical3D-50k, a dataset comprising 50,000 verifiable 3D subtasks. Empirical results indicate that AP-GRPO achieves performance parity with large-scale supervised methods while maintaining higher data efficiency, effectively activating latent 3D reasoning in VLMs without requiring architectural modifications.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07695v1",
        "pdf": "https://arxiv.org/pdf/2601.07695v1"
      },
      "arxiv_id": "2601.07695v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07692v1",
      "title": "Leveraging 3D Representation Alignment and RGB Pretrained Priors for LiDAR Scene Generation",
      "authors": [
        "Nicolas Sereyjol-Garros",
        "Ellington Kirby",
        "Victor Besnier",
        "Nermin Samet"
      ],
      "abstract": "LiDAR scene synthesis is an emerging solution to scarcity in 3D data for robotic tasks such as autonomous driving. Recent approaches employ diffusion or flow matching models to generate realistic scenes, but 3D data remains limited compared to RGB datasets with millions of samples. We introduce R3DPA, the first LiDAR scene generation method to unlock image-pretrained priors for LiDAR point clouds, and leverage self-supervised 3D representations for state-of-the-art results. Specifically, we (i) align intermediate features of our generative model with self-supervised 3D features, which substantially improves generation quality; (ii) transfer knowledge from large-scale image-pretrained generative models to LiDAR generation, mitigating limited LiDAR datasets; and (iii) enable point cloud control at inference for object inpainting and scene mixing with solely an unconditional model. On the KITTI-360 benchmark R3DPA achieves state of the art performance. Code and pretrained models are available at https://github.com/valeoai/R3DPA.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07692v1",
        "pdf": "https://arxiv.org/pdf/2601.07692v1"
      },
      "arxiv_id": "2601.07692v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07691v1",
      "title": "A Framework for Feature Discovery in Intracranial Pressure Monitoring Data Using Neural Network Attention",
      "authors": [
        "Jonathan D. Socha",
        "Seyed F. Maroufi",
        "Dipankar Biswas",
        "Richard Um",
        "Aruna S. Rao",
        "Mark G. Luciano"
      ],
      "abstract": "We present a novel framework for analyzing intracranial pressure monitoring data by applying interpretability principles. Intracranial pressure monitoring data was collected from 60 patients at Johns Hopkins. The data was segmented into individual cardiac cycles. A convolutional neural network was trained to classify each cardiac cycle into one of seven body positions. Neural network attention was extracted and was used to identify regions of interest in the waveform. Further directions for exploration are identified. This framework provides an extensible method to further understand the physiological and clinical underpinnings of the intracranial pressure waveform, which could lead to better diagnostic capabilities for intracranial pressure monitoring.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "q-bio.QM",
        "cs.LG"
      ],
      "primary_category": "q-bio.QM",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07691v1",
        "pdf": "https://arxiv.org/pdf/2601.07691v1"
      },
      "arxiv_id": "2601.07691v1",
      "comment": "12 pages, 18 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07687v1",
      "title": "Physics-Informed Singular-Value Learning for Cross-Covariances Forecasting in Financial Markets",
      "authors": [
        "Efstratios Manolakis",
        "Christian Bongiorno",
        "Rosario Nunzio Mantegna"
      ],
      "abstract": "A new wave of work on covariance cleaning and nonlinear shrinkage has delivered asymptotically optimal analytical solutions for large covariance matrices. Building on this progress, these ideas have been generalized to empirical cross-covariance matrices, whose singular-value shrinkage characterizes comovements between one set of assets and another. Existing analytical cross-covariance cleaners are derived under strong stationarity and large-sample assumptions, and they typically rely on mesoscopic regularity conditions such as bounded spectra; macroscopic common modes (e.g., a global market factor) violate these conditions. When applied to real equity returns, where dependence structures drift over time and global modes are prominent, we find that these theoretically optimal formulas do not translate into robust out-of-sample performance. We address this gap by designing a random-matrix-inspired neural architecture that operates in the empirical singular-vector basis and learns a nonlinear mapping from empirical singular values to their corresponding cleaned values. By construction, the network can recover the analytical solution as a special case, yet it remains flexible enough to adapt to non-stationary dynamics and mode-driven distortions. Trained on a long history of equity returns, the proposed method achieves a more favorable bias-variance trade-off than purely analytical cleaners and delivers systematically lower out-of-sample cross-covariance prediction errors. Our results demonstrate that combining random-matrix theory with machine learning makes asymptotic theories practically effective in realistic time-varying markets.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "q-fin.ST",
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "q-fin.ST",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07687v1",
        "pdf": "https://arxiv.org/pdf/2601.07687v1"
      },
      "arxiv_id": "2601.07687v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07685v1",
      "title": "Predictive Analytics for Dementia: Machine Learning on Healthcare Data",
      "authors": [
        "Shafiul Ajam Opee",
        "Nafiz Fahad",
        "Anik Sen",
        "Rasel Ahmed",
        "Fariha Jahan",
        "Md. Kishor Morol",
        "Md Rashedul Islam"
      ],
      "abstract": "Dementia is a complex syndrome impacting cognitive and emotional functions, with Alzheimer's disease being the most common form. This study focuses on enhancing dementia prediction using machine learning (ML) techniques on patient health data. Supervised learning algorithms are applied in this study, including K-Nearest Neighbors (KNN), Quadratic Discriminant Analysis (QDA), Linear Discriminant Analysis (LDA), and Gaussian Process Classifiers. To address class imbalance and improve model performance, techniques such as Synthetic Minority Over-sampling Technique (SMOTE) and Term Frequency-Inverse Document Frequency (TF-IDF) vectorization were employed. Among the models, LDA achieved the highest testing accuracy of 98%. This study highlights the importance of model interpretability and the correlation of dementia with features such as the presence of the APOE-epsilon4 allele and chronic conditions like diabetes. This research advocates for future ML innovations, particularly in integrating explainable AI approaches, to further improve predictive capabilities in dementia care.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07685v1",
        "pdf": "https://arxiv.org/pdf/2601.07685v1"
      },
      "arxiv_id": "2601.07685v1",
      "comment": "10 pages, 13 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07675v1",
      "title": "Tab-TRM: Tiny Recursive Model for Insurance Pricing on Tabular Data",
      "authors": [
        "Kishan Padayachy",
        "Ronald Richman",
        "Mario V. Wüthrich"
      ],
      "abstract": "We introduce Tab-TRM (Tabular-Tiny Recursive Model), a network architecture that adapts the recursive latent reasoning paradigm of Tiny Recursive Models (TRMs) to insurance modeling. Drawing inspiration from both the Hierarchical Reasoning Model (HRM) and its simplified successor TRM, the Tab-TRM model makes predictions by reasoning over the input features. It maintains two learnable latent tokens - an answer token and a reasoning state - that are iteratively refined by a compact, parameter-efficient recursive network. The recursive processing layer repeatedly updates the reasoning state given the full token sequence and then refines the answer token, in close analogy with iterative insurance pricing schemes. Conceptually, Tab-TRM bridges classical actuarial workflows - iterative generalized linear model fitting and minimum-bias calibration - on the one hand, and modern machine learning, in terms of Gradient Boosting Machines, on the other.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "q-fin.RM"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07675v1",
        "pdf": "https://arxiv.org/pdf/2601.07675v1"
      },
      "arxiv_id": "2601.07675v1",
      "comment": "30 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07674v1",
      "title": "Self-Creating Random Walks for Decentralized Learning under Pac-Man Attacks",
      "authors": [
        "Xingran Chen",
        "Parimal Parag",
        "Rohit Bhagat",
        "Salim El Rouayheb"
      ],
      "abstract": "Random walk (RW)-based algorithms have long been popular in distributed systems due to low overheads and scalability, with recent growing applications in decentralized learning. However, their reliance on local interactions makes them inherently vulnerable to malicious behavior. In this work, we investigate an adversarial threat that we term the ``Pac-Man'' attack, in which a malicious node probabilistically terminates any RW that visits it. This stealthy behavior gradually eliminates active RWs from the network, effectively halting the learning process without triggering failure alarms. To counter this threat, we propose the CREATE-IF-LATE (CIL) algorithm, which is a fully decentralized, resilient mechanism that enables self-creating RWs and prevents RW extinction in the presence of Pac-Man. Our theoretical analysis shows that the CIL algorithm guarantees several desirable properties, such as (i) non-extinction of the RW population, (ii) almost sure boundedness of the RW population, and (iii) convergence of RW-based stochastic gradient descent even in the presence of Pac-Man with a quantifiable deviation from the true optimum. Moreover, the learning process experiences at most a linear time delay due to Pac-Man interruptions and RW regeneration. Our extensive empirical results on both synthetic and public benchmark datasets validate our theoretical findings.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.MA",
        "cs.LG"
      ],
      "primary_category": "cs.MA",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07674v1",
        "pdf": "https://arxiv.org/pdf/2601.07674v1"
      },
      "arxiv_id": "2601.07674v1",
      "comment": "arXiv admin note: substantial text overlap with arXiv:2508.05663",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07671v1",
      "title": "Advancing Multinational License Plate Recognition Through Synthetic and Real Data Fusion: A Comprehensive Evaluation",
      "authors": [
        "Rayson Laroca",
        "Valter Estevam",
        "Gladston J. P. Moreira",
        "Rodrigo Minetto",
        "David Menotti"
      ],
      "abstract": "Automatic License Plate Recognition is a frequent research topic due to its wide-ranging practical applications. While recent studies use synthetic images to improve License Plate Recognition (LPR) results, there remain several limitations in these efforts. This work addresses these constraints by comprehensively exploring the integration of real and synthetic data to enhance LPR performance. We subject 16 Optical Character Recognition (OCR) models to a benchmarking process involving 12 public datasets acquired from various regions. Several key findings emerge from our investigation. Primarily, the massive incorporation of synthetic data substantially boosts model performance in both intra- and cross-dataset scenarios. We examine three distinct methodologies for generating synthetic data: template-based generation, character permutation, and utilizing a Generative Adversarial Network (GAN) model, each contributing significantly to performance enhancement. The combined use of these methodologies demonstrates a notable synergistic effect, leading to end-to-end results that surpass those reached by state-of-the-art methods and established commercial systems. Our experiments also underscore the efficacy of synthetic data in mitigating challenges posed by limited training data, enabling remarkable results to be achieved even with small fractions of the original training data. Finally, we investigate the trade-off between accuracy and speed among different models, identifying those that strike the optimal balance in each intra-dataset and cross-dataset settings.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07671v1",
        "pdf": "https://arxiv.org/pdf/2601.07671v1"
      },
      "arxiv_id": "2601.07671v1",
      "comment": "IET Intelligent Transport Systems, vol. 19, no. 1, p. e70086, 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07667v1",
      "title": "Adaptive Layer Selection for Layer-Wise Token Pruning in LLM Inference",
      "authors": [
        "Rei Taniguchi",
        "Yuyang Dong",
        "Makoto Onizuka",
        "Chuan Xiao"
      ],
      "abstract": "Due to the prevalence of large language models (LLMs), key-value (KV) cache reduction for LLM inference has received remarkable attention. Among numerous works that have been proposed in recent years, layer-wise token pruning approaches, which select a subset of tokens at particular layers to retain in KV cache and prune others, are one of the most popular schemes. They primarily adopt a set of pre-defined layers, at which tokens are selected. Such design is inflexible in the sense that the accuracy significantly varies across tasks and deteriorates in harder tasks such as KV retrieval. In this paper, we propose ASL, a training-free method that adaptively chooses the selection layer for KV cache reduction, exploiting the variance of token ranks ordered by attention score. The proposed method balances the performance across different tasks while meeting the user-specified KV budget requirement. ASL operates during the prefilling stage and can be jointly used with existing KV cache reduction methods such as SnapKV to optimize the decoding stage. By evaluations on the InfiniteBench, RULER, and NIAH benchmarks, we show that equipped with one-shot token selection, where tokens are selected at a layer and propagated to deeper layers, ASL outperforms state-of-the-art layer-wise token selection methods in accuracy while maintaining decoding speed and KV cache reduction.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07667v1",
        "pdf": "https://arxiv.org/pdf/2601.07667v1"
      },
      "arxiv_id": "2601.07667v1",
      "comment": "Source code is available at https://github.com/TANIGUCHIREI/ASL",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2601.07665v1",
      "title": "Learning to accelerate Krasnosel'skii-Mann fixed-point iterations with guarantees",
      "authors": [
        "Andrea Martin",
        "Giuseppe Belgioioso"
      ],
      "abstract": "We introduce a principled learning to optimize (L2O) framework for solving fixed-point problems involving general nonexpansive mappings. Our idea is to deliberately inject summable perturbations into a standard Krasnosel'skii-Mann iteration to improve its average-case performance over a specific distribution of problems while retaining its convergence guarantees. Under a metric sub-regularity assumption, we prove that the proposed parametrization includes only iterations that locally achieve linear convergence-up to a vanishing bias term-and that it encompasses all iterations that do so at a sufficiently fast rate. We then demonstrate how our framework can be used to augment several widely-used operator splitting methods to accelerate the solution of structured monotone inclusion problems, and validate our approach on a best approximation problem using an L2O-augmented Douglas-Rachford splitting algorithm.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "eess.SY",
        "cs.LG",
        "math.OC"
      ],
      "primary_category": "eess.SY",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07665v1",
        "pdf": "https://arxiv.org/pdf/2601.07665v1"
      },
      "arxiv_id": "2601.07665v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07666v1",
      "title": "Variational Contrastive Learning for Skeleton-based Action Recognition",
      "authors": [
        "Dang Dinh Nguyen",
        "Decky Aspandi Latif",
        "Titus Zaharia"
      ],
      "abstract": "In recent years, self-supervised representation learning for skeleton-based action recognition has advanced with the development of contrastive learning methods. However, most of contrastive paradigms are inherently discriminative and often struggle to capture the variability and uncertainty intrinsic to human motion. To address this issue, we propose a variational contrastive learning framework that integrates probabilistic latent modeling with contrastive self-supervised learning. This formulation enables the learning of structured and semantically meaningful representations that generalize across different datasets and supervision levels. Extensive experiments on three widely used skeleton-based action recognition benchmarks show that our proposed method consistently outperforms existing approaches, particularly in low-label regimes. Moreover, qualitative analyses show that the features provided by our method are more relevant given the motion and sample characteristics, with more focus on important skeleton joints, when compared to the other methods.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07666v1",
        "pdf": "https://arxiv.org/pdf/2601.07666v1"
      },
      "arxiv_id": "2601.07666v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07663v1",
      "title": "Reasoning Models Will Blatantly Lie About Their Reasoning",
      "authors": [
        "William Walden"
      ],
      "abstract": "It has been shown that Large Reasoning Models (LRMs) may not *say what they think*: they do not always volunteer information about how certain parts of the input influence their reasoning. But it is one thing for a model to *omit* such information and another, worse thing to *lie* about it. Here, we extend the work of Chen et al. (2025) to show that LRMs will do just this: they will flatly deny relying on hints provided in the prompt in answering multiple choice questions -- even when directly asked to reflect on unusual (i.e. hinted) prompt content, even when allowed to use hints, and even though experiments *show* them to be using the hints. Our results thus have discouraging implications for CoT monitoring and interpretability.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07663v1",
        "pdf": "https://arxiv.org/pdf/2601.07663v1"
      },
      "arxiv_id": "2601.07663v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07660v1",
      "title": "StdGEN++: A Comprehensive System for Semantic-Decomposed 3D Character Generation",
      "authors": [
        "Yuze He",
        "Yanning Zhou",
        "Wang Zhao",
        "Jingwen Ye",
        "Zhongkai Wu",
        "Ran Yi",
        "Yong-Jin Liu"
      ],
      "abstract": "We present StdGEN++, a novel and comprehensive system for generating high-fidelity, semantically decomposed 3D characters from diverse inputs. Existing 3D generative methods often produce monolithic meshes that lack the structural flexibility required by industrial pipelines in gaming and animation. Addressing this gap, StdGEN++ is built upon a Dual-branch Semantic-aware Large Reconstruction Model (Dual-Branch S-LRM), which jointly reconstructs geometry, color, and per-component semantics in a feed-forward manner. To achieve production-level fidelity, we introduce a novel semantic surface extraction formalism compatible with hybrid implicit fields. This mechanism is accelerated by a coarse-to-fine proposal scheme, which significantly reduces memory footprint and enables high-resolution mesh generation. Furthermore, we propose a video-diffusion-based texture decomposition module that disentangles appearance into editable layers (e.g., separated iris and skin), resolving semantic confusion in facial regions. Experiments demonstrate that StdGEN++ achieves state-of-the-art performance, significantly outperforming existing methods in geometric accuracy and semantic disentanglement. Crucially, the resulting structural independence unlocks advanced downstream capabilities, including non-destructive editing, physics-compliant animation, and gaze tracking, making it a robust solution for automated character asset production.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07660v1",
        "pdf": "https://arxiv.org/pdf/2601.07660v1"
      },
      "arxiv_id": "2601.07660v1",
      "comment": "13 pages, 12 figures. Extended version of CVPR 2025 paper arXiv:2411.05738",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07654v1",
      "title": "Towards Automating Blockchain Consensus Verification with IsabeLLM",
      "authors": [
        "Elliot Jones",
        "William Knottenbelt"
      ],
      "abstract": "Consensus protocols are crucial for a blockchain system as they are what allow agreement between the system's nodes in a potentially adversarial environment. For this reason, it is paramount to ensure their correct design and implementation to prevent such adversaries from carrying out malicious behaviour. Formal verification allows us to ensure the correctness of such protocols, but requires high levels of effort and expertise to carry out and thus is often omitted in the development process. In this paper, we present IsabeLLM, a tool that integrates the proof assistant Isabelle with a Large Language Model to assist and automate proofs. We demonstrate the effectiveness of IsabeLLM by using it to develop a novel model of Bitcoin's Proof of Work consensus protocol and verify its correctness. We use the DeepSeek R1 API for this demonstration and found that we were able to generate correct proofs for each of the non-trivial lemmas present in the verification.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CR",
        "cs.AI"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07654v1",
        "pdf": "https://arxiv.org/pdf/2601.07654v1"
      },
      "arxiv_id": "2601.07654v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07651v1",
      "title": "Active Evaluation of General Agents: Problem Definition and Comparison of Baseline Algorithms",
      "authors": [
        "Marc Lanctot",
        "Kate Larson",
        "Ian Gemp",
        "Michael Kaisers"
      ],
      "abstract": "As intelligent agents become more generally-capable, i.e. able to master a wide variety of tasks, the complexity and cost of properly evaluating them rises significantly. Tasks that assess specific capabilities of the agents can be correlated and stochastic, requiring many samples for accurate comparisons, leading to added costs. In this paper, we propose a formal definition and a conceptual framework for active evaluation of agents across multiple tasks, which assesses the performance of ranking algorithms as a function of number of evaluation data samples. Rather than curating, filtering, or compressing existing data sets as a preprocessing step, we propose an online framing: on every iteration, the ranking algorithm chooses the task and agents to sample scores from. Then, evaluation algorithms report a ranking of agents on each iteration and their performance is assessed with respect to the ground truth ranking over time. Several baselines are compared under different experimental contexts, with synthetic generated data and simulated online access to real evaluation data from Atari game-playing agents. We find that the classical Elo rating system -- while it suffers from well-known failure modes, in theory -- is a consistently reliable choice for efficient reduction of ranking error in practice. A recently-proposed method, Soft Condorcet Optimization, shows comparable performance to Elo on synthetic data and significantly outperforms Elo on real Atari agent evaluation. When task variation from the ground truth is high, selecting tasks based on proportional representation leads to higher rate of ranking error reduction.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI",
        "cs.GT",
        "cs.LG",
        "cs.MA"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07651v1",
        "pdf": "https://arxiv.org/pdf/2601.07651v1"
      },
      "arxiv_id": "2601.07651v1",
      "comment": "AAMAS 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07646v1",
      "title": "Studying the Role of Synthetic Data for Machine Learning-based Wireless Networks Traffic Forecasting",
      "authors": [
        "José Pulido",
        "Francesc Wilhelmi",
        "Sergio Fortes",
        "Alfonso Fernández-Durán",
        "Lorenzo Galati Giordano",
        "Raquel Barco"
      ],
      "abstract": "Synthetic data generation is an appealing tool for augmenting and enriching datasets, playing a crucial role in advancing artificial intelligence (AI) and machine learning (ML). Not only does synthetic data help build robust AI/ML datasets cost-effectively, but it also offers privacy-friendly solutions and bypasses the complexities of storing large data volumes. This paper proposes a novel method to generate synthetic data, based on first-order auto-regressive noise statistics, for large-scale Wi-Fi deployments. The approach operates with minimal real data requirements while producing statistically rich traffic patterns that effectively mimic real Access Point (AP) behavior. Experimental results show that ML models trained on synthetic data achieve Mean Absolute Error (MAE) values within 10 to 15 of those obtained using real data when trained on the same APs, while requiring significantly less training data. Moreover, when generalization is required, synthetic-data-trained models improve prediction accuracy by up to 50 percent compared to real-data-trained baselines, thanks to the enhanced variability and diversity of the generated traces. Overall, the proposed method bridges the gap between synthetic data generation and practical Wi-Fi traffic forecasting, providing a scalable, efficient, and real-time solution for modern wireless networks.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "eess.SY",
        "cs.LG"
      ],
      "primary_category": "eess.SY",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07646v1",
        "pdf": "https://arxiv.org/pdf/2601.07646v1"
      },
      "arxiv_id": "2601.07646v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07641v1",
      "title": "Beyond Static Tools: Test-Time Tool Evolution for Scientific Reasoning",
      "authors": [
        "Jiaxuan Lu",
        "Ziyu Kong",
        "Yemin Wang",
        "Rong Fu",
        "Haiyuan Wan",
        "Cheng Yang",
        "Wenjie Lou",
        "Haoran Sun",
        "Lilong Wang",
        "Yankai Jiang",
        "Xiaosong Wang",
        "Xiao Sun",
        "Dongzhan Zhou"
      ],
      "abstract": "The central challenge of AI for Science is not reasoning alone, but the ability to create computational methods in an open-ended scientific world. Existing LLM-based agents rely on static, pre-defined tool libraries, a paradigm that fundamentally fails in scientific domains where tools are sparse, heterogeneous, and intrinsically incomplete. In this paper, we propose Test-Time Tool Evolution (TTE), a new paradigm that enables agents to synthesize, verify, and evolve executable tools during inference. By transforming tools from fixed resources into problem-driven artifacts, TTE overcomes the rigidity and long-tail limitations of static tool libraries. To facilitate rigorous evaluation, we introduce SciEvo, a benchmark comprising 1,590 scientific reasoning tasks supported by 925 automatically evolved tools. Extensive experiments show that TTE achieves state-of-the-art performance in both accuracy and tool efficiency, while enabling effective cross-domain adaptation of computational tools. The code and benchmark have been released at https://github.com/lujiaxuan0520/Test-Time-Tool-Evol.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.MA"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07641v1",
        "pdf": "https://arxiv.org/pdf/2601.07641v1"
      },
      "arxiv_id": "2601.07641v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07640v1",
      "title": "Dual-Level Models for Physics-Informed Multi-Step Time Series Forecasting",
      "authors": [
        "Mahdi Nasiri",
        "Johanna Kortelainen",
        "Simo Särkkä"
      ],
      "abstract": "This paper develops an approach for multi-step forecasting of dynamical systems by integrating probabilistic input forecasting with physics-informed output prediction. Accurate multi-step forecasting of time series systems is important for the automatic control and optimization of physical processes, enabling more precise decision-making. While mechanistic-based and data-driven machine learning (ML) approaches have been employed for time series forecasting, they face significant limitations. Incomplete knowledge of process mathematical models limits mechanistic-based direct employment, while purely data-driven ML models struggle with dynamic environments, leading to poor generalization. To address these limitations, this paper proposes a dual-level strategy for physics-informed forecasting of dynamical systems. On the first level, input variables are forecast using a hybrid method that integrates a long short-term memory (LSTM) network into probabilistic state transition models (STMs). On the second level, these stochastically predicted inputs are sequentially fed into a physics-informed neural network (PINN) to generate multi-step output predictions. The experimental results of the paper demonstrate that the hybrid input forecasting models achieve a higher log-likelihood and lower mean squared errors (MSE) compared to conventional STMs. Furthermore, the PINNs driven by the input forecasting models outperform their purely data-driven counterparts in terms of MSE and log-likelihood, exhibiting stronger generalization and forecasting performance across multiple test cases.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "stat.ML",
        "cs.LG"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07640v1",
        "pdf": "https://arxiv.org/pdf/2601.07640v1"
      },
      "arxiv_id": "2601.07640v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07638v1",
      "title": "SALT-KG: A Benchmark for Semantics-Aware Learning on Enterprise Tables",
      "authors": [
        "Isaiah Onando Mulang",
        "Felix Sasaki",
        "Tassilo Klein",
        "Jonas Kolk",
        "Nikolay Grechanov",
        "Johannes Hoffart"
      ],
      "abstract": "Building upon the SALT benchmark for relational prediction (Klein et al., 2024), we introduce SALT-KG, a benchmark for semantics-aware learning on enterprise tables. SALT-KG extends SALT by linking its multi-table transactional data with a structured Operational Business Knowledge represented in a Metadata Knowledge Graph (OBKG) that captures field-level descriptions, relational dependencies, and business object types. This extension enables evaluation of models that jointly reason over tabular evidence and contextual semantics, an increasingly critical capability for foundation models on structured data. Empirical analysis reveals that while metadata-derived features yield modest improvements in classical prediction metrics, these metadata features consistently highlight gaps in the ability of models to leverage semantics in relational context. By reframing tabular prediction as semantics-conditioned reasoning, SALT-KG establishes a benchmark to advance tabular foundation models grounded in declarative knowledge, providing the first empirical step toward semantically linked tables in structured data at enterprise scale.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07638v1",
        "pdf": "https://arxiv.org/pdf/2601.07638v1"
      },
      "arxiv_id": "2601.07638v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07637v1",
      "title": "Reinforcement Learning for Micro-Level Claims Reserving",
      "authors": [
        "Benjamin Avanzi",
        "Ronald Richman",
        "Bernard Wong",
        "Mario Wüthrich",
        "Yagebu Xie"
      ],
      "abstract": "Outstanding claim liabilities are revised repeatedly as claims develop, yet most modern reserving models are trained as one-shot predictors and typically learn only from settled claims. We formulate individual claims reserving as a claim-level Markov decision process in which an agent sequentially updates outstanding claim liability (OCL) estimates over development, using continuous actions and a reward design that balances accuracy with stable reserve revisions. A key advantage of this reinforcement learning (RL) approach is that it can learn from all observed claim trajectories, including claims that remain open at valuation, thereby avoiding the reduced sample size and selection effects inherent in supervised methods trained on ultimate outcomes only. We also introduce practical components needed for actuarial use -- initialisation of new claims, temporally consistent tuning via a rolling-settlement scheme, and an importance-weighting mechanism to mitigate portfolio-level underestimation driven by the rarity of large claims. On CAS and SPLICE synthetic general insurance datasets, the proposed Soft Actor-Critic implementation delivers competitive claim-level accuracy and strong aggregate OCL performance, particularly for the immature claim segments that drive most of the liability.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "q-fin.RM",
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "q-fin.RM",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07637v1",
        "pdf": "https://arxiv.org/pdf/2601.07637v1"
      },
      "arxiv_id": "2601.07637v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07636v1",
      "title": "Beyond Sharpness: A Flatness Decomposition Framework for Efficient Continual Learning",
      "authors": [
        "Yanan Chen",
        "Tieliang Gong",
        "Yunjiao Zhang",
        "Wen Wen"
      ],
      "abstract": "Continual Learning (CL) aims to enable models to sequentially learn multiple tasks without forgetting previous knowledge. Recent studies have shown that optimizing towards flatter loss minima can improve model generalization. However, existing sharpness-aware methods for CL suffer from two key limitations: (1) they treat sharpness regularization as a unified signal without distinguishing the contributions of its components. and (2) they introduce substantial computational overhead that impedes practical deployment. To address these challenges, we propose FLAD, a novel optimization framework that decomposes sharpness-aware perturbations into gradient-aligned and stochastic-noise components, and show that retaining only the noise component promotes generalization. We further introduce a lightweight scheduling scheme that enables FLAD to maintain significant performance gains even under constrained training time. FLAD can be seamlessly integrated into various CL paradigms and consistently outperforms standard and sharpness-aware optimizers in diverse experimental settings, demonstrating its effectiveness and practicality in CL.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07636v1",
        "pdf": "https://arxiv.org/pdf/2601.07636v1"
      },
      "arxiv_id": "2601.07636v1",
      "comment": "Accepted by AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07635v1",
      "title": "Learning About Learning: A Physics Path from Spin Glasses to Artificial Intelligence",
      "authors": [
        "Denis D. Caprioti",
        "Matheus Haas",
        "Constantino F. Vasconcelos",
        "Mauricio Girardi-Schappo"
      ],
      "abstract": "The Hopfield model, originally inspired by spin-glass physics, occupies a central place at the intersection of statistical mechanics, neural networks, and modern artificial intelligence. Despite its conceptual simplicity and broad applicability -- from associative memory to near-optimal solutions of combinatorial optimization problems -- it is rarely integrated into standard undergraduate physics curricula. In this paper, we present the Hopfield model as a pedagogically rich framework that naturally unifies core topics from undergraduate statistical physics, dynamical systems, linear algebra, and computational methods. We provide a concise and illustrated theoretical introduction grounded in familiar physics concepts, analyze the model's energy function, dynamics, and pattern stability, and discuss practical aspects of simulation, including a freely available simulation code. To support instruction, we conclude with classroom-ready example problems designed to mirror research practice. By explicitly connecting fundamental physics to contemporary AI applications, this work aims to help prepare physics students to understand, apply, and critically engage with the computational tools increasingly central to research, industry, and society.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cond-mat.dis-nn",
        "cs.AI",
        "cs.LG",
        "physics.comp-ph",
        "physics.ed-ph"
      ],
      "primary_category": "cond-mat.dis-nn",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07635v1",
        "pdf": "https://arxiv.org/pdf/2601.07635v1"
      },
      "arxiv_id": "2601.07635v1",
      "comment": "18 pages, 11 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07632v1",
      "title": "GeoMotionGPT: Geometry-Aligned Motion Understanding with Large Language Models",
      "authors": [
        "Zhankai Ye",
        "Bofan Li",
        "Yukai Jin",
        "Shuoqiu Li",
        "Wei Wang",
        "Yanfu Zhang",
        "Shangqian Gao",
        "Xin Liu"
      ],
      "abstract": "Discrete motion tokenization has recently enabled Large Language Models (LLMs) to serve as versatile backbones for motion understanding and motion-language reasoning. However, existing pipelines typically decouple motion quantization from semantic embedding learning, linking them solely via token IDs. This approach fails to effectively align the intrinsic geometry of the motion space with the embedding space, thereby hindering the LLM's capacity for nuanced motion reasoning. We argue that alignment is most effective when both modalities share a unified geometric basis. Therefore, instead of forcing the LLM to reconstruct the complex geometry among motion tokens from scratch, we present a novel framework that explicitly enforces orthogonality on both the motion codebook and the LLM embedding space, ensuring that their relational structures naturally mirror each other. Specifically, we employ a decoder-only quantizer with Gumbel-Softmax for differentiable training and balanced codebook usage. To bridge the modalities, we use a sparse projection that maps motion codes into the LLM embedding space while preserving orthogonality. Finally, a two-stage orthonormal regularization schedule enforces soft constraints during tokenizer training and LLM fine-tuning to maintain geometric alignment without hindering semantic adaptation. Extensive experiments on HumanML3D demonstrate that our framework achieves a 20% performance improvement over current state-of-the-art methods, validating that a unified geometric basis effectively empowers the LLM for nuanced motion reasoning.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07632v1",
        "pdf": "https://arxiv.org/pdf/2601.07632v1"
      },
      "arxiv_id": "2601.07632v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07620v1",
      "title": "PARL: Position-Aware Relation Learning Network for Document Layout Analysis",
      "authors": [
        "Fuyuan Liu",
        "Dianyu Yu",
        "He Ren",
        "Nayu Liu",
        "Xiaomian Kang",
        "Delai Qiu",
        "Fa Zhang",
        "Genpeng Zhen",
        "Shengping Liu",
        "Jiaen Liang",
        "Wei Huang",
        "Yining Wang",
        "Junnan Zhu"
      ],
      "abstract": "Document layout analysis aims to detect and categorize structural elements (e.g., titles, tables, figures) in scanned or digital documents. Popular methods often rely on high-quality Optical Character Recognition (OCR) to merge visual features with extracted text. This dependency introduces two major drawbacks: propagation of text recognition errors and substantial computational overhead, limiting the robustness and practical applicability of multimodal approaches. In contrast to the prevailing multimodal trend, we argue that effective layout analysis depends not on text-visual fusion, but on a deep understanding of documents' intrinsic visual structure. To this end, we propose PARL (Position-Aware Relation Learning Network), a novel OCR-free, vision-only framework that models layout through positional sensitivity and relational structure. Specifically, we first introduce a Bidirectional Spatial Position-Guided Deformable Attention module to embed explicit positional dependencies among layout elements directly into visual features. Second, we design a Graph Refinement Classifier (GRC) to refine predictions by modeling contextual relationships through a dynamically constructed layout graph. Extensive experiments show PARL achieves state-of-the-art results. It establishes a new benchmark for vision-only methods on DocLayNet and, notably, surpasses even strong multimodal models on M6Doc. Crucially, PARL (65M) is highly efficient, using roughly four times fewer parameters than large multimodal models (256M), demonstrating that sophisticated visual structure modeling can be both more efficient and robust than multimodal fusion.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07620v1",
        "pdf": "https://arxiv.org/pdf/2601.07620v1"
      },
      "arxiv_id": "2601.07620v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07618v1",
      "title": "Neural Architecture for Fast and Reliable Coagulation Assessment in Clinical Settings: Leveraging Thromboelastography",
      "authors": [
        "Yulu Wang",
        "Ziqian Zeng",
        "Jianjun Wu",
        "Zhifeng Tang"
      ],
      "abstract": "In an ideal medical environment, real-time coagulation monitoring can enable early detection and prompt remediation of risks. However, traditional Thromboelastography (TEG), a widely employed diagnostic modality, can only provide such outputs after nearly 1 hour of measurement. The delay might lead to elevated mortality rates. These issues clearly point out one of the key challenges for medical AI development: Mak-ing reasonable predictions based on very small data sets and accounting for variation between different patient populations, a task where conventional deep learning methods typically perform poorly. We present Physiological State Reconstruc-tion (PSR), a new algorithm specifically designed to take ad-vantage of dynamic changes between individuals and to max-imize useful information produced by small amounts of clini-cal data through mapping to reliable predictions and diagnosis. We develop MDFE to facilitate integration of varied temporal signals using multi-domain learning, and jointly learn high-level temporal interactions together with attentions via HLA; furthermore, the parameterized DAM we designed maintains the stability of the computed vital signs. PSR evaluates with 4 TEG-specialized data sets and establishes remarkable perfor-mance -- predictions of R2 > 0.98 for coagulation traits and error reduction around half compared to the state-of-the-art methods, and halving the inferencing time too. Drift-aware learning suggests a new future, with potential uses well be-yond thrombophilia discovery towards medical AI applica-tions with data scarcity.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07618v1",
        "pdf": "https://arxiv.org/pdf/2601.07618v1"
      },
      "arxiv_id": "2601.07618v1",
      "comment": "This paper has been accepted by AAAI26",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07611v1",
      "title": "DIAGPaper: Diagnosing Valid and Specific Weaknesses in Scientific Papers via Multi-Agent Reasoning",
      "authors": [
        "Zhuoyang Zou",
        "Abolfazl Ansari",
        "Delvin Ce Zhang",
        "Dongwon Lee",
        "Wenpeng Yin"
      ],
      "abstract": "Paper weakness identification using single-agent or multi-agent LLMs has attracted increasing attention, yet existing approaches exhibit key limitations. Many multi-agent systems simulate human roles at a surface level, missing the underlying criteria that lead experts to assess complementary intellectual aspects of a paper. Moreover, prior methods implicitly assume identified weaknesses are valid, ignoring reviewer bias, misunderstanding, and the critical role of author rebuttals in validating review quality. Finally, most systems output unranked weakness lists, rather than prioritizing the most consequential issues for users. In this work, we propose DIAGPaper, a novel multi-agent framework that addresses these challenges through three tightly integrated modules. The customizer module simulates human-defined review criteria and instantiates multiple reviewer agents with criterion-specific expertise. The rebuttal module introduces author agents that engage in structured debate with reviewer agents to validate and refine proposed weaknesses. The prioritizer module learns from large-scale human review practices to assess the severity of validated weaknesses and surfaces the top-K severest ones to users. Experiments on two benchmarks, AAAR and ReviewCritique, demonstrate that DIAGPaper substantially outperforms existing methods by producing more valid and more paper-specific weaknesses, while presenting them in a user-oriented, prioritized manner.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07611v1",
        "pdf": "https://arxiv.org/pdf/2601.07611v1"
      },
      "arxiv_id": "2601.07611v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07606v1",
      "title": "Proof of Time: A Benchmark for Evaluating Scientific Idea Judgments",
      "authors": [
        "Bingyang Ye",
        "Shan Chen",
        "Jingxuan Tu",
        "Chen Liu",
        "Zidi Xiong",
        "Samuel Schmidgall",
        "Danielle S. Bitterman"
      ],
      "abstract": "Large language models are increasingly being used to assess and forecast research ideas, yet we lack scalable ways to evaluate the quality of models' judgments about these scientific ideas. Towards this goal, we introduce PoT, a semi-verifiable benchmarking framework that links scientific idea judgments to downstream signals that become observable later (e.g., citations and shifts in researchers' agendas). PoT freezes a pre-cutoff snapshot of evidence in an offline sandbox and asks models to forecast post-cutoff outcomes, enabling verifiable evaluation when ground truth arrives, scalable benchmarking without exhaustive expert annotation, and analysis of human-model misalignment against signals such as peer-review awards. In addition, PoT provides a controlled testbed for agent-based research judgments that evaluate scientific ideas, comparing tool-using agents to non-agent baselines under prompt ablations and budget scaling. Across 30,000+ instances spanning four benchmark domains, we find that, compared with non-agent baselines, higher interaction budgets generally improve agent performance, while the benefit of tool use is strongly task-dependent. By combining time-partitioned, future-verifiable targets with an offline sandbox for tool use, PoT supports scalable evaluation of agents on future-facing scientific idea judgment tasks.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07606v1",
        "pdf": "https://arxiv.org/pdf/2601.07606v1"
      },
      "arxiv_id": "2601.07606v1",
      "comment": "under review",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07603v1",
      "title": "UIKA: Fast Universal Head Avatar from Pose-Free Images",
      "authors": [
        "Zijian Wu",
        "Boyao Zhou",
        "Liangxiao Hu",
        "Hongyu Liu",
        "Yuan Sun",
        "Xuan Wang",
        "Xun Cao",
        "Yujun Shen",
        "Hao Zhu"
      ],
      "abstract": "We present UIKA, a feed-forward animatable Gaussian head model from an arbitrary number of unposed inputs, including a single image, multi-view captures, and smartphone-captured videos. Unlike the traditional avatar method, which requires a studio-level multi-view capture system and reconstructs a human-specific model through a long-time optimization process, we rethink the task through the lenses of model representation, network design, and data preparation. First, we introduce a UV-guided avatar modeling strategy, in which each input image is associated with a pixel-wise facial correspondence estimation. Such correspondence estimation allows us to reproject each valid pixel color from screen space to UV space, which is independent of camera pose and character expression. Furthermore, we design learnable UV tokens on which the attention mechanism can be applied at both the screen and UV levels. The learned UV tokens can be decoded into canonical Gaussian attributes using aggregated UV information from all input views. To train our large avatar model, we additionally prepare a large-scale, identity-rich synthetic training dataset. Our method significantly outperforms existing approaches in both monocular and multi-view settings. Project page: https://zijian-wu.github.io/uika-page/",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07603v1",
        "pdf": "https://arxiv.org/pdf/2601.07603v1"
      },
      "arxiv_id": "2601.07603v1",
      "comment": "Project page: https://zijian-wu.github.io/uika-page/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2601.07599v1",
      "title": "Diffusion in SPAD Signals",
      "authors": [
        "Lior Dvir",
        "Nadav Torem",
        "Yoav Y. Schechner"
      ],
      "abstract": "We derive the likelihood of a raw signal in a single photon avalanche diode (SPAD), given a fixed photon flux. The raw signal comprises timing of detection events, which are nonlinearly related to the flux. Moreover, they are naturally stochastic. We then derive a score function of the signal. This is a key for solving inverse problems based on SPAD signals. We focus on deriving solutions involving a diffusion model, to express image priors. We demonstrate the effect of low or high photon counts, and the consequence of exploiting timing of detection events.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07599v1",
        "pdf": "https://arxiv.org/pdf/2601.07599v1"
      },
      "arxiv_id": "2601.07599v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07597v1",
      "title": "Pheromone-Focused Ant Colony Optimization algorithm for path planning",
      "authors": [
        "Yi Liu",
        "Hongda Zhang",
        "Zhongxue Gan",
        "Yuning Chen",
        "Ziqing Zhou",
        "Chunlei Meng",
        "Chun Ouyang"
      ],
      "abstract": "Ant Colony Optimization (ACO) is a prominent swarm intelligence algorithm extensively applied to path planning. However, traditional ACO methods often exhibit shortcomings, such as blind search behavior and slow convergence within complex environments. To address these challenges, this paper proposes the Pheromone-Focused Ant Colony Optimization (PFACO) algorithm, which introduces three key strategies to enhance the problem-solving ability of the ant colony. First, the initial pheromone distribution is concentrated in more promising regions based on the Euclidean distances of nodes to the start and end points, balancing the trade-off between exploration and exploitation. Second, promising solutions are reinforced during colony iterations to intensify pheromone deposition along high-quality paths, accelerating convergence while maintaining solution diversity. Third, a forward-looking mechanism is implemented to penalize redundant path turns, promoting smoother and more efficient solutions. These strategies collectively produce the focused pheromones to guide the ant colony's search, which enhances the global optimization capabilities of the PFACO algorithm, significantly improving convergence speed and solution quality across diverse optimization problems. The experimental results demonstrate that PFACO consistently outperforms comparative ACO algorithms in terms of convergence speed and solution quality.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.NE",
        "cs.AI"
      ],
      "primary_category": "cs.NE",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07597v1",
        "pdf": "https://arxiv.org/pdf/2601.07597v1"
      },
      "arxiv_id": "2601.07597v1",
      "comment": "Accepted to 2025 IEEE International Conference on Systems, Man, and Cybernetics (SMC)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07593v1",
      "title": "GRPO with State Mutations: Improving LLM-Based Hardware Test Plan Generation",
      "authors": [
        "Dimple Vijay Kochar",
        "Nathaniel Pinckney",
        "Guan-Ting Liu",
        "Chia-Tung Ho",
        "Chenhui Deng",
        "Haoxing Ren",
        "Brucek Khailany"
      ],
      "abstract": "RTL design often relies heavily on ad-hoc testbench creation early in the design cycle. While large language models (LLMs) show promise for RTL code generation, their ability to reason about hardware specifications and generate targeted test plans remains largely unexplored. We present the first systematic study of LLM reasoning capabilities for RTL verification stimuli generation, establishing a two-stage framework that decomposes test plan generation from testbench execution. Our benchmark reveals that state-of-the-art models, including DeepSeek-R1 and Claude-4.0-Sonnet, achieve only 15.7-21.7% success rates on generating stimuli that pass golden RTL designs. To improve LLM generated stimuli, we develop a comprehensive training methodology combining supervised fine-tuning with a novel reinforcement learning approach, GRPO with State Mutation (GRPO-SMu), which enhances exploration by varying input mutations. Our approach leverages a tree-based branching mutation strategy to construct training data comprising equivalent and mutated trees, moving beyond linear mutation approaches to provide rich learning signals. Training on this curated dataset, our 7B parameter model achieves a 33.3% golden test pass rate and a 13.9% mutation detection rate, representing a 17.6% absolute improvement over baseline and outperforming much larger general-purpose models. These results demonstrate that specialized training methodologies can significantly enhance LLM reasoning capabilities for hardware verification tasks, establishing a foundation for automated sub-unit testing in semiconductor design workflows.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AR",
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.AR",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07593v1",
        "pdf": "https://arxiv.org/pdf/2601.07593v1"
      },
      "arxiv_id": "2601.07593v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07588v1",
      "title": "Temporal-Aligned Meta-Learning for Risk Management: A Stacking Approach for Multi-Source Credit Scoring",
      "authors": [
        "O. Didkovskyi",
        "A. Vidali",
        "N. Jean",
        "G. Le Pera"
      ],
      "abstract": "This paper presents a meta-learning framework for credit risk assessment of Italian Small and Medium Enterprises (SMEs) that explicitly addresses the temporal misalignment of credit scoring models.\n  The approach aligns financial statement reference dates with evaluation dates, mitigating bias arising from publication delays and asynchronous data sources. It is based on a two-step temporal decomposition that at first estimates annual probabilities of default (PDs) anchored to balance-sheet reference dates (December 31st) through a static model. Then it models the monthly evolution of PDs using higher-frequency behavioral data. Finally, we employ stacking-based architecture to aggregate multiple scoring systems, each capturing complementary aspects of default risk, into a unified predictive model. In this way, first level model outputs are treated as learned representations that encode non-linear relationships in financial and behavioral indicators, allowing integration of new expert-based features without retraining base models. This design provides a coherent and interpretable solution to challenges typical of low-default environments, including heterogeneous default definitions and reporting delays. Empirical validation shows that the framework effectively captures credit risk evolution over time, improving temporal consistency and predictive stability relative to standard ensemble methods.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "q-fin.RM",
        "cs.LG",
        "q-fin.ST"
      ],
      "primary_category": "q-fin.RM",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07588v1",
        "pdf": "https://arxiv.org/pdf/2601.07588v1"
      },
      "arxiv_id": "2601.07588v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07585v1",
      "title": "Robust Multicentre Detection and Classification of Colorectal Liver Metastases on CT: Application of Foundation Models",
      "authors": [
        "Shruti Atul Mali",
        "Zohaib Salahuddin",
        "Yumeng Zhang",
        "Andre Aichert",
        "Xian Zhong",
        "Henry C. Woodruff",
        "Maciej Bobowicz",
        "Katrine Riklund",
        "Juozas Kupčinskas",
        "Lorenzo Faggioni",
        "Roberto Francischello",
        "Razvan L Miclea",
        "Philippe Lambin"
      ],
      "abstract": "Colorectal liver metastases (CRLM) are a major cause of cancer-related mortality, and reliable detection on CT remains challenging in multi-centre settings. We developed a foundation model-based AI pipeline for patient-level classification and lesion-level detection of CRLM on contrast-enhanced CT, integrating uncertainty quantification and explainability. CT data from the EuCanImage consortium (n=2437) and an external TCIA cohort (n=197) were used. Among several pretrained models, UMedPT achieved the best performance and was fine-tuned with an MLP head for classification and an FCOS-based head for lesion detection. The classification model achieved an AUC of 0.90 and a sensitivity of 0.82 on the combined test set, with a sensitivity of 0.85 on the external cohort. Excluding the most uncertain 20 percent of cases improved AUC to 0.91 and balanced accuracy to 0.86. Decision curve analysis showed clinical benefit for threshold probabilities between 0.30 and 0.40. The detection model identified 69.1 percent of lesions overall, increasing from 30 percent to 98 percent across lesion size quartiles. Grad-CAM highlighted lesion-corresponding regions in high-confidence cases. These results demonstrate that foundation model-based pipelines can support robust and interpretable CRLM detection and classification across heterogeneous CT data.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07585v1",
        "pdf": "https://arxiv.org/pdf/2601.07585v1"
      },
      "arxiv_id": "2601.07585v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07583v1",
      "title": "Machine learning nonequilibrium phase transitions in charge-density wave insulators",
      "authors": [
        "Yunhao Fan",
        "Sheng Zhang",
        "Gia-Wei Chern"
      ],
      "abstract": "Nonequilibrium electronic forces play a central role in voltage-driven phase transitions but are notoriously expensive to evaluate in dynamical simulations. Here we develop a machine learning framework for adiabatic lattice dynamics coupled to nonequilibrium electrons, and demonstrate it for a gating induced insulator to metal transition out of a charge density wave state in the Holstein model. Although exact electronic forces can be obtained from nonequilibrium Green's function (NEGF) calculations, their high computational cost renders long time dynamical simulations prohibitively expensive. By exploiting the locality of the electronic response, we train a neural network to directly predict instantaneous local electronic forces from the lattice configuration, thereby bypassing repeated NEGF calculations during time evolution. When combined with Brownian dynamics, the resulting machine learning force field quantitatively reproduces domain wall motion and nonequilibrium phase transition dynamics obtained from full NEGF simulations, while achieving orders of magnitude gains in computational efficiency. Our results establish direct force learning as an efficient and accurate approach for simulating nonequilibrium lattice dynamics in driven quantum materials.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cond-mat.str-el",
        "cs.LG",
        "physics.comp-ph"
      ],
      "primary_category": "cond-mat.str-el",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07583v1",
        "pdf": "https://arxiv.org/pdf/2601.07583v1"
      },
      "arxiv_id": "2601.07583v1",
      "comment": "11 pages, 4 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07582v1",
      "title": "ES-Mem: Event Segmentation-Based Memory for Long-Term Dialogue Agents",
      "authors": [
        "Huhai Zou",
        "Tianhao Sun",
        "Chuanjiang He",
        "Yu Tian",
        "Zhenyang Li",
        "Li Jin",
        "Nayu Liu",
        "Jiang Zhong",
        "Kaiwen Wei"
      ],
      "abstract": "Memory is critical for dialogue agents to maintain coherence and enable continuous adaptation in long-term interactions. While existing memory mechanisms offer basic storage and retrieval capabilities, they are hindered by two primary limitations: (1) rigid memory granularity often disrupts semantic integrity, resulting in fragmented and incoherent memory units; (2) prevalent flat retrieval paradigms rely solely on surface-level semantic similarity, neglecting the structural cues of discourse required to navigate and locate specific episodic contexts. To mitigate these limitations, drawing inspiration from Event Segmentation Theory, we propose ES-Mem, a framework incorporating two core components: (1) a dynamic event segmentation module that partitions long-term interactions into semantically coherent events with distinct boundaries; (2) a hierarchical memory architecture that constructs multi-layered memories and leverages boundary semantics to anchor specific episodic memory for precise context localization. Evaluations on two memory benchmarks demonstrate that ES-Mem yields consistent performance gains over baseline methods. Furthermore, the proposed event segmentation module exhibits robust applicability on dialogue segmentation datasets.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07582v1",
        "pdf": "https://arxiv.org/pdf/2601.07582v1"
      },
      "arxiv_id": "2601.07582v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07581v1",
      "title": "BenchSeg: A Large-Scale Dataset and Benchmark for Multi-View Food Video Segmentation",
      "authors": [
        "Ahmad AlMughrabi",
        "Guillermo Rivo",
        "Carlos Jiménez-Farfán",
        "Umair Haroon",
        "Farid Al-Areqi",
        "Hyunjun Jung",
        "Benjamin Busam",
        "Ricardo Marques",
        "Petia Radeva"
      ],
      "abstract": "Food image segmentation is a critical task for dietary analysis, enabling accurate estimation of food volume and nutrients. However, current methods suffer from limited multi-view data and poor generalization to new viewpoints. We introduce BenchSeg, a novel multi-view food video segmentation dataset and benchmark. BenchSeg aggregates 55 dish scenes (from Nutrition5k, Vegetables & Fruits, MetaFood3D, and FoodKit) with 25,284 meticulously annotated frames, capturing each dish under free 360° camera motion. We evaluate a diverse set of 20 state-of-the-art segmentation models (e.g., SAM-based, transformer, CNN, and large multimodal) on the existing FoodSeg103 dataset and evaluate them (alone and combined with video-memory modules) on BenchSeg. Quantitative and qualitative results demonstrate that while standard image segmenters degrade sharply under novel viewpoints, memory-augmented methods maintain temporal consistency across frames. Our best model based on a combination of SeTR-MLA+XMem2 outperforms prior work (e.g., improving over FoodMem by ~2.63% mAP), offering new insights into food segmentation and tracking for dietary analysis. We release BenchSeg to foster future research. The project page including the dataset annotations and the food segmentation models can be found at https://amughrabi.github.io/benchseg.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07581v1",
        "pdf": "https://arxiv.org/pdf/2601.07581v1"
      },
      "arxiv_id": "2601.07581v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07580v1",
      "title": "Large Language Models for Physics Instrument Design",
      "authors": [
        "Sara Zoccheddu",
        "Shah Rukh Qasim",
        "Patrick Owen",
        "Nicola Serra"
      ],
      "abstract": "We study the use of large language models (LLMs) for physics instrument design and compare their performance to reinforcement learning (RL). Using only prompting, LLMs are given task constraints and summaries of prior high-scoring designs and propose complete detector configurations, which we evaluate with the same simulators and reward functions used in RL-based optimization. Although RL yields stronger final designs, we find that modern LLMs consistently generate valid, resource-aware, and physically meaningful configurations that draw on broad pretrained knowledge of detector design principles and particle--matter interactions, despite having no task-specific training. Based on this result, as a first step toward hybrid design workflows, we explore pairing the LLMs with a dedicated trust region optimizer, serving as a precursor to future pipelines in which LLMs propose and structure design hypotheses while RL performs reward-driven optimization. Based on these experiments, we argue that LLMs are well suited as meta-planners: they can design and orchestrate RL-based optimization studies, define search strategies, and coordinate multiple interacting components within a unified workflow. In doing so, they point toward automated, closed-loop instrument design in which much of the human effort required to structure and supervise optimization can be reduced.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "physics.ins-det",
        "cs.AI",
        "cs.LG",
        "hep-ex"
      ],
      "primary_category": "physics.ins-det",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07580v1",
        "pdf": "https://arxiv.org/pdf/2601.07580v1"
      },
      "arxiv_id": "2601.07580v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07579v1",
      "title": "An adjoint method for training data-driven reduced-order models",
      "authors": [
        "Donglin Liu",
        "Francisco García Atienza",
        "Mengwu Guo"
      ],
      "abstract": "Reduced-order modeling lies at the interface of numerical analysis and data-driven scientific computing, providing principled ways to compress high-fidelity simulations in science and engineering. We propose a training framework that couples a continuous-time form of operator inference with the adjoint-state method to obtain robust data-driven reduced-order models. This method minimizes a trajectory-based loss between reduced-order solutions and projected snapshot data, which removes the need to estimate time derivatives from noisy measurements and provides intrinsic temporal regularization through time integration. We derive the corresponding continuous adjoint equations to compute gradients efficiently and implement a gradient based optimizer to update the reduced model parameters. Each iteration only requires one forward reduced order solve and one adjoint solve, followed by inexpensive gradient assembly, making the method attractive for large-scale simulations. We validate the proposed method on three partial differential equations: viscous Burgers' equation, the two-dimensional Fisher-KPP equation, and an advection-diffusion equation. We perform systematic comparisons against standard operator inference under two perturbation regimes, namely reduced temporal snapshot density and additive Gaussian noise. For clean data, both approaches deliver similar accuracy, but in situations with sparse sampling and noise, the proposed adjoint-based training provides better accuracy and enhanced roll-out stability.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CE",
        "cs.LG",
        "math.NA"
      ],
      "primary_category": "cs.CE",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07579v1",
        "pdf": "https://arxiv.org/pdf/2601.07579v1"
      },
      "arxiv_id": "2601.07579v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07577v1",
      "title": "Beyond Entangled Planning: Task-Decoupled Planning for Long-Horizon Agents",
      "authors": [
        "Yunfan Li",
        "Bingbing Xu",
        "Xueyun Tian",
        "Xiucheng Xu",
        "Huawei Shen"
      ],
      "abstract": "Recent advances in large language models (LLMs) have enabled agents to autonomously execute complex, long-horizon tasks, yet planning remains a primary bottleneck for reliable task execution. Existing methods typically fall into two paradigms: step-wise planning, which is reactive but often short-sighted; and one-shot planning, which generates a complete plan upfront yet is brittle to execution errors. Crucially, both paradigms suffer from entangled contexts, where the agent must reason over a monolithic history spanning multiple sub-tasks. This entanglement increases cognitive load and lets local errors propagate across otherwise independent decisions, making recovery computationally expensive. To address this, we propose Task-Decoupled Planning (TDP), a training-free framework that replaces entangled reasoning with task decoupling. TDP decomposes tasks into a directed acyclic graph (DAG) of sub-goals via a Supervisor. Using a Planner and Executor with scoped contexts, TDP confines reasoning and replanning to the active sub-task. This isolation prevents error propagation and corrects deviations locally without disrupting the workflow. Results on TravelPlanner, ScienceWorld, and HotpotQA show that TDP outperforms strong baselines while reducing token consumption by up to 82%, demonstrating that sub-task decoupling improves both robustness and efficiency for long-horizon agents.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07577v1",
        "pdf": "https://arxiv.org/pdf/2601.07577v1"
      },
      "arxiv_id": "2601.07577v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07576v1",
      "title": "A Multimodal Dataset of Student Oral Presentations with Sensors and Evaluation Data",
      "authors": [
        "Alvaro Becerra",
        "Ruth Cobos",
        "Roberto Daza"
      ],
      "abstract": "Oral presentation skills are a critical component of higher education, yet comprehensive datasets capturing real-world student performance across multiple modalities remain scarce. To address this gap, we present SOPHIAS (Student Oral Presentation monitoring for Holistic Insights & Analytics using Sensors), a 12-hour multimodal dataset containing recordings of 50 oral presentations (10-15-minute presentation followed by 5-15-minute Q&A) delivered by 65 undergraduate and master's students at the Universidad Autonoma de Madrid. SOPHIAS integrates eight synchronized sensor streams from high-definition webcams, ambient and webcam audio, eye-tracking glasses, smartwatch physiological sensors, and clicker, keyboard, and mouse interactions. In addition, the dataset includes slides and rubric-based evaluations from teachers, peers, and self-assessments, along with timestamped contextual annotations. The dataset captures presentations conducted in real classroom settings, preserving authentic student behaviors, interactions, and physiological responses. SOPHIAS enables the exploration of relationships between multimodal behavioral and physiological signals and presentation performance, supports the study of peer assessment, and provides a benchmark for developing automated feedback and Multimodal Learning Analytics tools. The dataset is publicly available for research through GitHub and Science Data Bank.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.HC",
        "cs.CV"
      ],
      "primary_category": "cs.HC",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07576v1",
        "pdf": "https://arxiv.org/pdf/2601.07576v1"
      },
      "arxiv_id": "2601.07576v1",
      "comment": "Article under review in the journal Scientific Data. GitHub repository of the dataset at: https://github.com/dataGHIA/SOPHIAS",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2601.07573v1",
      "title": "A Model of Artificial Jagged Intelligence",
      "authors": [
        "Joshua Gans"
      ],
      "abstract": "Generative AI systems often display highly uneven performance across tasks that appear ``nearby'': they can be excellent on one prompt and confidently wrong on another with only small changes in wording or context. We call this phenomenon Artificial Jagged Intelligence (AJI). This paper develops a tractable economic model of AJI that treats adoption as an information problem: users care about \\emph{local} reliability, but typically observe only coarse, global quality signals. In a baseline one-dimensional landscape, truth is a rough Brownian process, and the model ``knows'' scattered points drawn from a Poisson process. The model interpolates optimally, and the local error is measured by posterior variance. We derive an adoption threshold for a blind user, show that experienced errors are amplified by the inspection paradox, and interpret scaling laws as denser coverage that improves average quality without eliminating jaggedness. We then study mastery and calibration: a calibrated user who can condition on local uncertainty enjoys positive expected value even in domains that fail the blind adoption test. Modelling mastery as learning a reliability map via Gaussian process regression yields a learning-rate bound driven by information gain, clarifying when discovering ``where the model works'' is slow. Finally, we study how scaling interacts with discoverability: when calibrated signals and user mastery accelerate the harvesting of scale improvements, and when opacity can make gains from scaling effectively invisible.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "econ.TH",
        "cs.AI"
      ],
      "primary_category": "econ.TH",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07573v1",
        "pdf": "https://arxiv.org/pdf/2601.07573v1"
      },
      "arxiv_id": "2601.07573v1",
      "comment": "58 Pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07568v1",
      "title": "d3LLM: Ultra-Fast Diffusion LLM using Pseudo-Trajectory Distillation",
      "authors": [
        "Yu-Yang Qian",
        "Junda Su",
        "Lanxiang Hu",
        "Peiyuan Zhang",
        "Zhijie Deng",
        "Peng Zhao",
        "Hao Zhang"
      ],
      "abstract": "Diffusion large language models (dLLMs) offer capabilities beyond those of autoregressive (AR) LLMs, such as parallel decoding and random-order generation. However, realizing these benefits in practice is non-trivial, as dLLMs inherently face an accuracy-parallelism trade-off. Despite increasing interest, existing methods typically focus on only one-side of the coin, targeting either efficiency or performance. To address this limitation, we propose d3LLM (Pseudo-Distilled Diffusion Large Language Model), striking a balance between accuracy and parallelism: (i) during training, we introduce pseudo-trajectory distillation to teach the model which tokens can be decoded confidently at early steps, thereby improving parallelism; (ii) during inference, we employ entropy-based multi-block decoding with a KV-cache refresh mechanism to achieve high parallelism while maintaining accuracy. To better evaluate dLLMs, we also introduce AUP (Accuracy Under Parallelism), a new metric that jointly measures accuracy and parallelism. Experiments demonstrate that our d3LLM achieves up to 10$\\times$ speedup over vanilla LLaDA/Dream and 5$\\times$ speedup over AR models without much accuracy drop. Our code is available at https://github.com/hao-ai-lab/d3LLM.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07568v1",
        "pdf": "https://arxiv.org/pdf/2601.07568v1"
      },
      "arxiv_id": "2601.07568v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07565v1",
      "title": "A Unified Framework for Emotion Recognition and Sentiment Analysis via Expert-Guided Multimodal Fusion with Large Language Models",
      "authors": [
        "Jiaqi Qiao",
        "Xiujuan Xu",
        "Xinran Li",
        "Yu Liu"
      ],
      "abstract": "Multimodal emotion understanding requires effective integration of text, audio, and visual modalities for both discrete emotion recognition and continuous sentiment analysis. We present EGMF, a unified framework combining expert-guided multimodal fusion with large language models. Our approach features three specialized expert networks--a fine-grained local expert for subtle emotional nuances, a semantic correlation expert for cross-modal relationships, and a global context expert for long-range dependencies--adaptively integrated through hierarchical dynamic gating for context-aware feature selection. Enhanced multimodal representations are integrated with LLMs via pseudo token injection and prompt-based conditioning, enabling a single generative framework to handle both classification and regression through natural language generation. We employ LoRA fine-tuning for computational efficiency. Experiments on bilingual benchmarks (MELD, CHERMA, MOSEI, SIMS-V2) demonstrate consistent improvements over state-of-the-art methods, with superior cross-lingual robustness revealing universal patterns in multimodal emotional expressions across English and Chinese. We will release the source code publicly.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07565v1",
        "pdf": "https://arxiv.org/pdf/2601.07565v1"
      },
      "arxiv_id": "2601.07565v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07556v1",
      "title": "Backpropagation-Free Test-Time Adaptation for Lightweight EEG-Based Brain-Computer Interfaces",
      "authors": [
        "Siyang Li",
        "Jiayi Ouyang",
        "Zhenyao Cui",
        "Ziwei Wang",
        "Tianwang Jia",
        "Feng Wan",
        "Dongrui Wu"
      ],
      "abstract": "Electroencephalogram (EEG)-based brain-computer interfaces (BCIs) face significant deployment challenges due to inter-subject variability, signal non-stationarity, and computational constraints. While test-time adaptation (TTA) mitigates distribution shifts under online data streams without per-use calibration sessions, existing TTA approaches heavily rely on explicitly defined loss objectives that require backpropagation for updating model parameters, which incurs computational overhead, privacy risks, and sensitivity to noisy data streams. This paper proposes Backpropagation-Free Transformations (BFT), a TTA approach for EEG decoding that eliminates such issues. BFT applies multiple sample-wise transformations of knowledge-guided augmentations or approximate Bayesian inference to each test trial, generating multiple prediction scores for a single test sample. A learning-to-rank module enhances the weighting of these predictions, enabling robust aggregation for uncertainty suppression during inference under theoretical justifications. Extensive experiments on five EEG datasets of motor imagery classification and driver drowsiness regression tasks demonstrate the effectiveness, versatility, robustness, and efficiency of BFT. This research enables lightweight plug-and-play BCIs on resource-constrained devices, broadening the real-world deployment of decoding algorithms for EEG-based BCI.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.HC",
        "cs.AI"
      ],
      "primary_category": "cs.HC",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07556v1",
        "pdf": "https://arxiv.org/pdf/2601.07556v1"
      },
      "arxiv_id": "2601.07556v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07553v1",
      "title": "VirtualEnv: A Platform for Embodied AI Research",
      "authors": [
        "Kabir Swain",
        "Sijie Han",
        "Ayush Raina",
        "Jin Zhang",
        "Shuang Li",
        "Michael Stopa",
        "Antonio Torralba"
      ],
      "abstract": "As large language models (LLMs) continue to improve in reasoning and decision-making, there is a growing need for realistic and interactive environments where their abilities can be rigorously evaluated. We present VirtualEnv, a next-generation simulation platform built on Unreal Engine 5 that enables fine-grained benchmarking of LLMs in embodied and interactive scenarios. VirtualEnv supports rich agent-environment interactions, including object manipulation, navigation, and adaptive multi-agent collaboration, as well as game-inspired mechanics like escape rooms and procedurally generated environments. We provide a user-friendly API built on top of Unreal Engine, allowing researchers to deploy and control LLM-driven agents using natural language instructions. We integrate large-scale LLMs and vision-language models (VLMs), such as GPT-based models, to generate novel environments and structured tasks from multimodal inputs. Our experiments benchmark the performance of several popular LLMs across tasks of increasing complexity, analyzing differences in adaptability, planning, and multi-agent coordination. We also describe our methodology for procedural task generation, task validation, and real-time environment control. VirtualEnv is released as an open-source platform, we aim to advance research at the intersection of AI and gaming, enable standardized evaluation of LLMs in embodied AI settings, and pave the way for future developments in immersive simulations and interactive entertainment.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07553v1",
        "pdf": "https://arxiv.org/pdf/2601.07553v1"
      },
      "arxiv_id": "2601.07553v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07550v1",
      "title": "TFEC: Multivariate Time-Series Clustering via Temporal-Frequency Enhanced Contrastive Learning",
      "authors": [
        "Zexi Tan",
        "Tao Xie",
        "Haoyi Xiao",
        "Baoyao Yang",
        "Yuzhu Ji",
        "An Zeng",
        "Xiang Zhang",
        "Yiqun Zhang"
      ],
      "abstract": "Multivariate Time-Series (MTS) clustering is crucial for signal processing and data analysis. Although deep learning approaches, particularly those leveraging Contrastive Learning (CL), are prominent for MTS representation, existing CL-based models face two key limitations: 1) neglecting clustering information during positive/negative sample pair construction, and 2) introducing unreasonable inductive biases, e.g., destroying time dependence and periodicity through augmentation strategies, compromising representation quality. This paper, therefore, proposes a Temporal-Frequency Enhanced Contrastive (TFEC) learning framework. To preserve temporal structure while generating low-distortion representations, a temporal-frequency Co-EnHancement (CoEH) mechanism is introduced. Accordingly, a synergistic dual-path representation and cluster distribution learning framework is designed to jointly optimize cluster structure and representation fidelity. Experiments on six real-world benchmark datasets demonstrate TFEC's superiority, achieving 4.48% average NMI gains over SOTA methods, with ablation studies validating the design. The code of the paper is available at: https://github.com/yueliangy/TFEC.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07550v1",
        "pdf": "https://arxiv.org/pdf/2601.07550v1"
      },
      "arxiv_id": "2601.07550v1",
      "comment": "Submitted to ICASSP 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07548v1",
      "title": "Contextual Discrepancy-Aware Contrastive Learning for Robust Medical Time Series Diagnosis in Small-Sample Scenarios",
      "authors": [
        "Kaito Tanaka",
        "Aya Nakayama",
        "Masato Ito",
        "Yuji Nishimura",
        "Keisuke Matsuda"
      ],
      "abstract": "Medical time series data, such as EEG and ECG, are vital for diagnosing neurological and cardiovascular diseases. However, their precise interpretation faces significant challenges due to high annotation costs, leading to data scarcity, and the limitations of traditional contrastive learning in capturing complex temporal patterns. To address these issues, we propose CoDAC (Contextual Discrepancy-Aware Contrastive learning), a novel framework that enhances diagnostic accuracy and generalization, particularly in small-sample settings. CoDAC leverages external healthy data and introduces a Contextual Discrepancy Estimator (CDE), built upon a Transformer-based Autoencoder, to precisely quantify abnormal signals through context-aware anomaly scores. These scores dynamically inform a Dynamic Multi-views Contrastive Framework (DMCF), which adaptively weights different temporal views to focus contrastive learning on diagnostically relevant, discrepant regions. Our encoder combines dilated convolutions with multi-head attention for robust feature extraction. Comprehensive experiments on Alzheimer's Disease EEG, Parkinson's Disease EEG, and Myocardial Infarction ECG datasets demonstrate CoDAC's superior performance across all metrics, consistently outperforming state-of-the-art baselines, especially under low label availability. Ablation studies further validate the critical contributions of CDE and DMCF. CoDAC offers a robust and interpretable solution for medical time series diagnosis, effectively mitigating data scarcity challenges.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07548v1",
        "pdf": "https://arxiv.org/pdf/2601.07548v1"
      },
      "arxiv_id": "2601.07548v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07545v1",
      "title": "Near-Optimal Private Linear Regression via Iterative Hessian Mixing",
      "authors": [
        "Omri Lev",
        "Moshe Shenfeld",
        "Vishwak Srinivasan",
        "Katrina Ligett",
        "Ashia C. Wilson"
      ],
      "abstract": "We study differentially private ordinary least squares (DP-OLS) with bounded data. The dominant approach, adaptive sufficient-statistics perturbation (AdaSSP), adds an adaptively chosen perturbation to the sufficient statistics, namely, the matrix $X^{\\top}X$ and the vector $X^{\\top}Y$, and is known to achieve near-optimal accuracy and to have strong empirical performance. In contrast, methods that rely on Gaussian-sketching, which ensure differential privacy by pre-multiplying the data with a random Gaussian matrix, are widely used in federated and distributed regression, yet remain relatively uncommon for DP-OLS. In this work, we introduce the iterative Hessian mixing, a novel DP-OLS algorithm that relies on Gaussian sketches and is inspired by the iterative Hessian sketch algorithm. We provide utility analysis for the iterative Hessian mixing as well as a new analysis for the previous methods that rely on Gaussian sketches. Then, we show that our new approach circumvents the intrinsic limitations of the prior methods and provides non-trivial improvements over AdaSSP. We conclude by running an extensive set of experiments across standard benchmarks to demonstrate further that our approach consistently outperforms these prior baselines.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07545v1",
        "pdf": "https://arxiv.org/pdf/2601.07545v1"
      },
      "arxiv_id": "2601.07545v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07540v1",
      "title": "ViewMorpher3D: A 3D-aware Diffusion Framework for Multi-Camera Novel View Synthesis in Autonomous Driving",
      "authors": [
        "Farhad G. Zanjani",
        "Hong Cai",
        "Amirhossein Habibian"
      ],
      "abstract": "Autonomous driving systems rely heavily on multi-view images to ensure accurate perception and robust decision-making. To effectively develop and evaluate perception stacks and planning algorithms, realistic closed-loop simulators are indispensable. While 3D reconstruction techniques such as Gaussian Splatting offer promising avenues for simulator construction, the rendered novel views often exhibit artifacts, particularly in extrapolated perspectives or when available observations are sparse.\n  We introduce ViewMorpher3D, a multi-view image enhancement framework based on image diffusion models, designed to elevate photorealism and multi-view coherence in driving scenes. Unlike single-view approaches, ViewMorpher3D jointly processes a set of rendered views conditioned on camera poses, 3D geometric priors, and temporally adjacent or spatially overlapping reference views. This enables the model to infer missing details, suppress rendering artifacts, and enforce cross-view consistency.\n  Our framework accommodates variable numbers of cameras and flexible reference/target view configurations, making it adaptable to diverse sensor setups. Experiments on real-world driving datasets demonstrate substantial improvements in image quality metrics, effectively reducing artifacts while preserving geometric fidelity.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07540v1",
        "pdf": "https://arxiv.org/pdf/2601.07540v1"
      },
      "arxiv_id": "2601.07540v1",
      "comment": "Paper and supplementary materials",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07535v1",
      "title": "Nonparametric Kernel Clustering with Bandit Feedback",
      "authors": [
        "Victor Thuot",
        "Sebastian Vogt",
        "Debarghya Ghoshdastidar",
        "Nicolas Verzelen"
      ],
      "abstract": "Clustering with bandit feedback refers to the problem of partitioning a set of items, where the clustering algorithm can sequentially query the items to receive noisy observations. The problem is formally posed as the task of partitioning the arms of an N-armed stochastic bandit according to their underlying distributions, grouping two arms together if and only if they share the same distribution, using samples collected sequentially and adaptively. This setting has gained attention in recent years due to its applicability in recommendation systems and crowdsourcing. Existing works on clustering with bandit feedback rely on a strong assumption that the underlying distributions are sub-Gaussian. As a consequence, the existing methods mainly cover settings with linearly-separable clusters, which has little practical relevance. We introduce a framework of ``nonparametric clustering with bandit feedback'', where the underlying arm distributions are not constrained to any parametric, and hence, it is applicable for active clustering of real-world datasets. We adopt a kernel-based approach, which allows us to reformulate the nonparametric problem as the task of clustering the arms according to their kernel mean embeddings in a reproducing kernel Hilbert space (RKHS). Building on this formulation, we introduce the KABC algorithm with theoretical correctness guarantees and analyze its sampling budget. We introduce a notion of signal-to-noise ratio for this problem that depends on the maximum mean discrepancy (MMD) between the arm distributions and on their variance in the RKHS. Our algorithm is adaptive to this unknown quantity: it does not require it as an input yet achieves instance-dependent guarantees.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "stat.ML",
        "cs.LG"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07535v1",
        "pdf": "https://arxiv.org/pdf/2601.07535v1"
      },
      "arxiv_id": "2601.07535v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07528v1",
      "title": "From RAG to Agentic RAG for Faithful Islamic Question Answering",
      "authors": [
        "Gagan Bhatia",
        "Hamdy Mubarak",
        "Mustafa Jarrar",
        "George Mikros",
        "Fadi Zaraket",
        "Mahmoud Alhirthani",
        "Mutaz Al-Khatib",
        "Logan Cochrane",
        "Kareem Darwish",
        "Rashid Yahiaoui",
        "Firoj Alam"
      ],
      "abstract": "LLMs are increasingly used for Islamic question answering, where ungrounded responses may carry serious religious consequences. Yet standard MCQ/MRC-style evaluations do not capture key real-world failure modes, notably free-form hallucinations and whether models appropriately abstain when evidence is lacking. To shed a light on this aspect we introduce ISLAMICFAITHQA, a 3,810-item bilingual (Arabic/English) generative benchmark with atomic single-gold answers, which enables direct measurement of hallucination and abstention. We additionally developed an end-to-end grounded Islamic modelling suite consisting of (i) 25K Arabic text-grounded SFT reasoning pairs, (ii) 5K bilingual preference samples for reward-guided alignment, and (iii) a verse-level Qur'an retrieval corpus of $\\sim$6k atomic verses (ayat). Building on these resources, we develop an agentic Quran-grounding framework (agentic RAG) that uses structured tool calls for iterative evidence seeking and answer revision. Experiments across Arabic-centric and multilingual LLMs show that retrieval improves correctness and that agentic RAG yields the largest gains beyond standard RAG, achieving state-of-the-art performance and stronger Arabic-English robustness even with a small model (i.e., Qwen3 4B). We will make the experimental resources and datasets publicly available for the community.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07528v1",
        "pdf": "https://arxiv.org/pdf/2601.07528v1"
      },
      "arxiv_id": "2601.07528v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07525v1",
      "title": "Thinking Before Constraining: A Unified Decoding Framework for Large Language Models",
      "authors": [
        "Ngoc Trinh Hung Nguyen",
        "Alonso Silva",
        "Laith Zumot",
        "Liubov Tupikina",
        "Armen Aghasaryan",
        "Mehwish Alam"
      ],
      "abstract": "Natural generation allows Language Models (LMs) to produce free-form responses with rich reasoning, but the lack of guaranteed structure makes outputs difficult to parse or verify. Structured generation, or constrained decoding, addresses this drawback by producing content in standardized formats such as JSON, ensuring consistency and guaranteed-parsable outputs, but it can inadvertently restrict the model's reasoning capabilities. In this work, we propose a simple approach that combines the advantages of both natural and structured generation. By allowing LLMs to reason freely until specific trigger tokens are generated, and then switching to structured generation, our method preserves the expressive power of natural language reasoning while ensuring the reliability of structured outputs. We further evaluate our approach on several datasets, covering both classification and reasoning tasks, to demonstrate its effectiveness, achieving a substantial gain of up to 27% in accuracy compared to natural generation, while requiring only a small overhead of 10-20 extra tokens.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07525v1",
        "pdf": "https://arxiv.org/pdf/2601.07525v1"
      },
      "arxiv_id": "2601.07525v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07524v1",
      "title": "Stagewise Reinforcement Learning and the Geometry of the Regret Landscape",
      "authors": [
        "Chris Elliott",
        "Einar Urdshals",
        "David Quarel",
        "Matthew Farrugia-Roberts",
        "Daniel Murfet"
      ],
      "abstract": "Singular learning theory characterizes Bayesian learning as an evolving tradeoff between accuracy and complexity, with transitions between qualitatively different solutions as sample size increases. We extend this theory to deep reinforcement learning, proving that the concentration of the generalized posterior over policies is governed by the local learning coefficient (LLC), an invariant of the geometry of the regret function. This theory predicts that Bayesian phase transitions in reinforcement learning should proceed from simple policies with high regret to complex policies with low regret. We verify this prediction empirically in a gridworld environment exhibiting stagewise policy development: phase transitions over SGD training manifest as \"opposing staircases\" where regret decreases sharply while the LLC increases. Notably, the LLC detects phase transitions even when estimated on a subset of states where the policies appear identical in terms of regret, suggesting it captures changes in the underlying algorithm rather than just performance.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07524v1",
        "pdf": "https://arxiv.org/pdf/2601.07524v1"
      },
      "arxiv_id": "2601.07524v1",
      "comment": "50 pages, 14 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07519v1",
      "title": "Fast Multi-Stack Slice-to-Volume Reconstruction via Multi-Scale Unrolled Optimization",
      "authors": [
        "Margherita Firenze",
        "Sean I. Young",
        "Clinton J. Wang",
        "Hyuk Jin Yun",
        "Elfar Adalsteinsson",
        "Kiho Im",
        "P. Ellen Grant",
        "Polina Golland"
      ],
      "abstract": "Fully convolutional networks have become the backbone of modern medical imaging due to their ability to learn multi-scale representations and perform end-to-end inference. Yet their potential for slice-to-volume reconstruction (SVR), the task of jointly estimating 3D anatomy and slice poses from misaligned 2D acquisitions, remains underexplored. We introduce a fast convolutional framework that fuses multiple orthogonal 2D slice stacks to recover coherent 3D structure and refines slice alignment through lightweight model-based optimization. Applied to fetal brain MRI, our approach reconstructs high-quality 3D volumes in under 10s, with 1s slice registration and accuracy on par with state-of-the-art iterative SVR pipelines, offering more than speedup. The framework uses non-rigid displacement fields to represent transformations, generalizing to other SVR problems like fetal body and placental MRI. Additionally, the fast inference time paves the way for real-time, scanner-side volumetric feedback during MRI acquisition.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "eess.IV",
        "cs.CV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07519v1",
        "pdf": "https://arxiv.org/pdf/2601.07519v1"
      },
      "arxiv_id": "2601.07519v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07518v1",
      "title": "Mon3tr: Monocular 3D Telepresence with Pre-built Gaussian Avatars as Amortization",
      "authors": [
        "Fangyu Lin",
        "Yingdong Hu",
        "Zhening Liu",
        "Yufan Zhuang",
        "Zehong Lin",
        "Jun Zhang"
      ],
      "abstract": "Immersive telepresence aims to transform human interaction in AR/VR applications by enabling lifelike full-body holographic representations for enhanced remote collaboration. However, existing systems rely on hardware-intensive multi-camera setups and demand high bandwidth for volumetric streaming, limiting their real-time performance on mobile devices. To overcome these challenges, we propose Mon3tr, a novel Monocular 3D telepresence framework that integrates 3D Gaussian splatting (3DGS) based parametric human modeling into telepresence for the first time. Mon3tr adopts an amortized computation strategy, dividing the process into a one-time offline multi-view reconstruction phase to build a user-specific avatar and a monocular online inference phase during live telepresence sessions. A single monocular RGB camera is used to capture body motions and facial expressions in real time to drive the 3DGS-based parametric human model, significantly reducing system complexity and cost. The extracted motion and appearance features are transmitted at < 0.2 Mbps over WebRTC's data channel, allowing robust adaptation to network fluctuations. On the receiver side, e.g., Meta Quest 3, we develop a lightweight 3DGS attribute deformation network to dynamically generate corrective 3DGS attribute adjustments on the pre-built avatar, synthesizing photorealistic motion and appearance at ~ 60 FPS. Extensive experiments demonstrate the state-of-the-art performance of our method, achieving a PSNR of > 28 dB for novel poses, an end-to-end latency of ~ 80 ms, and > 1000x bandwidth reduction compared to point-cloud streaming, while supporting real-time operation from monocular inputs across diverse scenarios. Our demos can be found at https://mon3tr3d.github.io.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07518v1",
        "pdf": "https://arxiv.org/pdf/2601.07518v1"
      },
      "arxiv_id": "2601.07518v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07516v1",
      "title": "Controlling Multimodal Conversational Agents with Coverage-Enhanced Latent Actions",
      "authors": [
        "Yongqi Li",
        "Hao Lang",
        "Tieyun Qian",
        "Yongbin Li"
      ],
      "abstract": "Vision-language models are increasingly employed as multimodal conversational agents (MCAs) for diverse conversational tasks. Recently, reinforcement learning (RL) has been widely explored for adapting MCAs to various human-AI interaction scenarios. Despite showing great enhancement in generalization performance, fine-tuning MCAs via RL still faces challenges in handling the extremely large text token space. To address this, we learn a compact latent action space for RL fine-tuning instead. Specifically, we adopt the learning from observation mechanism to construct the codebook for the latent action space, where future observations are leveraged to estimate current latent actions that could further be used to reconstruct future observations. However, the scarcity of paired image-text data hinders learning a codebook with sufficient coverage. Thus, we leverage both paired image-text data and text-only data to construct the latent action space, using a cross-modal projector for transforming text embeddings into image-text embeddings. We initialize the cross-modal projector on paired image-text data, and further train it on massive text-only data with a novel cycle consistency loss to enhance its robustness. We show that our latent action based method outperforms competitive baselines on two conversation tasks across various RL algorithms.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07516v1",
        "pdf": "https://arxiv.org/pdf/2601.07516v1"
      },
      "arxiv_id": "2601.07516v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07514v1",
      "title": "Data-Driven Stochastic VRP: Integration of Forecast Duration into Optimization for Utility Workforce Management",
      "authors": [
        "Matteo Garbelli"
      ],
      "abstract": "This paper investigates the integration of machine learning forecasts of intervention durations into a stochastic variant of the Capacitated Vehicle Routing Problem with Time Windows (CVRPTW). In particular, we exploit tree-based gradient boosting (XGBoost) trained on eight years of gas meter maintenance data to produce point predictions and uncertainty estimates, which then drive a multi-objective evolutionary optimization routine. The methodology addresses uncertainty through sub-Gaussian concentration bounds for route-level risk buffers and explicitly accounts for competing operational KPIs through a multi-objective formulation. Empirical analysis of prediction residuals validates the sub-Gaussian assumption underlying the risk model. From an empirical point of view, our results report improvements around 20-25\\% in operator utilization and completion rates compared with plans computed using default durations. The integration of uncertainty quantification and risk-aware optimization provides a practical framework for handling stochastic service durations in real-world routing applications.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "math.OC",
        "cs.AI"
      ],
      "primary_category": "math.OC",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07514v1",
        "pdf": "https://arxiv.org/pdf/2601.07514v1"
      },
      "arxiv_id": "2601.07514v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07512v1",
      "title": "Land-then-transport: A Flow Matching-Based Generative Decoder for Wireless Image Transmission",
      "authors": [
        "Jingwen Fu",
        "Ming Xiao",
        "Mikael Skoglund",
        "Dong In Kim"
      ],
      "abstract": "Due to strict rate and reliability demands, wireless image transmission remains difficult for both classical layered designs and joint source-channel coding (JSCC), especially under low latency. Diffusion-based generative decoders can deliver strong perceptual quality by leveraging learned image priors, but iterative stochastic denoising leads to high decoding delay. To enable low-latency decoding, we propose a flow-matching (FM) generative decoder under a new land-then-transport (LTT) paradigm that tightly integrates the physical wireless channel into a continuous-time probability flow. For AWGN channels, we build a Gaussian smoothing path whose noise schedule indexes effective noise levels, and derive a closed-form teacher velocity field along this path. A neural-network student vector field is trained by conditional flow matching, yielding a deterministic, channel-aware ODE decoder with complexity linear in the number of ODE steps. At inference, it only needs an estimate of the effective noise variance to set the ODE starting time. We further show that Rayleigh fading and MIMO channels can be mapped, via linear MMSE equalization and singular-value-domain processing, to AWGN-equivalent channels with calibrated starting times. Therefore, the same probability path and trained velocity field can be reused for Rayleigh and MIMO without retraining. Experiments on MNIST, Fashion-MNIST, and DIV2K over AWGN, Rayleigh, and MIMO demonstrate consistent gains over JPEG2000+LDPC, DeepJSCC, and diffusion-based baselines, while achieving good perceptual quality with only a few ODE steps. Overall, LTT provides a deterministic, physically interpretable, and computation-efficient framework for generative wireless image decoding across diverse channels.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "eess.IV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07512v1",
        "pdf": "https://arxiv.org/pdf/2601.07512v1"
      },
      "arxiv_id": "2601.07512v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07504v1",
      "title": "FROAV: A Framework for RAG Observation and Agent Verification -- Lowering the Barrier to LLM Agent Research",
      "authors": [
        "Tzu-Hsuan Lin",
        "Chih-Hsuan Kao"
      ],
      "abstract": "The rapid advancement of Large Language Models (LLMs) and their integration into autonomous agent systems has created unprecedented opportunities for document analysis, decision support, and knowledge retrieval. However, the complexity of developing, evaluating, and iterating on LLM-based agent workflows presents significant barriers to researchers, particularly those without extensive software engineering expertise. We present FROAV (Framework for RAG Observation and Agent Verification), an open-source research platform that democratizes LLM agent research by providing a plug-and-play architecture combining visual workflow orchestration, a comprehensive evaluation framework, and extensible Python integration. FROAV implements a multi-stage Retrieval-Augmented Generation (RAG) pipeline coupled with a rigorous \"LLM-as-a-Judge\" evaluation system, all accessible through intuitive graphical interfaces. Our framework integrates n8n for no-code workflow design, PostgreSQL for granular data management, FastAPI for flexible backend logic, and Streamlit for human-in-the-loop interaction. Through this integrated ecosystem, researchers can rapidly prototype RAG strategies, conduct prompt engineering experiments, validate agent performance against human judgments, and collect structured feedback-all without writing infrastructure code. We demonstrate the framework's utility through its application to financial document analysis, while emphasizing its material-agnostic architecture that adapts to any domain requiring semantic analysis. FROAV represents a significant step toward making LLM agent research accessible to a broader scientific community, enabling researchers to focus on hypothesis testing and algorithmic innovation rather than system integration challenges.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.SE"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07504v1",
        "pdf": "https://arxiv.org/pdf/2601.07504v1"
      },
      "arxiv_id": "2601.07504v1",
      "comment": "8 pages, 1 figure, 3 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07499v1",
      "title": "Anatomy Aware Cascade Network: Bridging Epistemic Uncertainty and Geometric Manifold for 3D Tooth Segmentation",
      "authors": [
        "Bing Yu",
        "Liu Shi",
        "Haitao Wang",
        "Deran Qi",
        "Xiang Cai",
        "Wei Zhong",
        "Qiegen Liu"
      ],
      "abstract": "Accurate three-dimensional (3D) tooth segmentation from Cone-Beam Computed Tomography (CBCT) is a prerequisite for digital dental workflows. However, achieving high-fidelity segmentation remains challenging due to adhesion artifacts in naturally occluded scans, which are caused by low contrast and indistinct inter-arch boundaries. To address these limitations, we propose the Anatomy Aware Cascade Network (AACNet), a coarse-to-fine framework designed to resolve boundary ambiguity while maintaining global structural consistency. Specifically, we introduce two mechanisms: the Ambiguity Gated Boundary Refiner (AGBR) and the Signed Distance Map guided Anatomical Attention (SDMAA). The AGBR employs an entropy based gating mechanism to perform targeted feature rectification in high uncertainty transition zones. Meanwhile, the SDMAA integrates implicit geometric constraints via signed distance map to enforce topological consistency, preventing the loss of spatial details associated with standard pooling. Experimental results on a dataset of 125 CBCT volumes demonstrate that AACNet achieves a Dice Similarity Coefficient of 90.17 \\% and a 95\\% Hausdorff Distance of 3.63 mm, significantly outperforming state-of-the-art methods. Furthermore, the model exhibits strong generalization on an external dataset with an HD95 of 2.19 mm, validating its reliability for downstream clinical applications such as surgical planning. Code for AACNet is available at https://github.com/shiliu0114/AACNet.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07499v1",
        "pdf": "https://arxiv.org/pdf/2601.07499v1"
      },
      "arxiv_id": "2601.07499v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07496v1",
      "title": "Graph Inference Towards ICD Coding",
      "authors": [
        "Xiaoxiao Deng"
      ],
      "abstract": "Automated ICD coding involves assigning standardized diagnostic codes to clinical narratives. The vast label space and extreme class imbalance continue to challenge precise prediction. To address these issues, LabGraph is introduced -- a unified framework that reformulates ICD coding as a graph generation task. By combining adversarial domain adaptation, graph-based reinforcement learning, and perturbation regularization, LabGraph effectively enhances model robustness and generalization. In addition, a label graph discriminator dynamically evaluates each generated code, providing adaptive reward feedback during training. Experiments on benchmark datasets demonstrate that LabGraph consistently outperforms previous approaches on micro-F1, micro-AUC, and P@K.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07496v1",
        "pdf": "https://arxiv.org/pdf/2601.07496v1"
      },
      "arxiv_id": "2601.07496v1",
      "comment": "6 pages, 2 figures, 2 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07483v1",
      "title": "FocalOrder: Focal Preference Optimization for Reading Order Detection",
      "authors": [
        "Fuyuan Liu",
        "Dianyu Yu",
        "He Ren",
        "Nayu Liu",
        "Xiaomian Kang",
        "Delai Qiu",
        "Fa Zhang",
        "Genpeng Zhen",
        "Shengping Liu",
        "Jiaen Liang",
        "Wei Huang",
        "Yining Wang",
        "Junnan Zhu"
      ],
      "abstract": "Reading order detection is the foundation of document understanding. Most existing methods rely on uniform supervision, implicitly assuming a constant difficulty distribution across layout regions. In this work, we challenge this assumption by revealing a critical flaw: \\textbf{Positional Disparity}, a phenomenon where models demonstrate mastery over the deterministic start and end regions but suffer a performance collapse in the complex intermediate sections. This degradation arises because standard training allows the massive volume of easy patterns to drown out the learning signals from difficult layouts. To address this, we propose \\textbf{FocalOrder}, a framework driven by \\textbf{Focal Preference Optimization (FPO)}. Specifically, FocalOrder employs adaptive difficulty discovery with exponential moving average mechanism to dynamically pinpoint hard-to-learn transitions, while introducing a difficulty-calibrated pairwise ranking objective to enforce global logical consistency. Extensive experiments demonstrate that FocalOrder establishes new state-of-the-art results on OmniDocBench v1.0 and Comp-HRDoc. Our compact model not only outperforms competitive specialized baselines but also significantly surpasses large-scale general VLMs. These results demonstrate that aligning the optimization with intrinsic structural ambiguity of documents is critical for mastering complex document structures.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07483v1",
        "pdf": "https://arxiv.org/pdf/2601.07483v1"
      },
      "arxiv_id": "2601.07483v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07482v1",
      "title": "The Secretary Problem with Predictions and a Chosen Order",
      "authors": [
        "Helia Karisani",
        "Mohammadreza Daneshvaramoli",
        "Hedyeh Beyhaghi",
        "Mohammad Hajiesmaili",
        "Cameron Musco"
      ],
      "abstract": "We study a learning-augmented variant of the secretary problem, recently introduced by Fujii and Yoshida (2023), in which the decision-maker has access to machine-learned predictions of candidate values. The central challenge is to balance consistency and robustness: when predictions are accurate, the algorithm should select a near-optimal secretary, while under inaccurate predictions it should still guarantee a bounded competitive ratio.\n  We consider both the classical Random Order Secretary Problem (ROSP), where candidates arrive in a uniformly random order, and a more natural learning-augmented model in which the decision-maker may choose the arrival order based on predicted values. We call this model the Chosen Order Secretary Problem (COSP), capturing scenarios such as interview schedules set in advance.\n  We propose a new randomized algorithm applicable to both ROSP and COSP. Our method switches from fully trusting predictions to a threshold-based rule once a large prediction deviation is detected. Let $ε\\in [0,1]$ denote the maximum multiplicative prediction error. For ROSP, our algorithm achieves a competitive ratio of $\\max\\{0.221, (1-ε)/(1+ε)\\}$, improving upon the prior bound of $\\max\\{0.215, (1-ε)/(1+ε)\\}$. For COSP, we achieve $\\max\\{0.262, (1-ε)/(1+ε)\\}$, surpassing the $0.25$ worst-case bound for prior approaches and moving closer to the classical secretary benchmark of $1/e \\approx 0.368$. These results highlight the benefit of combining predictions with arrival-order control in online decision-making.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.DS",
        "cs.DM",
        "cs.GT",
        "cs.LG"
      ],
      "primary_category": "cs.DS",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07482v1",
        "pdf": "https://arxiv.org/pdf/2601.07482v1"
      },
      "arxiv_id": "2601.07482v1",
      "comment": "Accepted to the International Conference on Innovations in Theoretical Computer Science (ITCS 2026)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07477v1",
      "title": "JudgeFlow: Agentic Workflow Optimization via Block Judge",
      "authors": [
        "Zihan Ma",
        "Zhikai Zhao",
        "Chuanbo Hua",
        "Federico Berto",
        "Jinkyoo Park"
      ],
      "abstract": "Optimizing LLM-based agentic workflows is challenging for scaling AI capabilities. Current methods rely on coarse, end-to-end evaluation signals and lack fine-grained signals on where to refine, often resulting in inefficient or low-impact modifications. To address these limitations, we propose {\\our{}}, an Evaluation-Judge-Optimization-Update pipeline. We incorporate reusable, configurable logic blocks into agentic workflows to capture fundamental forms of logic. On top of this abstraction, we design a dedicated Judge module that inspects execution traces -- particularly failed runs -- and assigns rank-based responsibility scores to problematic blocks. These fine-grained diagnostic signals are then leveraged by an LLM-based optimizer, which focuses modifications on the most problematic block in the workflow. Our approach improves sample efficiency, enhances interpretability through block-level diagnostics, and provides a scalable foundation for automating increasingly complex agentic workflows. We evaluate {\\our{}} on mathematical reasoning and code generation benchmarks, where {\\our{}} achieves superior performance and efficiency compared to existing methods. The source code is publicly available at https://github.com/ma-zihan/JudgeFlow.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07477v1",
        "pdf": "https://arxiv.org/pdf/2601.07477v1"
      },
      "arxiv_id": "2601.07477v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07475v1",
      "title": "ARCQuant: Boosting NVFP4 Quantization with Augmented Residual Channels for LLMs",
      "authors": [
        "Haoqian Meng",
        "Yilun Luo",
        "Yafei Zhao",
        "Wenyuan Liu",
        "Peng Zhang",
        "Xindian Ma"
      ],
      "abstract": "The emergence of fine-grained numerical formats like NVFP4 presents new opportunities for efficient Large Language Model (LLM) inference. However, it is difficult to adapt existing Post-Training Quantization (PTQ) strategies to these formats: rotation-based methods compromise fine-grained block isolation; smoothing techniques struggle with significant 4-bit quantization errors; and mixed-precision approaches often conflict with hardware constraints on unified-precision computation. To address these challenges, we propose ARCQuant, a framework that boosts NVFP4 performance via Augmented Residual Channels. Distinct from methods that compromise block isolation or hardware uniformity, ARCQuant maintains a strictly unified NVFP4 format by augmenting the activation matrix with quantized residual channels. This design integrates the error compensation process directly into the matrix reduction dimension, enabling the use of standard, highly optimized GEMM kernels with minimal overhead. Theoretical analysis confirms that the worst-case error bound of our dual-stage NVFP4 quantization is comparable to that of standard 8-bit formats such as MXFP8. Extensive experiments on LLaMA and Qwen models demonstrate that ARCQuant achieves state-of-the-art accuracy, comparable to full-precision baselines in perplexity and downstream tasks. Furthermore, deployment on RTX 5090 and RTX PRO 6000 GPUs confirms practical benefits, achieving up to 3x speedup over FP16. Our code is available at https://github.com/actypedef/ARCQuant .",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07475v1",
        "pdf": "https://arxiv.org/pdf/2601.07475v1"
      },
      "arxiv_id": "2601.07475v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07474v1",
      "title": "Task Prototype-Based Knowledge Retrieval for Multi-Task Learning from Partially Annotated Data",
      "authors": [
        "Youngmin Oh",
        "Hyung-Il Kim",
        "Jung Uk Kim"
      ],
      "abstract": "Multi-task learning (MTL) is critical in real-world applications such as autonomous driving and robotics, enabling simultaneous handling of diverse tasks. However, obtaining fully annotated data for all tasks is impractical due to labeling costs. Existing methods for partially labeled MTL typically rely on predictions from unlabeled tasks, making it difficult to establish reliable task associations and potentially leading to negative transfer and suboptimal performance. To address these issues, we propose a prototype-based knowledge retrieval framework that achieves robust MTL instead of relying on predictions from unlabeled tasks. Our framework consists of two key components: (1) a task prototype embedding task-specific characteristics and quantifying task associations, and (2) a knowledge retrieval transformer that adaptively refines feature representations based on these associations. To achieve this, we introduce an association knowledge generating (AKG) loss to ensure the task prototype consistently captures task-specific characteristics. Extensive experiments demonstrate the effectiveness of our framework, highlighting its potential for robust multi-task learning, even when only a subset of tasks is annotated.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07474v1",
        "pdf": "https://arxiv.org/pdf/2601.07474v1"
      },
      "arxiv_id": "2601.07474v1",
      "comment": "Accepted at AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07473v1",
      "title": "AntiPaSTO: Self-Supervised Steering of Moral Reasoning",
      "authors": [
        "Michael J. Clark"
      ],
      "abstract": "As models grow more capable, human supervision breaks down: labels don't scale, outputs can be gamed, and training doesn't generalize. Scalable oversight requires steering methods that are internal, self-supervised, and transfer out-of-distribution; existing methods satisfy some but not all three. We introduce AntiPaSTO, which separates representations along an anti-parallel axis ($α=\\pm1$ produce opposite shifts), with coherence constraints preventing collapse. Human input is minimal: two contrasting words inserted into template sentences, no preference labels. Using 800 such pairs on Gemma-3-1B, AntiPaSTO beats prompting baselines by $6.9\\times$ on DailyDilemmas and maintains bidirectional control where prompting triggers refusal.\n  Code is available at https://github.com/wassname/AntiPaSTO.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07473v1",
        "pdf": "https://arxiv.org/pdf/2601.07473v1"
      },
      "arxiv_id": "2601.07473v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07470v1",
      "title": "Learning How to Remember: A Meta-Cognitive Management Method for Structured and Transferable Agent Memory",
      "authors": [
        "Sirui Liang",
        "Pengfei Cao",
        "Jian Zhao",
        "Wenhao Teng",
        "Xiangwen Liao",
        "Jun Zhao",
        "Kang Liu"
      ],
      "abstract": "Large language model (LLM) agents increasingly rely on accumulated memory to solve long-horizon decision-making tasks. However, most existing approaches store memory in fixed representations and reuse it at a single or implicit level of abstraction, which limits generalization and often leads to negative transfer when distribution shift. This paper proposes the Meta-Cognitive Memory Abstraction method (MCMA), which treats memory abstraction as a learnable cognitive skill rather than a fixed design choice. MCMA decouples task execution from memory management by combining a frozen task model with a learned memory copilot. The memory copilot is trained using direct preference optimization, it determines how memories should be structured, abstracted, and reused. Memories are further organized into a hierarchy of abstraction levels, enabling selective reuse based on task similarity. When no memory is transferable, MCMA transfers the ability to abstract and manage memory by transferring the memory copilot. Experiments on ALFWorld, ScienceWorld, and BabyAI demonstrate substantial improvements in performance, out-of-distribution generalization, and cross-task transfer over several baselines.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07470v1",
        "pdf": "https://arxiv.org/pdf/2601.07470v1"
      },
      "arxiv_id": "2601.07470v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07469v1",
      "title": "Knowledge Distillation for LLM-Based Human Activity Recognition in Homes",
      "authors": [
        "Julien Cumin",
        "Oussama Er-Rahmany",
        "Xi Chen"
      ],
      "abstract": "Human Activity Recognition (HAR) is a central problem for context-aware applications, especially for smart homes and assisted living. A few very recent studies have shown that Large Language Models (LLMs) can be used for HAR at home, reaching high performance and addressing key challenges. In this paper, we provide new experimental results regarding the use of LLMs for HAR, on two state-of-the-art datasets. More specifically, we show how recognition performance evolves depending on the size of the LLM used. Moreover, we experiment on the use of knowledge distillation techniques to fine-tune smaller LLMs with HAR reasoning examples generated by larger LLMs. We show that such fine-tuned models can perform almost as well as the largest LLMs, while having 50 times less parameters.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07469v1",
        "pdf": "https://arxiv.org/pdf/2601.07469v1"
      },
      "arxiv_id": "2601.07469v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2601.07468v1",
      "title": "Beyond Dialogue Time: Temporal Semantic Memory for Personalized LLM Agents",
      "authors": [
        "Miao Su",
        "Yucan Guo",
        "Zhongni Hou",
        "Long Bai",
        "Zixuan Li",
        "Yufei Zhang",
        "Guojun Yin",
        "Wei Lin",
        "Xiaolong Jin",
        "Jiafeng Guo",
        "Xueqi Cheng"
      ],
      "abstract": "Memory enables Large Language Model (LLM) agents to perceive, store, and use information from past dialogues, which is essential for personalization. However, existing methods fail to properly model the temporal dimension of memory in two aspects: 1) Temporal inaccuracy: memories are organized by dialogue time rather than their actual occurrence time; 2) Temporal fragmentation: existing methods focus on point-wise memory, losing durative information that captures persistent states and evolving patterns. To address these limitations, we propose Temporal Semantic Memory (TSM), a memory framework that models semantic time for point-wise memory and supports the construction and utilization of durative memory. During memory construction, it first builds a semantic timeline rather than a dialogue one. Then, it consolidates temporally continuous and semantically related information into a durative memory. During memory utilization, it incorporates the query's temporal intent on the semantic timeline, enabling the retrieval of temporally appropriate durative memories and providing time-valid, duration-consistent context to support response generation. Experiments on LongMemEval and LoCoMo show that TSM consistently outperforms existing methods and achieves up to 12.2% absolute improvement in accuracy, demonstrating the effectiveness of the proposed method.",
      "published": "2026-01-12",
      "updated": "2026-01-12",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2601.07468v1",
        "pdf": "https://arxiv.org/pdf/2601.07468v1"
      },
      "arxiv_id": "2601.07468v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    }
  ]
}