{
  "fetched_at": "2025-12-19T00:27:03.248390",
  "total_papers": 100,
  "papers": [
    {
      "id": "2512.15716v1",
      "title": "Spatia: Video Generation with Updatable Spatial Memory",
      "authors": [
        "Jinjing Zhao",
        "Fangyun Wei",
        "Zhening Liu",
        "Hongyang Zhang",
        "Chang Xu",
        "Yan Lu"
      ],
      "abstract": "Existing video generation models struggle to maintain long-term spatial and temporal consistency due to the dense, high-dimensional nature of video signals. To overcome this limitation, we propose Spatia, a spatial memory-aware video generation framework that explicitly preserves a 3D scene point cloud as persistent spatial memory. Spatia iteratively generates video clips conditioned on this spatial memory and continuously updates it through visual SLAM. This dynamic-static disentanglement design enhances spatial consistency throughout the generation process while preserving the model's ability to produce realistic dynamic entities. Furthermore, Spatia enables applications such as explicit camera control and 3D-aware interactive editing, providing a geometrically grounded framework for scalable, memory-driven video generation.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15716v1",
        "pdf": "https://arxiv.org/pdf/2512.15716v1"
      },
      "arxiv_id": "2512.15716v1",
      "comment": "Project page: https://zhaojingjing713.github.io/Spatia/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15715v1",
      "title": "In Pursuit of Pixel Supervision for Visual Pre-training",
      "authors": [
        "Lihe Yang",
        "Shang-Wen Li",
        "Yang Li",
        "Xinjie Lei",
        "Dong Wang",
        "Abdelrahman Mohamed",
        "Hengshuang Zhao",
        "Hu Xu"
      ],
      "abstract": "At the most basic level, pixels are the source of the visual information through which we perceive the world. Pixels contain information at all levels, ranging from low-level attributes to high-level concepts. Autoencoders represent a classical and long-standing paradigm for learning representations from pixels or other raw inputs. In this work, we demonstrate that autoencoder-based self-supervised learning remains competitive today and can produce strong representations for downstream tasks, while remaining simple, stable, and efficient. Our model, codenamed \"Pixio\", is an enhanced masked autoencoder (MAE) with more challenging pre-training tasks and more capable architectures. The model is trained on 2B web-crawled images with a self-curation strategy with minimal human curation. Pixio performs competitively across a wide range of downstream tasks in the wild, including monocular depth estimation (e.g., Depth Anything), feed-forward 3D reconstruction (i.e., MapAnything), semantic segmentation, and robot learning, outperforming or matching DINOv3 trained at similar scales. Our results suggest that pixel-space self-supervised learning can serve as a promising alternative and a complement to latent-space approaches.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15715v1",
        "pdf": "https://arxiv.org/pdf/2512.15715v1"
      },
      "arxiv_id": "2512.15715v1",
      "comment": "Project page: https://github.com/facebookresearch/pixio",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15713v1",
      "title": "DiffusionVL: Translating Any Autoregressive Models into Diffusion Vision Language Models",
      "authors": [
        "Lunbin Zeng",
        "Jingfeng Yao",
        "Bencheng Liao",
        "Hongyuan Tao",
        "Wenyu Liu",
        "Xinggang Wang"
      ],
      "abstract": "In recent multimodal research, the diffusion paradigm has emerged as a promising alternative to the autoregressive paradigm (AR), owing to its unique decoding advantages. However, due to the capability limitations of the base diffusion language model, the performance of the diffusion vision language model (dVLM) still lags significantly behind that of mainstream models. This leads to a simple yet fundamental question: Is it possible to construct dVLMs based on existing powerful AR models? In response, we propose DiffusionVL, a dVLM family that could be translated from any powerful AR models. Through simple fine-tuning, we successfully adapt AR pre-trained models into the diffusion paradigm. This approach yields two key observations: (1) The paradigm shift from AR-based multimodal models to diffusion is remarkably effective. (2) Direct conversion of an AR language model to a dVLM is also feasible, achieving performance competitive with LLaVA-style visual-instruction-tuning. Further, we introduce a block-decoding design into dVLMs that supports arbitrary-length generation and KV cache reuse, achieving a significant inference speedup. We conduct a large number of experiments. Despite training with less than 5% of the data required by prior methods, DiffusionVL achieves a comprehensive performance improvement-a 34.4% gain on the MMMU-Pro (vision) bench and 37.5% gain on the MME (Cog.) bench-alongside a 2x inference speedup. The model and code are released at https://github.com/hustvl/DiffusionVL.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15713v1",
        "pdf": "https://arxiv.org/pdf/2512.15713v1"
      },
      "arxiv_id": "2512.15713v1",
      "comment": "11 pages, 5 figures, conference or other essential info",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15712v1",
      "title": "Predictive Concept Decoders: Training Scalable End-to-End Interpretability Assistants",
      "authors": [
        "Vincent Huang",
        "Dami Choi",
        "Daniel D. Johnson",
        "Sarah Schwettmann",
        "Jacob Steinhardt"
      ],
      "abstract": "Interpreting the internal activations of neural networks can produce more faithful explanations of their behavior, but is difficult due to the complex structure of activation space. Existing approaches to scalable interpretability use hand-designed agents that make and test hypotheses about how internal activations relate to external behavior. We propose to instead turn this task into an end-to-end training objective, by training interpretability assistants to accurately predict model behavior from activations through a communication bottleneck. Specifically, an encoder compresses activations to a sparse list of concepts, and a decoder reads this list and answers a natural language question about the model. We show how to pretrain this assistant on large unstructured data, then finetune it to answer questions. The resulting architecture, which we call a Predictive Concept Decoder, enjoys favorable scaling properties: the auto-interp score of the bottleneck concepts improves with data, as does the performance on downstream applications. Specifically, PCDs can detect jailbreaks, secret hints, and implanted latent concepts, and are able to accurately surface latent user attributes.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15712v1",
        "pdf": "https://arxiv.org/pdf/2512.15712v1"
      },
      "arxiv_id": "2512.15712v1",
      "comment": "28 pages, 12 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15711v1",
      "title": "Gaussian Pixel Codec Avatars: A Hybrid Representation for Efficient Rendering",
      "authors": [
        "Divam Gupta",
        "Anuj Pahuja",
        "Nemanja Bartolovic",
        "Tomas Simon",
        "Forrest Iandola",
        "Giljoo Nam"
      ],
      "abstract": "We present Gaussian Pixel Codec Avatars (GPiCA), photorealistic head avatars that can be generated from multi-view images and efficiently rendered on mobile devices. GPiCA utilizes a unique hybrid representation that combines a triangle mesh and anisotropic 3D Gaussians. This combination maximizes memory and rendering efficiency while maintaining a photorealistic appearance. The triangle mesh is highly efficient in representing surface areas like facial skin, while the 3D Gaussians effectively handle non-surface areas such as hair and beard. To this end, we develop a unified differentiable rendering pipeline that treats the mesh as a semi-transparent layer within the volumetric rendering paradigm of 3D Gaussian Splatting. We train neural networks to decode a facial expression code into three components: a 3D face mesh, an RGBA texture, and a set of 3D Gaussians. These components are rendered simultaneously in a unified rendering engine. The networks are trained using multi-view image supervision. Our results demonstrate that GPiCA achieves the realism of purely Gaussian-based avatars while matching the rendering performance of mesh-based avatars.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.GR"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15711v1",
        "pdf": "https://arxiv.org/pdf/2512.15711v1"
      },
      "arxiv_id": "2512.15711v1",
      "comment": "Tech report",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15710v1",
      "title": "Artism: AI-Driven Dual-Engine System for Art Generation and Critique",
      "authors": [
        "Shuai Liu",
        "Yiqing Tian",
        "Yang Chen",
        "Mar Canet Sola"
      ],
      "abstract": "This paper proposes a dual-engine AI architectural method designed to address the complex problem of exploring potential trajectories in the evolution of art. We present two interconnected components: AIDA (an artificial artist social network) and the Ismism Machine, a system for critical analysis. The core innovation lies in leveraging deep learning and multi-agent collaboration to enable multidimensional simulations of art historical developments and conceptual innovation patterns. The framework explores a shift from traditional unidirectional critique toward an intelligent, interactive mode of reflexive practice. We are currently applying this method in experimental studies on contemporary art concepts. This study introduces a general methodology based on AI-driven critical loops, offering new possibilities for computational analysis of art.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15710v1",
        "pdf": "https://arxiv.org/pdf/2512.15710v1"
      },
      "arxiv_id": "2512.15710v1",
      "comment": "7 pages, 3 figures, 36 references, appendix with support material and 1 introduction video",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15708v1",
      "title": "Multi-View Foundation Models",
      "authors": [
        "Leo Segre",
        "Or Hirschorn",
        "Shai Avidan"
      ],
      "abstract": "Foundation models are vital tools in various Computer Vision applications. They take as input a single RGB image and output a deep feature representation that is useful for various applications. However, in case we have multiple views of the same 3D scene, they operate on each image independently and do not always produce consistent features for the same 3D point. We propose a way to convert a Foundation Model into a Multi-View Foundation Model. Such a model takes as input a set of images and outputs a feature map for each image such that the features of corresponding points are as consistent as possible. This approach bypasses the need to build a consistent 3D model of the features and allows direct manipulation in the image space. Specifically, we show how to augment Transformers-based foundation models (i.e., DINO, SAM, CLIP) with intermediate 3D-aware attention layers that help match features across different views. As leading examples, we show surface normal estimation and multi-view segmentation tasks. Quantitative experiments show that our method improves feature matching considerably compared to current foundation models.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15708v1",
        "pdf": "https://arxiv.org/pdf/2512.15708v1"
      },
      "arxiv_id": "2512.15708v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15707v1",
      "title": "GateFusion: Hierarchical Gated Cross-Modal Fusion for Active Speaker Detection",
      "authors": [
        "Yu Wang",
        "Juhyung Ha",
        "Frangil M. Ramirez",
        "Yuchen Wang",
        "David J. Crandall"
      ],
      "abstract": "Active Speaker Detection (ASD) aims to identify who is currently speaking in each frame of a video. Most state-of-the-art approaches rely on late fusion to combine visual and audio features, but late fusion often fails to capture fine-grained cross-modal interactions, which can be critical for robust performance in unconstrained scenarios. In this paper, we introduce GateFusion, a novel architecture that combines strong pretrained unimodal encoders with a Hierarchical Gated Fusion Decoder (HiGate). HiGate enables progressive, multi-depth fusion by adaptively injecting contextual features from one modality into the other at multiple layers of the Transformer backbone, guided by learnable, bimodally-conditioned gates. To further strengthen multimodal learning, we propose two auxiliary objectives: Masked Alignment Loss (MAL) to align unimodal outputs with multimodal predictions, and Over-Positive Penalty (OPP) to suppress spurious video-only activations. GateFusion establishes new state-of-the-art results on several challenging ASD benchmarks, achieving 77.8% mAP (+9.4%), 86.1% mAP (+2.9%), and 96.1% mAP (+0.5%) on Ego4D-ASD, UniTalk, and WASD benchmarks, respectively, and delivering competitive performance on AVA-ActiveSpeaker. Out-of-domain experiments demonstrate the generalization of our model, while comprehensive ablations show the complementary benefits of each component.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15707v1",
        "pdf": "https://arxiv.org/pdf/2512.15707v1"
      },
      "arxiv_id": "2512.15707v1",
      "comment": "accepted by WACV 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15706v1",
      "title": "Learning Model Parameter Dynamics in a Combination Therapy for Bladder Cancer from Sparse Biological Data",
      "authors": [
        "Kayode Olumoyin",
        "Lamees El Naqa",
        "Katarzyna Rejniak"
      ],
      "abstract": "In a mathematical model of interacting biological organisms, where external interventions may alter behavior over time, traditional models that assume fixed parameters usually do not capture the evolving dynamics. In oncology, this is further exacerbated by the fact that experimental data are often sparse and sometimes are composed of a few time points of tumor volume. In this paper, we propose to learn time-varying interactions between cells, such as those of bladder cancer tumors and immune cells, and their response to a combination of anticancer treatments in a limited data scenario. We employ the physics-informed neural network (PINN) approach to predict possible subpopulation trajectories at time points where no observed data are available. We demonstrate that our approach is consistent with the biological explanation of subpopulation trajectories. Our method provides a framework for learning evolving interactions among biological organisms when external interventions are applied to their environment.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "q-bio.CB"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15706v1",
        "pdf": "https://arxiv.org/pdf/2512.15706v1"
      },
      "arxiv_id": "2512.15706v1",
      "comment": "NeurIPS 2025 Workshop on Learning from Time Series for Health",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15705v1",
      "title": "Dynamic Rebatching for Efficient Early-Exit Inference with DREX",
      "authors": [
        "Xuting Liu",
        "Daniel Alexander",
        "Siva Kesava Reddy Kakarla",
        "Behnaz Arzani",
        "Vincent Liu"
      ],
      "abstract": "Early-Exit (EE) is a Large Language Model (LLM) architecture that accelerates inference by allowing easier tokens to be generated using only a subset of the model's layers. However, traditional batching frameworks are ill-suited for EE LLMs, as not all requests in a batch may be ready to exit at the same time. Existing solutions either force a uniform decision on the batch, which overlooks EE opportunities, or degrade output quality by forcing premature exits. We propose Dynamic Rebatching, a solution where we dynamically reorganize the batch at each early-exit point. Requests that meet the exit criteria are immediately processed, while those that continue are held in a buffer, re-grouped into a new batch, and forwarded to deeper layers. We introduce DREX, an early-exit inference system that implements Dynamic Rebatching with two key optimizations: 1) a copy-free rebatching buffer that avoids physical data movement, and 2) an EE and SLA-aware scheduler that analytically predicts whether a given rebatching operation will be profitable. DREX also efficiently handles the missing KV cache from skipped layers using memory-efficient state-copying. Our evaluation shows that DREX improves throughput by 2-12% compared to baseline approaches while maintaining output quality. Crucially, DREX completely eliminates involuntary exits, providing a key guarantee for preserving the output quality intended by the EE model.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.DC",
        "cs.LG"
      ],
      "primary_category": "cs.DC",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15705v1",
        "pdf": "https://arxiv.org/pdf/2512.15705v1"
      },
      "arxiv_id": "2512.15705v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15702v1",
      "title": "End-to-End Training for Autoregressive Video Diffusion via Self-Resampling",
      "authors": [
        "Yuwei Guo",
        "Ceyuan Yang",
        "Hao He",
        "Yang Zhao",
        "Meng Wei",
        "Zhenheng Yang",
        "Weilin Huang",
        "Dahua Lin"
      ],
      "abstract": "Autoregressive video diffusion models hold promise for world simulation but are vulnerable to exposure bias arising from the train-test mismatch. While recent works address this via post-training, they typically rely on a bidirectional teacher model or online discriminator. To achieve an end-to-end solution, we introduce Resampling Forcing, a teacher-free framework that enables training autoregressive video models from scratch and at scale. Central to our approach is a self-resampling scheme that simulates inference-time model errors on history frames during training. Conditioned on these degraded histories, a sparse causal mask enforces temporal causality while enabling parallel training with frame-level diffusion loss. To facilitate efficient long-horizon generation, we further introduce history routing, a parameter-free mechanism that dynamically retrieves the top-k most relevant history frames for each query. Experiments demonstrate that our approach achieves performance comparable to distillation-based baselines while exhibiting superior temporal consistency on longer videos owing to native-length training.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15702v1",
        "pdf": "https://arxiv.org/pdf/2512.15702v1"
      },
      "arxiv_id": "2512.15702v1",
      "comment": "Project Page: https://guoyww.github.io/projects/resampling-forcing/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15701v1",
      "title": "VLIC: Vision-Language Models As Perceptual Judges for Human-Aligned Image Compression",
      "authors": [
        "Kyle Sargent",
        "Ruiqi Gao",
        "Philipp Henzler",
        "Charles Herrmann",
        "Aleksander Holynski",
        "Li Fei-Fei",
        "Jiajun Wu",
        "Jason Zhang"
      ],
      "abstract": "Evaluations of image compression performance which include human preferences have generally found that naive distortion functions such as MSE are insufficiently aligned to human perception. In order to align compression models to human perception, prior work has employed differentiable perceptual losses consisting of neural networks calibrated on large-scale datasets of human psycho-visual judgments. We show that, surprisingly, state-of-the-art vision-language models (VLMs) can replicate binary human two-alternative forced choice (2AFC) judgments zero-shot when asked to reason about the differences between pairs of images. Motivated to exploit the powerful zero-shot visual reasoning capabilities of VLMs, we propose Vision-Language Models for Image Compression (VLIC), a diffusion-based image compression system designed to be post-trained with binary VLM judgments. VLIC leverages existing techniques for diffusion model post-training with preferences, rather than distilling the VLM judgments into a separate perceptual loss network. We show that calibrating this system on VLM judgments produces competitive or state-of-the-art performance on human-aligned visual compression depending on the dataset, according to perceptual metrics and large-scale user studies. We additionally conduct an extensive analysis of the VLM-based reward design and training procedure and share important insights. More visuals are available at https://kylesargent.github.io/vlic",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15701v1",
        "pdf": "https://arxiv.org/pdf/2512.15701v1"
      },
      "arxiv_id": "2512.15701v1",
      "comment": "14 pages, 8 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15699v1",
      "title": "FrontierCS: Evolving Challenges for Evolving Intelligence",
      "authors": [
        "Qiuyang Mang",
        "Wenhao Chai",
        "Zhifei Li",
        "Huanzhi Mao",
        "Shang Zhou",
        "Alexander Du",
        "Hanchen Li",
        "Shu Liu",
        "Edwin Chen",
        "Yichuan Wang",
        "Xieting Chu",
        "Zerui Cheng",
        "Yuan Xu",
        "Tian Xia",
        "Zirui Wang",
        "Tianneng Shi",
        "Jianzhu Yao",
        "Yilong Zhao",
        "Qizheng Zhang",
        "Charlie Ruan",
        "Zeyu Shen",
        "Kaiyuan Liu",
        "Runyuan He",
        "Dong Xing",
        "Zerui Li",
        "Zirong Zeng",
        "Yige Jiang",
        "Lufeng Cheng",
        "Ziyi Zhao",
        "Youran Sun",
        "Wesley Zheng",
        "Meiyuwang Zhang",
        "Ruyi Ji",
        "Xuechang Tu",
        "Zihan Zheng",
        "Zexing Chen",
        "Kangyang Zhou",
        "Zhaozi Wang",
        "Jingbang Chen",
        "Aleksandra Korolova",
        "Peter Henderson",
        "Pramod Viswanath",
        "Vijay Ganesh",
        "Saining Xie",
        "Zhuang Liu",
        "Dawn Song",
        "Sewon Min",
        "Ion Stoica",
        "Joseph E. Gonzalez",
        "Jingbo Shang",
        "Alvin Cheung"
      ],
      "abstract": "We introduce FrontierCS, a benchmark of 156 open-ended problems across diverse areas of computer science, designed and reviewed by experts, including CS PhDs and top-tier competitive programming participants and problem setters. Unlike existing benchmarks that focus on tasks with known optimal solutions, FrontierCS targets problems where the optimal solution is unknown, but the quality of a solution can be objectively evaluated. Models solve these tasks by implementing executable programs rather than outputting a direct answer. FrontierCS includes algorithmic problems, which are often NP-hard variants of competitive programming problems with objective partial scoring, and research problems with the same property. For each problem we provide an expert reference solution and an automatic evaluator. Combining open-ended design, measurable progress, and expert curation, FrontierCS provides a benchmark at the frontier of computer-science difficulty. Empirically, we find that frontier reasoning models still lag far behind human experts on both the algorithmic and research tracks, that increasing reasoning budgets alone does not close this gap, and that models often over-optimize for generating merely workable code instead of discovering high-quality algorithms and system designs.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.SE"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15699v1",
        "pdf": "https://arxiv.org/pdf/2512.15699v1"
      },
      "arxiv_id": "2512.15699v1",
      "comment": "Code with instruction: https://github.com/FrontierCS/Frontier-CS",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15693v1",
      "title": "Skyra: AI-Generated Video Detection via Grounded Artifact Reasoning",
      "authors": [
        "Yifei Li",
        "Wenzhao Zheng",
        "Yanran Zhang",
        "Runze Sun",
        "Yu Zheng",
        "Lei Chen",
        "Jie Zhou",
        "Jiwen Lu"
      ],
      "abstract": "The misuse of AI-driven video generation technologies has raised serious social concerns, highlighting the urgent need for reliable AI-generated video detectors. However, most existing methods are limited to binary classification and lack the necessary explanations for human interpretation. In this paper, we present Skyra, a specialized multimodal large language model (MLLM) that identifies human-perceivable visual artifacts in AI-generated videos and leverages them as grounded evidence for both detection and explanation. To support this objective, we construct ViF-CoT-4K for Supervised Fine-Tuning (SFT), which represents the first large-scale AI-generated video artifact dataset with fine-grained human annotations. We then develop a two-stage training strategy that systematically enhances our model's spatio-temporal artifact perception, explanation capability, and detection accuracy. To comprehensively evaluate Skyra, we introduce ViF-Bench, a benchmark comprising 3K high-quality samples generated by over ten state-of-the-art video generators. Extensive experiments demonstrate that Skyra surpasses existing methods across multiple benchmarks, while our evaluation yields valuable insights for advancing explainable AI-generated video detection.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15693v1",
        "pdf": "https://arxiv.org/pdf/2512.15693v1"
      },
      "arxiv_id": "2512.15693v1",
      "comment": "Project Page: https://github.com/JoeLeelyf/Skyra",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15692v1",
      "title": "mimic-video: Video-Action Models for Generalizable Robot Control Beyond VLAs",
      "authors": [
        "Jonas Pai",
        "Liam Achenbach",
        "Victoriano Montesinos",
        "Benedek Forrai",
        "Oier Mees",
        "Elvis Nava"
      ],
      "abstract": "Prevailing Vision-Language-Action Models (VLAs) for robotic manipulation are built upon vision-language backbones pretrained on large-scale, but disconnected static web data. As a result, despite improved semantic generalization, the policy must implicitly infer complex physical dynamics and temporal dependencies solely from robot trajectories. This reliance creates an unsustainable data burden, necessitating continuous, large-scale expert data collection to compensate for the lack of innate physical understanding. We contend that while vision-language pretraining effectively captures semantic priors, it remains blind to physical causality. A more effective paradigm leverages video to jointly capture semantics and visual dynamics during pretraining, thereby isolating the remaining task of low-level control. To this end, we introduce \\model, a novel Video-Action Model (VAM) that pairs a pretrained Internet-scale video model with a flow matching-based action decoder conditioned on its latent representations. The decoder serves as an Inverse Dynamics Model (IDM), generating low-level robot actions from the latent representation of video-space action plans. Our extensive evaluation shows that our approach achieves state-of-the-art performance on simulated and real-world robotic manipulation tasks, improving sample efficiency by 10x and convergence speed by 2x compared to traditional VLA architectures.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15692v1",
        "pdf": "https://arxiv.org/pdf/2512.15692v1"
      },
      "arxiv_id": "2512.15692v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15691v1",
      "title": "Multi-Modal Semantic Communication",
      "authors": [
        "Matin Mortaheb",
        "Erciyes Karakaya",
        "Sennur Ulukus"
      ],
      "abstract": "Semantic communication aims to transmit information most relevant to a task rather than raw data, offering significant gains in communication efficiency for applications such as telepresence, augmented reality, and remote sensing. Recent transformer-based approaches have used self-attention maps to identify informative regions within images, but they often struggle in complex scenes with multiple objects, where self-attention lacks explicit task guidance. To address this, we propose a novel Multi-Modal Semantic Communication framework that integrates text-based user queries to guide the information extraction process. Our proposed system employs a cross-modal attention mechanism that fuses visual features with language embeddings to produce soft relevance scores over the visual data. Based on these scores and the instantaneous channel bandwidth, we use an algorithm to transmit image patches at adaptive resolutions using independently trained encoder-decoder pairs, with total bitrate matching the channel capacity. At the receiver, the patches are reconstructed and combined to preserve task-critical information. This flexible and goal-driven design enables efficient semantic communication in complex and bandwidth-constrained environments.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.IT",
        "eess.SP",
        "eess.SY"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15691v1",
        "pdf": "https://arxiv.org/pdf/2512.15691v1"
      },
      "arxiv_id": "2512.15691v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15688v1",
      "title": "BashArena: A Control Setting for Highly Privileged AI Agents",
      "authors": [
        "Adam Kaufman",
        "James Lucassen",
        "Tyler Tracy",
        "Cody Rushing",
        "Aryan Bhatt"
      ],
      "abstract": "Future AI agents might run autonomously with elevated privileges. If these agents are misaligned, they might abuse these privileges to cause serious damage. The field of AI control develops techniques that make it harder for misaligned AIs to cause such damage, while preserving their usefulness. We introduce BashArena, a setting for studying AI control techniques in security-critical environments. BashArena contains 637 Linux system administration and infrastructure engineering tasks in complex, realistic environments, along with four sabotage objectives (execute malware, exfiltrate secrets, escalate privileges, and disable firewall) for a red team to target. We evaluate multiple frontier LLMs on their ability to complete tasks, perform sabotage undetected, and detect sabotage attempts. Claude Sonnet 4.5 successfully executes sabotage while evading monitoring by GPT-4.1 mini 26% of the time, at 4% trajectory-wise FPR. Our findings provide a baseline for designing more effective control protocols in BashArena. We release the dataset as a ControlArena setting and share our task generation pipeline.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CR",
        "cs.AI"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15688v1",
        "pdf": "https://arxiv.org/pdf/2512.15688v1"
      },
      "arxiv_id": "2512.15688v1",
      "comment": "The task generation pipeline can be found here: https://github.com/redwoodresearch/basharena_public",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15687v1",
      "title": "Can LLMs Guide Their Own Exploration? Gradient-Guided Reinforcement Learning for LLM Reasoning",
      "authors": [
        "Zhenwen Liang",
        "Sidi Lu",
        "Wenhao Yu",
        "Kishan Panaganti",
        "Yujun Zhou",
        "Haitao Mi",
        "Dong Yu"
      ],
      "abstract": "Reinforcement learning has become essential for strengthening the reasoning abilities of large language models, yet current exploration mechanisms remain fundamentally misaligned with how these models actually learn. Entropy bonuses and external semantic comparators encourage surface level variation but offer no guarantee that sampled trajectories differ in the update directions that shape optimization. We propose G2RL, a gradient guided reinforcement learning framework in which exploration is driven not by external heuristics but by the model own first order update geometry. For each response, G2RL constructs a sequence level feature from the model final layer sensitivity, obtainable at negligible cost from a standard forward pass, and measures how each trajectory would reshape the policy by comparing these features within a sampled group. Trajectories that introduce novel gradient directions receive a bounded multiplicative reward scaler, while redundant or off manifold updates are deemphasized, yielding a self referential exploration signal that is naturally aligned with PPO style stability and KL control. Across math and general reasoning benchmarks (MATH500, AMC, AIME24, AIME25, GPQA, MMLUpro) on Qwen3 base 1.7B and 4B models, G2RL consistently improves pass@1, maj@16, and pass@k over entropy based GRPO and external embedding methods. Analyzing the induced geometry, we find that G2RL expands exploration into substantially more orthogonal and often opposing gradient directions while maintaining semantic coherence, revealing that a policy own update space provides a far more faithful and effective basis for guiding exploration in large language model reinforcement learning.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15687v1",
        "pdf": "https://arxiv.org/pdf/2512.15687v1"
      },
      "arxiv_id": "2512.15687v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15685v1",
      "title": "A Multivariate Statistical Framework for Detection, Classification and Pre-localization of Anomalies in Water Distribution Networks",
      "authors": [
        "Oleg Melnikov",
        "Yurii Dorofieiev",
        "Yurii Shakhnovskiy",
        "Huy Truong",
        "Victoria Degeler"
      ],
      "abstract": "This paper presents a unified framework, for the detection, classification, and preliminary localization of anomalies in water distribution networks using multivariate statistical analysis. The approach, termed SICAMS (Statistical Identification and Classification of Anomalies in Mahalanobis Space), processes heterogeneous pressure and flow sensor data through a whitening transformation to eliminate spatial correlations among measurements. Based on the transformed data, the Hotelling's $T^2$ statistic is constructed, enabling the formulation of anomaly detection as a statistical hypothesis test of network conformity to normal operating conditions. It is shown that Hotelling's $T^2$ statistic can serve as an integral indicator of the overall \"health\" of the system, exhibiting correlation with total leakage volume, and thereby enabling approximate estimation of water losses via a regression model. A heuristic algorithm is developed to analyze the $T^2$ time series and classify detected anomalies into abrupt leaks, incipient leaks, and sensor malfunctions. Furthermore, a coarse leak localization method is proposed, which ranks sensors according to their statistical contribution and employs Laplacian interpolation to approximate the affected region within the network. Application of the proposed framework to the BattLeDIM L-Town benchmark dataset demonstrates high sensitivity and reliability in leak detection, maintaining robust performance even under multiple leaks. These capabilities make the method applicable to real-world operational environments without the need for a calibrated hydraulic model.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15685v1",
        "pdf": "https://arxiv.org/pdf/2512.15685v1"
      },
      "arxiv_id": "2512.15685v1",
      "comment": "48 pages, 18 figures, 3 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15684v1",
      "title": "High-Dimensional Partial Least Squares: Spectral Analysis and Fundamental Limitations",
      "authors": [
        "Victor Léger",
        "Florent Chatelain"
      ],
      "abstract": "Partial Least Squares (PLS) is a widely used method for data integration, designed to extract latent components shared across paired high-dimensional datasets. Despite decades of practical success, a precise theoretical understanding of its behavior in high-dimensional regimes remains limited. In this paper, we study a data integration model in which two high-dimensional data matrices share a low-rank common latent structure while also containing individual-specific components. We analyze the singular vectors of the associated cross-covariance matrix using tools from random matrix theory and derive asymptotic characterizations of the alignment between estimated and true latent directions. These results provide a quantitative explanation of the reconstruction performance of the PLS variant based on Singular Value Decomposition (PLS-SVD) and identify regimes where the method exhibits counter-intuitive or limiting behavior. Building on this analysis, we compare PLS-SVD with principal component analysis applied separately to each dataset and show its asymptotic superiority in detecting the common latent subspace. Overall, our results offer a comprehensive theoretical understanding of high-dimensional PLS-SVD, clarifying both its advantages and fundamental limitations.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "stat.ML",
        "cs.LG"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15684v1",
        "pdf": "https://arxiv.org/pdf/2512.15684v1"
      },
      "arxiv_id": "2512.15684v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15681v1",
      "title": "Radiomics and Clinical Features in Predictive Modelling of Brain Metastases Recurrence",
      "authors": [
        "Ines Faria",
        "Matheus Silva",
        "Crystian Saraiva",
        "Jose Soares",
        "Victor Alves"
      ],
      "abstract": "Brain metastases affect approximately between 20% and 40% of cancer patients and are commonly treated with radiotherapy or radiosurgery. Early prediction of recurrence following treatment could enable timely clinical intervention and improve patient outcomes. This study proposes an artificial intelligence based approach for predicting brain metastasis recurrence using multimodal imaging and clinical data. A retrospective cohort of 97 patients was collected, including Computed Tomography (CT) and Magnetic Resonance Imaging (MRI) acquired before treatment and at first follow-up, together with relevant clinical variables. Image preprocessing included CT windowing and artifact reduction, MRI enhancement, and multimodal CT MRI registration. After applying inclusion criteria, 53 patients were retained for analysis. Radiomics features were extracted from the imaging data, and delta radiomics was employed to characterize temporal changes between pre-treatment and follow-up scans. Multiple machine learning classifiers were trained and evaluated, including an analysis of discrepancies between treatment planning target volumes and delivered isodose volumes. Despite limitations related to sample size and class imbalance, the results demonstrate the feasibility of radiomics based models, namely ensemble models, for recurrence prediction and suggest a potential association between radiation dose discrepancies and recurrence risk. This work supports further investigation of AI-driven tools to assist clinical decision-making in brain metastasis management.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "eess.IV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15681v1",
        "pdf": "https://arxiv.org/pdf/2512.15681v1"
      },
      "arxiv_id": "2512.15681v1",
      "comment": "14 pages, 6 figures, 3 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15675v1",
      "title": "Stylized Synthetic Augmentation further improves Corruption Robustness",
      "authors": [
        "Georg Siedel",
        "Rojan Regmi",
        "Abhirami Anand",
        "Weijia Shao",
        "Silvia Vock",
        "Andrey Morozov"
      ],
      "abstract": "This paper proposes a training data augmentation pipeline that combines synthetic image data with neural style transfer in order to address the vulnerability of deep vision models to common corruptions. We show that although applying style transfer on synthetic images degrades their quality with respect to the common FID metric, these images are surprisingly beneficial for model training. We conduct a systematic empirical analysis of the effects of both augmentations and their key hyperparameters on the performance of image classifiers. Our results demonstrate that stylization and synthetic data complement each other well and can be combined with popular rule-based data augmentation techniques such as TrivialAugment, while not working with others. Our method achieves state-of-the-art corruption robustness on several small-scale image classification benchmarks, reaching 93.54%, 74.9% and 50.86% robust accuracy on CIFAR-10-C, CIFAR-100-C and TinyImageNet-C, respectively",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15675v1",
        "pdf": "https://arxiv.org/pdf/2512.15675v1"
      },
      "arxiv_id": "2512.15675v1",
      "comment": "Accepted at VISAPP 2026 conference",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15674v1",
      "title": "Activation Oracles: Training and Evaluating LLMs as General-Purpose Activation Explainers",
      "authors": [
        "Adam Karvonen",
        "James Chua",
        "Clément Dumas",
        "Kit Fraser-Taliente",
        "Subhash Kantamneni",
        "Julian Minder",
        "Euan Ong",
        "Arnab Sen Sharma",
        "Daniel Wen",
        "Owain Evans",
        "Samuel Marks"
      ],
      "abstract": "Large language model (LLM) activations are notoriously difficult to understand, with most existing techniques using complex, specialized methods for interpreting them. Recent work has proposed a simpler approach known as LatentQA: training LLMs to directly accept LLM activations as inputs and answer arbitrary questions about them in natural language. However, prior work has focused on narrow task settings for both training and evaluation. In this paper, we instead take a generalist perspective. We evaluate LatentQA-trained models, which we call Activation Oracles (AOs), in far out-of-distribution settings and examine how performance scales with training data diversity. We find that AOs can recover information fine-tuned into a model (e.g., biographical knowledge or malign propensities) that does not appear in the input text, despite never being trained with activations from a fine-tuned model. Our main evaluations are four downstream tasks where we can compare to prior white- and black-box techniques. We find that even narrowly-trained LatentQA models can generalize well, and that adding additional training datasets (such as classification tasks and a self-supervised context prediction task) yields consistent further improvements. Overall, our best AOs match or exceed prior white-box baselines on all four tasks and are the best method on 3 out of 4. These results suggest that diversified training to answer natural-language queries imparts a general capability to verbalize information about LLM activations.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15674v1",
        "pdf": "https://arxiv.org/pdf/2512.15674v1"
      },
      "arxiv_id": "2512.15674v1",
      "comment": "36 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15663v1",
      "title": "Explaining the Reasoning of Large Language Models Using Attribution Graphs",
      "authors": [
        "Chase Walker",
        "Rickard Ewetz"
      ],
      "abstract": "Large language models (LLMs) exhibit remarkable capabilities, yet their reasoning remains opaque, raising safety and trust concerns. Attribution methods, which assign credit to input features, have proven effective for explaining the decision making of computer vision models. From these, context attributions have emerged as a promising approach for explaining the behavior of autoregressive LLMs. However, current context attributions produce incomplete explanations by directly relating generated tokens to the prompt, discarding inter-generational influence in the process. To overcome these shortcomings, we introduce the Context Attribution via Graph Explanations (CAGE) framework. CAGE introduces an attribution graph: a directed graph that quantifies how each generation is influenced by both the prompt and all prior generations. The graph is constructed to preserve two properties-causality and row stochasticity. The attribution graph allows context attributions to be computed by marginalizing intermediate contributions along paths in the graph. Across multiple models, datasets, metrics, and methods, CAGE improves context attribution faithfulness, achieving average gains of up to 40%.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15663v1",
        "pdf": "https://arxiv.org/pdf/2512.15663v1"
      },
      "arxiv_id": "2512.15663v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15662v1",
      "title": "Stepwise Think-Critique: A Unified Framework for Robust and Interpretable LLM Reasoning",
      "authors": [
        "Jiaqi Xu",
        "Cuiling Lan",
        "Xuejin Chen",
        "Yan LU"
      ],
      "abstract": "Human beings solve complex problems through critical thinking, where reasoning and evaluation are intertwined to converge toward correct solutions. However, most existing large language models (LLMs) decouple reasoning from verification: they either generate reasoning without explicit self-checking or rely on external verifiers to detect errors post hoc. The former lacks immediate feedback, while the latter increases system complexity and hinders synchronized learning. Motivated by human critical thinking, we propose Stepwise Think-Critique (STC), a unified framework that interleaves reasoning and self-critique at each step within a single model. STC is trained with a hybrid reinforcement learning objective combining reasoning rewards and critique-consistency rewards to jointly optimize reasoning quality and self-evaluation. Experiments on mathematical reasoning benchmarks show that STC demonstrates strong critic-thinking capabilities and produces more interpretable reasoning traces, representing a step toward LLMs with built-in critical thinking.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15662v1",
        "pdf": "https://arxiv.org/pdf/2512.15662v1"
      },
      "arxiv_id": "2512.15662v1",
      "comment": "Under Review",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15661v1",
      "title": "Prospects for quantum advantage in machine learning from the representability of functions",
      "authors": [
        "Sergi Masot-Llima",
        "Elies Gil-Fuster",
        "Carlos Bravo-Prieto",
        "Jens Eisert",
        "and Tommaso Guaita"
      ],
      "abstract": "Demonstrating quantum advantage in machine learning tasks requires navigating a complex landscape of proposed models and algorithms. To bring clarity to this search, we introduce a framework that connects the structure of parametrized quantum circuits to the mathematical nature of the functions they can actually learn. Within this framework, we show how fundamental properties, like circuit depth and non-Clifford gate count, directly determine whether a model's output leads to efficient classical simulation or surrogation. We argue that this analysis uncovers common pathways to dequantization that underlie many existing simulation methods. More importantly, it reveals critical distinctions between models that are fully simulatable, those whose function space is classically tractable, and those that remain robustly quantum. This perspective provides a conceptual map of this landscape, clarifying how different models relate to classical simulability and pointing to where opportunities for quantum advantage may lie.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "quant-ph",
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "quant-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15661v1",
        "pdf": "https://arxiv.org/pdf/2512.15661v1"
      },
      "arxiv_id": "2512.15661v1",
      "comment": "21 pages, 6 figures, comments welcome",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15658v1",
      "title": "PPSEBM: An Energy-Based Model with Progressive Parameter Selection for Continual Learning",
      "authors": [
        "Xiaodi Li",
        "Dingcheng Li",
        "Rujun Gao",
        "Mahmoud Zamani",
        "Feng Mi",
        "Latifur Khan"
      ],
      "abstract": "Continual learning remains a fundamental challenge in machine learning, requiring models to learn from a stream of tasks without forgetting previously acquired knowledge. A major obstacle in this setting is catastrophic forgetting, where performance on earlier tasks degrades as new tasks are learned. In this paper, we introduce PPSEBM, a novel framework that integrates an Energy-Based Model (EBM) with Progressive Parameter Selection (PPS) to effectively address catastrophic forgetting in continual learning for natural language processing tasks. In PPSEBM, progressive parameter selection allocates distinct, task-specific parameters for each new task, while the EBM generates representative pseudo-samples from prior tasks. These generated samples actively inform and guide the parameter selection process, enhancing the model's ability to retain past knowledge while adapting to new tasks. Experimental results on diverse NLP benchmarks demonstrate that PPSEBM outperforms state-of-the-art continual learning methods, offering a promising and robust solution to mitigate catastrophic forgetting.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15658v1",
        "pdf": "https://arxiv.org/pdf/2512.15658v1"
      },
      "arxiv_id": "2512.15658v1",
      "comment": "10 pages, 3 figures, 2025 IEEE International Conference on Big Data (BigData)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15657v1",
      "title": "SoFlow: Solution Flow Models for One-Step Generative Modeling",
      "authors": [
        "Tianze Luo",
        "Haotian Yuan",
        "Zhuang Liu"
      ],
      "abstract": "The multi-step denoising process in diffusion and Flow Matching models causes major efficiency issues, which motivates research on few-step generation. We present Solution Flow Models (SoFlow), a framework for one-step generation from scratch. By analyzing the relationship between the velocity function and the solution function of the velocity ordinary differential equation (ODE), we propose a Flow Matching loss and a solution consistency loss to train our models. The Flow Matching loss allows our models to provide estimated velocity fields for Classifier-Free Guidance (CFG) during training, which improves generation performance. Notably, our consistency loss does not require the calculation of the Jacobian-vector product (JVP), a common requirement in recent works that is not well-optimized in deep learning frameworks like PyTorch. Experimental results indicate that, when trained from scratch using the same Diffusion Transformer (DiT) architecture and an equal number of training epochs, our models achieve better FID-50K scores than MeanFlow models on the ImageNet 256x256 dataset.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.CV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15657v1",
        "pdf": "https://arxiv.org/pdf/2512.15657v1"
      },
      "arxiv_id": "2512.15657v1",
      "comment": "Our code is available at https://github.com/zlab-princeton/SoFlow",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15649v1",
      "title": "VTCBench: Can Vision-Language Models Understand Long Context with Vision-Text Compression?",
      "authors": [
        "Hongbo Zhao",
        "Meng Wang",
        "Fei Zhu",
        "Wenzhuo Liu",
        "Bolin Ni",
        "Fanhu Zeng",
        "Gaofeng Meng",
        "Zhaoxiang Zhang"
      ],
      "abstract": "The computational and memory overheads associated with expanding the context window of LLMs severely limit their scalability. A noteworthy solution is vision-text compression (VTC), exemplified by frameworks like DeepSeek-OCR and Glyph, which convert long texts into dense 2D visual representations, thereby achieving token compression ratios of 3x-20x. However, the impact of this high information density on the core long-context capabilities of vision-language models (VLMs) remains under-investigated. To address this gap, we introduce the first benchmark for VTC and systematically assess the performance of VLMs across three long-context understanding settings: VTC-Retrieval, which evaluates the model's ability to retrieve and aggregate information; VTC-Reasoning, which requires models to infer latent associations to locate facts with minimal lexical overlap; and VTC-Memory, which measures comprehensive question answering within long-term dialogue memory. Furthermore, we establish the VTCBench-Wild to simulate diverse input scenarios.We comprehensively evaluate leading open-source and proprietary models on our benchmarks. The results indicate that, despite being able to decode textual information (e.g., OCR) well, most VLMs exhibit a surprisingly poor long-context understanding ability with VTC-compressed information, failing to capture long associations or dependencies in the context.This study provides a deep understanding of VTC and serves as a foundation for designing more efficient and scalable VLMs.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15649v1",
        "pdf": "https://arxiv.org/pdf/2512.15649v1"
      },
      "arxiv_id": "2512.15649v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15647v1",
      "title": "Hard Labels In! Rethinking the Role of Hard Labels in Mitigating Local Semantic Drift",
      "authors": [
        "Jiacheng Cui",
        "Bingkui Tong",
        "Xinyue Bi",
        "Xiaohan Zhao",
        "Jiacheng Liu",
        "Zhiqiang shen"
      ],
      "abstract": "Soft labels generated by teacher models have become a dominant paradigm for knowledge transfer and recent large-scale dataset distillation such as SRe2L, RDED, LPLD, offering richer supervision than conventional hard labels. However, we observe that when only a limited number of crops per image are used, soft labels are prone to local semantic drift: a crop may visually resemble another class, causing its soft embedding to deviate from the ground-truth semantics of the original image. This mismatch between local visual content and global semantic meaning introduces systematic errors and distribution misalignment between training and testing. In this work, we revisit the overlooked role of hard labels and show that, when appropriately integrated, they provide a powerful content-agnostic anchor to calibrate semantic drift. We theoretically characterize the emergence of drift under few soft-label supervision and demonstrate that hybridizing soft and hard labels restores alignment between visual content and semantic supervision. Building on this insight, we propose a new training paradigm, Hard Label for Alleviating Local Semantic Drift (HALD), which leverages hard labels as intermediate corrective signals while retaining the fine-grained advantages of soft labels. Extensive experiments on dataset distillation and large-scale conventional classification benchmarks validate our approach, showing consistent improvements in generalization. On ImageNet-1K, we achieve 42.7% with only 285M storage for soft labels, outperforming prior state-of-the-art LPLD by 9.0%. Our findings re-establish the importance of hard labels as a complementary tool, and call for a rethinking of their role in soft-label-dominated training.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15647v1",
        "pdf": "https://arxiv.org/pdf/2512.15647v1"
      },
      "arxiv_id": "2512.15647v1",
      "comment": "Code at: https://github.com/Jiacheng8/HALD",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15635v1",
      "title": "IC-Effect: Precise and Efficient Video Effects Editing via In-Context Learning",
      "authors": [
        "Yuanhang Li",
        "Yiren Song",
        "Junzhe Bai",
        "Xinran Liang",
        "Hu Yang",
        "Libiao Jin",
        "Qi Mao"
      ],
      "abstract": "We propose \\textbf{IC-Effect}, an instruction-guided, DiT-based framework for few-shot video VFX editing that synthesizes complex effects (\\eg flames, particles and cartoon characters) while strictly preserving spatial and temporal consistency. Video VFX editing is highly challenging because injected effects must blend seamlessly with the background, the background must remain entirely unchanged, and effect patterns must be learned efficiently from limited paired data. However, existing video editing models fail to satisfy these requirements. IC-Effect leverages the source video as clean contextual conditions, exploiting the contextual learning capability of DiT models to achieve precise background preservation and natural effect injection. A two-stage training strategy, consisting of general editing adaptation followed by effect-specific learning via Effect-LoRA, ensures strong instruction following and robust effect modeling. To further improve efficiency, we introduce spatiotemporal sparse tokenization, enabling high fidelity with substantially reduced computation. We also release a paired VFX editing dataset spanning $15$ high-quality visual styles. Extensive experiments show that IC-Effect delivers high-quality, controllable, and temporally consistent VFX editing, opening new possibilities for video creation.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15635v1",
        "pdf": "https://arxiv.org/pdf/2512.15635v1"
      },
      "arxiv_id": "2512.15635v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15634v1",
      "title": "How Much is Too Much? Exploring LoRA Rank Trade-offs for Retaining Knowledge and Domain Robustness",
      "authors": [
        "Darshita Rathore",
        "Vineet Kumar",
        "Chetna Bansal",
        "Anindya Moitra"
      ],
      "abstract": "Large language models are increasingly adapted to downstream tasks through fine-tuning. Full supervised fine-tuning (SFT) and parameter-efficient fine-tuning (PEFT) methods, such as Low-Rank Adaptation (LoRA), are two dominant approaches. While PEFT methods are widely used for their computational efficiency, the implications of their configurations (e.g., rank) remain under-explored in downstream Q&A tasks and generalisation. In this work, we perform a comprehensive evaluation across multiple reasoning and recall datasets, conducting a rank sweep to quantify the trade-off between SFT and PEFT. We also compare the accuracy of PEFT and SFT models across in-domain and out-of-domain adaptation, highlighting distinct generalisation behaviour and task-specific forgetting. We demonstrate that LoRA achieves competitive and in some cases superior performance compared to SFT, particularly on reasoning tasks at specific rank values. Additionally, we analyze the internal representations via spectral features and layer-wise attention structures, offering insights into representational drift and structural changes in attention patterns.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15634v1",
        "pdf": "https://arxiv.org/pdf/2512.15634v1"
      },
      "arxiv_id": "2512.15634v1",
      "comment": "Accepted at AACL IJCNLP 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15628v1",
      "title": "Learning continuous SOC-dependent thermal decomposition kinetics for Li-ion cathodes using KA-CRNNs",
      "authors": [
        "Benjamin C. Koenig",
        "Sili Deng"
      ],
      "abstract": "Thermal runaway in lithium-ion batteries is strongly influenced by the state of charge (SOC). Existing predictive models typically infer scalar kinetic parameters at a full SOC or a few discrete SOC levels, preventing them from capturing the continuous SOC dependence that governs exothermic behavior during abuse conditions. To address this, we apply the Kolmogorov-Arnold Chemical Reaction Neural Network (KA-CRNN) framework to learn continuous and realistic SOC-dependent exothermic cathode-electrolyte interactions. We apply a physics-encoded KA-CRNN to learn SOC-dependent kinetic parameters for cathode-electrolyte decomposition directly from differential scanning calorimetry (DSC) data. A mechanistically informed reaction pathway is embedded into the network architecture, enabling the activation energies, pre-exponential factors, enthalpies, and related parameters to be represented as continuous and fully interpretable functions of the SOC. The framework is demonstrated for NCA, NM, and NMA cathodes, yielding models that reproduce DSC heat-release features across all SOCs and provide interpretable insight into SOC-dependent oxygen-release and phase-transformation mechanisms. This approach establishes a foundation for extending kinetic parameter dependencies to additional environmental and electrochemical variables, supporting more accurate and interpretable thermal-runaway prediction and monitoring.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "physics.chem-ph",
        "cs.LG"
      ],
      "primary_category": "physics.chem-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15628v1",
        "pdf": "https://arxiv.org/pdf/2512.15628v1"
      },
      "arxiv_id": "2512.15628v1",
      "comment": "17 pages, 10 figures, 2 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15621v1",
      "title": "OccSTeP: Benchmarking 4D Occupancy Spatio-Temporal Persistence",
      "authors": [
        "Yu Zheng",
        "Jie Hu",
        "Kailun Yang",
        "Jiaming Zhang"
      ],
      "abstract": "Autonomous driving requires a persistent understanding of 3D scenes that is robust to temporal disturbances and accounts for potential future actions. We introduce a new concept of 4D Occupancy Spatio-Temporal Persistence (OccSTeP), which aims to address two tasks: (1) reactive forecasting: ''what will happen next'' and (2) proactive forecasting: \"what would happen given a specific future action\". For the first time, we create a new OccSTeP benchmark with challenging scenarios (e.g., erroneous semantic labels and dropped frames). To address this task, we propose OccSTeP-WM, a tokenizer-free world model that maintains a dense voxel-based scene state and incrementally fuses spatio-temporal context over time. OccSTeP-WM leverages a linear-complexity attention backbone and a recurrent state-space module to capture long-range spatial dependencies while continually updating the scene memory with ego-motion compensation. This design enables online inference and robust performance even when historical sensor input is missing or noisy. Extensive experiments prove the effectiveness of the OccSTeP concept and our OccSTeP-WM, yielding an average semantic mIoU of 23.70% (+6.56% gain) and occupancy IoU of 35.89% (+9.26% gain). The data and code will be open source at https://github.com/FaterYU/OccSTeP.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15621v1",
        "pdf": "https://arxiv.org/pdf/2512.15621v1"
      },
      "arxiv_id": "2512.15621v1",
      "comment": "16 pages, 5 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15618v1",
      "title": "Persistent feature reconstruction of resident space objects (RSOs) within inverse synthetic aperture radar (ISAR) images",
      "authors": [
        "Morgan Coe",
        "Gruffudd Jones",
        "Leah-Nani Alconcel",
        "Marina Gashinova"
      ],
      "abstract": "With the rapidly growing population of resident space objects (RSOs) in the near-Earth space environment, detailed information about their condition and capabilities is needed to provide Space Domain Awareness (SDA). Space-based sensing will enable inspection of RSOs at shorter ranges, independent of atmospheric effects, and from all aspects. The use of a sub-THz inverse synthetic aperture radar (ISAR) imaging and sensing system for SDA has been proposed in previous work, demonstrating the achievement of sub-cm image resolution at ranges of up to 100 km. This work focuses on recognition of external structures by use of sequential feature detection and tracking throughout the aligned ISAR images of the satellites. The Hough transform is employed to detect linear features, which are tracked throughout the sequence. ISAR imagery is generated via a metaheuristic simulator capable of modelling encounters for a variety of deployment scenarios. Initial frame-to-frame alignment is achieved through a series of affine transformations to facilitate later association between image features. A gradient-by-ratio method is used for edge detection within individual ISAR images, and edge magnitude and direction are subsequently used to inform a double-weighted Hough transform to detect features with high accuracy. Feature evolution during sequences of frames is analysed. It is shown that the use of feature tracking within sequences with the proposed approach will increase confidence in feature detection and classification, and an example use-case of robust detection of shadowing as a feature is presented.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "eess.SP"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15618v1",
        "pdf": "https://arxiv.org/pdf/2512.15618v1"
      },
      "arxiv_id": "2512.15618v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15617v1",
      "title": "Evaluating Metrics for Safety with LLM-as-Judges",
      "authors": [
        "Kester Clegg",
        "Richard Hawkins",
        "Ibrahim Habli",
        "Tom Lawton"
      ],
      "abstract": "LLMs (Large Language Models) are increasingly used in text processing pipelines to intelligently respond to a variety of inputs and generation tasks. This raises the possibility of replacing human roles that bottleneck existing information flows, either due to insufficient staff or process complexity. However, LLMs make mistakes and some processing roles are safety critical. For example, triaging post-operative care to patients based on hospital referral letters, or updating site access schedules in nuclear facilities for work crews. If we want to introduce LLMs into critical information flows that were previously performed by humans, how can we make them safe and reliable? Rather than make performative claims about augmented generation frameworks or graph-based techniques, this paper argues that the safety argument should focus on the type of evidence we get from evaluation points in LLM processes, particularly in frameworks that employ LLM-as-Judges (LaJ) evaluators. This paper argues that although we cannot get deterministic evaluations from many natural language processing tasks, by adopting a basket of weighted metrics it may be possible to lower the risk of errors within an evaluation, use context sensitivity to define error severity and design confidence thresholds that trigger human review of critical LaJ judgments when concordance across evaluators is low.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15617v1",
        "pdf": "https://arxiv.org/pdf/2512.15617v1"
      },
      "arxiv_id": "2512.15617v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15614v1",
      "title": "Behavior Tokens Speak Louder: Disentangled Explainable Recommendation with Behavior Vocabulary",
      "authors": [
        "Xinshun Feng",
        "Mingzhe Liu",
        "Yi Qiao",
        "Tongyu Zhu",
        "Leilei Sun",
        "Shuai Wang"
      ],
      "abstract": "Recent advances in explainable recommendations have explored the integration of language models to analyze natural language rationales for user-item interactions. Despite their potential, existing methods often rely on ID-based representations that obscure semantic meaning and impose structural constraints on language models, thereby limiting their applicability in open-ended scenarios. These challenges are intensified by the complex nature of real-world interactions, where diverse user intents are entangled and collaborative signals rarely align with linguistic semantics. To overcome these limitations, we propose BEAT, a unified and transferable framework that tokenizes user and item behaviors into discrete, interpretable sequences. We construct a behavior vocabulary via a vector-quantized autoencoding process that disentangles macro-level interests and micro-level intentions from graph-based representations. We then introduce multi-level semantic supervision to bridge the gap between behavioral signals and language space. A semantic alignment regularization mechanism is designed to embed behavior tokens directly into the input space of frozen language models. Experiments on three public datasets show that BEAT improves zero-shot recommendation performance while generating coherent and informative explanations. Further analysis demonstrates that our behavior tokens capture fine-grained semantics and offer a plug-and-play interface for integrating complex behavior patterns into large language models.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15614v1",
        "pdf": "https://arxiv.org/pdf/2512.15614v1"
      },
      "arxiv_id": "2512.15614v1",
      "comment": "accepted by AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15608v1",
      "title": "Robust Multi-view Camera Calibration from Dense Matches",
      "authors": [
        "Johannes Hägerlind",
        "Bao-Long Tran",
        "Urs Waldmann",
        "Per-Erik Forssén"
      ],
      "abstract": "Estimating camera intrinsics and extrinsics is a fundamental problem in computer vision, and while advances in structure-from-motion (SfM) have improved accuracy and robustness, open challenges remain. In this paper, we introduce a robust method for pose estimation and calibration. We consider a set of rigid cameras, each observing the scene from a different perspective, which is a typical camera setup in animal behavior studies and forensic analysis of surveillance footage. Specifically, we analyse the individual components in a structure-from-motion (SfM) pipeline, and identify design choices that improve accuracy. Our main contributions are: (1) we investigate how to best subsample the predicted correspondences from a dense matcher to leverage them in the estimation process. (2) We investigate selection criteria for how to add the views incrementally. In a rigorous quantitative evaluation, we show the effectiveness of our changes, especially for cameras with strong radial distortion (79.9% ours vs. 40.4 vanilla VGGT). Finally, we demonstrate our correspondence subsampling in a global SfM setting where we initialize the poses using VGGT. The proposed pipeline generalizes across a wide range of camera setups, and could thus become a useful tool for animal behavior and forensic analysis.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15608v1",
        "pdf": "https://arxiv.org/pdf/2512.15608v1"
      },
      "arxiv_id": "2512.15608v1",
      "comment": "This paper has been accepted for publication at the 21st International Conference on Computer Vision Theory and Applications (VISAPP 2026). Conference website: https://visapp.scitevents.org",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15606v1",
      "title": "A Teacher-Student Perspective on the Dynamics of Learning Near the Optimal Point",
      "authors": [
        "Carlos Couto",
        "José Mourão",
        "Mário A. T. Figueiredo",
        "Pedro Ribeiro"
      ],
      "abstract": "Near an optimal learning point of a neural network, the learning performance of gradient descent dynamics is dictated by the Hessian matrix of the loss function with respect to the network parameters. We characterize the Hessian eigenspectrum for some classes of teacher-student problems, when the teacher and student networks have matching weights, showing that the smaller eigenvalues of the Hessian determine long-time learning performance. For linear networks, we analytically establish that for large networks the spectrum asymptotically follows a convolution of a scaled chi-square distribution with a scaled Marchenko-Pastur distribution. We numerically analyse the Hessian spectrum for polynomial and other non-linear networks. Furthermore, we show that the rank of the Hessian matrix can be seen as an effective number of parameters for networks using polynomial activation functions. For a generic non-linear activation function, such as the error function, we empirically observe that the Hessian matrix is always full rank.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "stat.ML",
        "cs.LG"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15606v1",
        "pdf": "https://arxiv.org/pdf/2512.15606v1"
      },
      "arxiv_id": "2512.15606v1",
      "comment": "25 pages, 9 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15605v1",
      "title": "Autoregressive Language Models are Secretly Energy-Based Models: Insights into the Lookahead Capabilities of Next-Token Prediction",
      "authors": [
        "Mathieu Blondel",
        "Michael E. Sander",
        "Germain Vivier-Ardisson",
        "Tianlin Liu",
        "Vincent Roulet"
      ],
      "abstract": "Autoregressive models (ARMs) currently constitute the dominant paradigm for large language models (LLMs). Energy-based models (EBMs) represent another class of models, which have historically been less prevalent in LLM development, yet naturally characterize the optimal policy in post-training alignment. In this paper, we provide a unified view of these two model classes. Taking the chain rule of probability as a starting point, we establish an explicit bijection between ARMs and EBMs in function space, which we show to correspond to a special case of the soft Bellman equation in maximum entropy reinforcement learning. Building upon this bijection, we derive the equivalence between supervised learning of ARMs and EBMs. Furthermore, we analyze the distillation of EBMs into ARMs by providing theoretical error bounds. Our results provide insights into the ability of ARMs to plan ahead, despite being based on the next-token prediction paradigm.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15605v1",
        "pdf": "https://arxiv.org/pdf/2512.15605v1"
      },
      "arxiv_id": "2512.15605v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15603v1",
      "title": "Qwen-Image-Layered: Towards Inherent Editability via Layer Decomposition",
      "authors": [
        "Shengming Yin",
        "Zekai Zhang",
        "Zecheng Tang",
        "Kaiyuan Gao",
        "Xiao Xu",
        "Kun Yan",
        "Jiahao Li",
        "Yilei Chen",
        "Yuxiang Chen",
        "Heung-Yeung Shum",
        "Lionel M. Ni",
        "Jingren Zhou",
        "Junyang Lin",
        "Chenfei Wu"
      ],
      "abstract": "Recent visual generative models often struggle with consistency during image editing due to the entangled nature of raster images, where all visual content is fused into a single canvas. In contrast, professional design tools employ layered representations, allowing isolated edits while preserving consistency. Motivated by this, we propose \\textbf{Qwen-Image-Layered}, an end-to-end diffusion model that decomposes a single RGB image into multiple semantically disentangled RGBA layers, enabling \\textbf{inherent editability}, where each RGBA layer can be independently manipulated without affecting other content. To support variable-length decomposition, we introduce three key components: (1) an RGBA-VAE to unify the latent representations of RGB and RGBA images; (2) a VLD-MMDiT (Variable Layers Decomposition MMDiT) architecture capable of decomposing a variable number of image layers; and (3) a Multi-stage Training strategy to adapt a pretrained image generation model into a multilayer image decomposer. Furthermore, to address the scarcity of high-quality multilayer training images, we build a pipeline to extract and annotate multilayer images from Photoshop documents (PSD). Experiments demonstrate that our method significantly surpasses existing approaches in decomposition quality and establishes a new paradigm for consistent image editing. Our code and models are released on \\href{https://github.com/QwenLM/Qwen-Image-Layered}{https://github.com/QwenLM/Qwen-Image-Layered}",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15603v1",
        "pdf": "https://arxiv.org/pdf/2512.15603v1"
      },
      "arxiv_id": "2512.15603v1",
      "comment": "12 pages, 8 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15600v1",
      "title": "How Smoothing is N-simplicial Attention?",
      "authors": [
        "Alexandre Dussolle",
        "Pietro Liò"
      ],
      "abstract": "Going from pure Multilayer Perceptron (MLP) to a learnable graph message-passing mechanism at each layer has been foundational to state-of-the-art results, despite the computational trade-off (e.g. GATs or Transformers). To go a step further, in this work, we introduce N-simplicial attention, going from pairwise token similarity to higher-order interactions, and adapt it for Rotary Position Embeddings (RoPE). To help manage the increased complexity, we propose a cost-effective simplex selection enabling the model to focus its computation load onto the more task-sensitive interactions. Beyond these core mechanisms, we study how smoothing N-simplicial attention is by deriving a Lipschitz upper-bound and by demonstrating that by itself it also suffers from over-smoothing, despite opening the attention message-passing to higher-order interactions.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15600v1",
        "pdf": "https://arxiv.org/pdf/2512.15600v1"
      },
      "arxiv_id": "2512.15600v1",
      "comment": "arXiv preprint",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15599v1",
      "title": "FlexAvatar: Learning Complete 3D Head Avatars with Partial Supervision",
      "authors": [
        "Tobias Kirschstein",
        "Simon Giebenhain",
        "Matthias Nießner"
      ],
      "abstract": "We introduce FlexAvatar, a method for creating high-quality and complete 3D head avatars from a single image. A core challenge lies in the limited availability of multi-view data and the tendency of monocular training to yield incomplete 3D head reconstructions. We identify the root cause of this issue as the entanglement between driving signal and target viewpoint when learning from monocular videos. To address this, we propose a transformer-based 3D portrait animation model with learnable data source tokens, so-called bias sinks, which enables unified training across monocular and multi-view datasets. This design leverages the strengths of both data sources during inference: strong generalization from monocular data and full 3D completeness from multi-view supervision. Furthermore, our training procedure yields a smooth latent avatar space that facilitates identity interpolation and flexible fitting to an arbitrary number of input observations. In extensive evaluations on single-view, few-shot, and monocular avatar creation tasks, we verify the efficacy of FlexAvatar. Many existing methods struggle with view extrapolation while FlexAvatar generates complete 3D head avatars with realistic facial animations. Website: https://tobias-kirschstein.github.io/flexavatar/",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15599v1",
        "pdf": "https://arxiv.org/pdf/2512.15599v1"
      },
      "arxiv_id": "2512.15599v1",
      "comment": "Project website: https://tobias-kirschstein.github.io/flexavatar/ , Video: https://youtu.be/g8wxqYBlRGY",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15596v1",
      "title": "Corrective Diffusion Language Models",
      "authors": [
        "Shuibai Zhang",
        "Fred Zhangzhi Peng",
        "Yiheng Zhang",
        "Jin Pan",
        "Grigorios G. Chrysos"
      ],
      "abstract": "Diffusion language models are structurally well-suited for iterative error correction, as their non-causal denoising dynamics allow arbitrary positions in a sequence to be revised. However, standard masked diffusion language model (MDLM) training fails to reliably induce this behavior, as models often cannot identify unreliable tokens in a complete input, rendering confidence-guided refinement ineffective. We study corrective behavior in diffusion language models, defined as the ability to assign lower confidence to incorrect tokens and iteratively refine them while preserving correct content. We show that this capability is not induced by conventional masked diffusion objectives and propose a correction-oriented post-training principle that explicitly supervises visible incorrect tokens, enabling error-aware confidence and targeted refinement. To evaluate corrective behavior, we introduce the Code Revision Benchmark (CRB), a controllable and executable benchmark for assessing error localization and in-place correction. Experiments on code revision tasks and controlled settings demonstrate that models trained with our approach substantially outperform standard MDLMs in correction scenarios, while also improving pure completion performance. Our code is publicly available at https://github.com/zhangshuibai/CDLM.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15596v1",
        "pdf": "https://arxiv.org/pdf/2512.15596v1"
      },
      "arxiv_id": "2512.15596v1",
      "comment": "18 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15584v1",
      "title": "A Decision-Theoretic Approach for Managing Misalignment",
      "authors": [
        "Daniel A. Herrmann",
        "Abinav Chari",
        "Isabelle Qian",
        "Sree Sharvesh",
        "B. A. Levinstein"
      ],
      "abstract": "When should we delegate decisions to AI systems? While the value alignment literature has developed techniques for shaping AI values, less attention has been paid to how to determine, under uncertainty, when imperfect alignment is good enough to justify delegation. We argue that rational delegation requires balancing an agent's value (mis)alignment with its epistemic accuracy and its reach (the acts it has available). This paper introduces a formal, decision-theoretic framework to analyze this tradeoff precisely accounting for a principal's uncertainty about these factors. Our analysis reveals a sharp distinction between two delegation scenarios. First, universal delegation (trusting an agent with any problem) demands near-perfect value alignment and total epistemic trust, conditions rarely met in practice. Second, we show that context-specific delegation can be optimal even with significant misalignment. An agent's superior accuracy or expanded reach may grant access to better overall decision problems, making delegation rational in expectation. We develop a novel scoring framework to quantify this ex ante decision. Ultimately, our work provides a principled method for determining when an AI is aligned enough for a given context, shifting the focus from achieving perfect alignment to managing the risks and rewards of delegation under uncertainty.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI",
        "cs.GT"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15584v1",
        "pdf": "https://arxiv.org/pdf/2512.15584v1"
      },
      "arxiv_id": "2512.15584v1",
      "comment": "Second Conference of the International Association for Safe and Ethical Artificial Intelligence (IASEAI '26)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15581v1",
      "title": "IMKD: Intensity-Aware Multi-Level Knowledge Distillation for Camera-Radar Fusion",
      "authors": [
        "Shashank Mishra",
        "Karan Patil",
        "Didier Stricker",
        "Jason Rambach"
      ],
      "abstract": "High-performance Radar-Camera 3D object detection can be achieved by leveraging knowledge distillation without using LiDAR at inference time. However, existing distillation methods typically transfer modality-specific features directly to each sensor, which can distort their unique characteristics and degrade their individual strengths. To address this, we introduce IMKD, a radar-camera fusion framework based on multi-level knowledge distillation that preserves each sensor's intrinsic characteristics while amplifying their complementary strengths. IMKD applies a three-stage, intensity-aware distillation strategy to enrich the fused representation across the architecture: (1) LiDAR-to-Radar intensity-aware feature distillation to enhance radar representations with fine-grained structural cues, (2) LiDAR-to-Fused feature intensity-guided distillation to selectively highlight useful geometry and depth information at the fusion level, fostering complementarity between the modalities rather than forcing them to align, and (3) Camera-Radar intensity-guided fusion mechanism that facilitates effective feature alignment and calibration. Extensive experiments on the nuScenes benchmark show that IMKD reaches 67.0% NDS and 61.0% mAP, outperforming all prior distillation-based radar-camera fusion methods. Our code and models are available at https://github.com/dfki-av/IMKD/.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15581v1",
        "pdf": "https://arxiv.org/pdf/2512.15581v1"
      },
      "arxiv_id": "2512.15581v1",
      "comment": "Accepted at IEEE/CVF Winter Conference on Applications of Computer Vision (WACV) 2026. 22 pages, 8 figures. Includes supplementary material",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15577v1",
      "title": "MoonSeg3R: Monocular Online Zero-Shot Segment Anything in 3D with Reconstructive Foundation Priors",
      "authors": [
        "Zhipeng Du",
        "Duolikun Danier",
        "Jan Eric Lenssen",
        "Hakan Bilen"
      ],
      "abstract": "In this paper, we focus on online zero-shot monocular 3D instance segmentation, a novel practical setting where existing approaches fail to perform because they rely on posed RGB-D sequences. To overcome this limitation, we leverage CUT3R, a recent Reconstructive Foundation Model (RFM), to provide reliable geometric priors from a single RGB stream. We propose MoonSeg3R, which introduces three key components: (1) a self-supervised query refinement module with spatial-semantic distillation that transforms segmentation masks from 2D visual foundation models (VFMs) into discriminative 3D queries; (2) a 3D query index memory that provides temporal consistency by retrieving contextual queries; and (3) a state-distribution token from CUT3R that acts as a mask identity descriptor to strengthen cross-frame fusion. Experiments on ScanNet200 and SceneNN show that MoonSeg3R is the first method to enable online monocular 3D segmentation and achieves performance competitive with state-of-the-art RGB-D-based systems. Code and models will be released.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15577v1",
        "pdf": "https://arxiv.org/pdf/2512.15577v1"
      },
      "arxiv_id": "2512.15577v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15574v1",
      "title": "Joint Learning of Unsupervised Multi-view Feature and Instance Co-selection with Cross-view Imputation",
      "authors": [
        "Yuxin Cai",
        "Yanyong Huang",
        "Jinyuan Chang",
        "Dongjie Wang",
        "Tianrui Li",
        "Xiaoyi Jiang"
      ],
      "abstract": "Feature and instance co-selection, which aims to reduce both feature dimensionality and sample size by identifying the most informative features and instances, has attracted considerable attention in recent years. However, when dealing with unlabeled incomplete multi-view data, where some samples are missing in certain views, existing methods typically first impute the missing data and then concatenate all views into a single dataset for subsequent co-selection. Such a strategy treats co-selection and missing data imputation as two independent processes, overlooking potential interactions between them. The inter-sample relationships gleaned from co-selection can aid imputation, which in turn enhances co-selection performance. Additionally, simply merging multi-view data fails to capture the complementary information among views, ultimately limiting co-selection effectiveness. To address these issues, we propose a novel co-selection method, termed Joint learning of Unsupervised multI-view feature and instance Co-selection with cross-viEw imputation (JUICE). JUICE first reconstructs incomplete multi-view data using available observations, bringing missing data recovery and feature and instance co-selection together in a unified framework. Then, JUICE leverages cross-view neighborhood information to learn inter-sample relationships and further refine the imputation of missing values during reconstruction. This enables the selection of more representative features and instances. Extensive experiments demonstrate that JUICE outperforms state-of-the-art methods.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15574v1",
        "pdf": "https://arxiv.org/pdf/2512.15574v1"
      },
      "arxiv_id": "2512.15574v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15567v1",
      "title": "Evaluating Large Language Models in Scientific Discovery",
      "authors": [
        "Zhangde Song",
        "Jieyu Lu",
        "Yuanqi Du",
        "Botao Yu",
        "Thomas M. Pruyn",
        "Yue Huang",
        "Kehan Guo",
        "Xiuzhe Luo",
        "Yuanhao Qu",
        "Yi Qu",
        "Yinkai Wang",
        "Haorui Wang",
        "Jeff Guo",
        "Jingru Gan",
        "Parshin Shojaee",
        "Di Luo",
        "Andres M Bran",
        "Gen Li",
        "Qiyuan Zhao",
        "Shao-Xiong Lennon Luo",
        "Yuxuan Zhang",
        "Xiang Zou",
        "Wanru Zhao",
        "Yifan F. Zhang",
        "Wucheng Zhang",
        "Shunan Zheng",
        "Saiyang Zhang",
        "Sartaaj Takrim Khan",
        "Mahyar Rajabi-Kochi",
        "Samantha Paradi-Maropakis",
        "Tony Baltoiu",
        "Fengyu Xie",
        "Tianyang Chen",
        "Kexin Huang",
        "Weiliang Luo",
        "Meijing Fang",
        "Xin Yang",
        "Lixue Cheng",
        "Jiajun He",
        "Soha Hassoun",
        "Xiangliang Zhang",
        "Wei Wang",
        "Chandan K. Reddy",
        "Chao Zhang",
        "Zhiling Zheng",
        "Mengdi Wang",
        "Le Cong",
        "Carla P. Gomes",
        "Chang-Yu Hsieh",
        "Aditya Nandy",
        "Philippe Schwaller",
        "Heather J. Kulik",
        "Haojun Jia",
        "Huan Sun",
        "Seyed Mohamad Moosavi",
        "Chenru Duan"
      ],
      "abstract": "Large language models (LLMs) are increasingly applied to scientific research, yet prevailing science benchmarks probe decontextualized knowledge and overlook the iterative reasoning, hypothesis generation, and observation interpretation that drive scientific discovery. We introduce a scenario-grounded benchmark that evaluates LLMs across biology, chemistry, materials, and physics, where domain experts define research projects of genuine interest and decompose them into modular research scenarios from which vetted questions are sampled. The framework assesses models at two levels: (i) question-level accuracy on scenario-tied items and (ii) project-level performance, where models must propose testable hypotheses, design simulations or experiments, and interpret results. Applying this two-phase scientific discovery evaluation (SDE) framework to state-of-the-art LLMs reveals a consistent performance gap relative to general science benchmarks, diminishing return of scaling up model sizes and reasoning, and systematic weaknesses shared across top-tier models from different providers. Large performance variation in research scenarios leads to changing choices of the best performing model on scientific discovery projects evaluated, suggesting all current LLMs are distant to general scientific \"superintelligence\". Nevertheless, LLMs already demonstrate promise in a great variety of scientific discovery projects, including cases where constituent scenario scores are low, highlighting the role of guided exploration and serendipity in discovery. This SDE framework offers a reproducible benchmark for discovery-relevant evaluation of LLMs and charts practical paths to advance their development toward scientific discovery.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI",
        "cond-mat.mtrl-sci",
        "cs.LG",
        "physics.chem-ph"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15567v1",
        "pdf": "https://arxiv.org/pdf/2512.15567v1"
      },
      "arxiv_id": "2512.15567v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15564v1",
      "title": "On the Effectiveness of Textual Prompting with Lightweight Fine-Tuning for SAM3 Remote Sensing Segmentation",
      "authors": [
        "Roni Blushtein-Livnon",
        "Osher Rafaeli",
        "David Ioffe",
        "Amir Boger",
        "Karen Sandberg Esquenazi",
        "Tal Svoray"
      ],
      "abstract": "Remote sensing (RS) image segmentation is constrained by the limited availability of annotated data and a gap between overhead imagery and natural images used to train foundational models. This motivates effective adaptation under limited supervision. SAM3 concept-driven framework generates masks from textual prompts without requiring task-specific modifications, which may enable this adaptation. We evaluate SAM3 for RS imagery across four target types, comparing textual, geometric, and hybrid prompting strategies, under lightweight fine-tuning scales with increasing supervision, alongside zero-shot inference. Results show that combining semantic and geometric cues yields the highest performance across targets and metrics. Text-only prompting exhibits the lowest performance, with marked score gaps for irregularly shaped targets, reflecting limited semantic alignment between SAM3 textual representations and their overhead appearances. Nevertheless, textual prompting with light fine-tuning offers a practical performance-effort trade-off for geometrically regular and visually salient targets. Across targets, performance improves between zero-shot inference and fine-tuning, followed by diminishing returns as the supervision scale increases. Namely, a modest geometric annotation effort is sufficient for effective adaptation. A persistent gap between Precision and IoU further indicates that under-segmentation and boundary inaccuracies remain prevalent error patterns in RS tasks, particularly for irregular and less prevalent targets.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15564v1",
        "pdf": "https://arxiv.org/pdf/2512.15564v1"
      },
      "arxiv_id": "2512.15564v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15560v1",
      "title": "GRAN-TED: Generating Robust, Aligned, and Nuanced Text Embedding for Diffusion Models",
      "authors": [
        "Bozhou Li",
        "Sihan Yang",
        "Yushuo Guan",
        "Ruichuan An",
        "Xinlong Chen",
        "Yang Shi",
        "Pengfei Wan",
        "Wentao Zhang",
        "Yuanxing zhang"
      ],
      "abstract": "The text encoder is a critical component of text-to-image and text-to-video diffusion models, fundamentally determining the semantic fidelity of the generated content. However, its development has been hindered by two major challenges: the lack of an efficient evaluation framework that reliably predicts downstream generation performance, and the difficulty of effectively adapting pretrained language models for visual synthesis. To address these issues, we introduce GRAN-TED, a paradigm to Generate Robust, Aligned, and Nuanced Text Embeddings for Diffusion models. Our contribution is twofold. First, we propose TED-6K, a novel text-only benchmark that enables efficient and robust assessment of an encoder's representational quality without requiring costly end-to-end model training. We demonstrate that performance on TED-6K, standardized via a lightweight, unified adapter, strongly correlates with an encoder's effectiveness in downstream generation tasks. Second, guided by this validated framework, we develop a superior text encoder using a novel two-stage training paradigm. This process involves an initial fine-tuning stage on a Multimodal Large Language Model for better visual representation, followed by a layer-wise weighting method to extract more nuanced and potent text features. Our experiments show that the resulting GRAN-TED encoder not only achieves state-of-the-art performance on TED-6K but also leads to demonstrable performance gains in text-to-image and text-to-video generation. Our code is available at the following link: https://anonymous.4open.science/r/GRAN-TED-4FCC/.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15560v1",
        "pdf": "https://arxiv.org/pdf/2512.15560v1"
      },
      "arxiv_id": "2512.15560v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15549v1",
      "title": "Photonics-Enhanced Graph Convolutional Networks",
      "authors": [
        "Yuan Wang",
        "Oleksandr Kyriienko"
      ],
      "abstract": "Photonics can offer a hardware-native route for machine learning (ML). However, efficient deployment of photonics-enhanced ML requires hybrid workflows that integrate optical processing with conventional CPU/GPU based neural network architectures. Here, we propose such a workflow that combines photonic positional embeddings (PEs) with advanced graph ML models. We introduce a photonics-based method that augments graph convolutional networks (GCNs) with PEs derived from light propagation on synthetic frequency lattices whose couplings match the input graph. We simulate propagation and readout to obtain internode intensity correlation matrices, which are used as PEs in GCNs to provide global structural information. Evaluated on Long Range Graph Benchmark molecular datasets, the method outperforms baseline GCNs with Laplacian based PEs, achieving $6.3\\%$ lower mean absolute error for regression and $2.3\\%$ higher average precision for classification tasks using a two-layer GCN as a baseline. When implemented in high repetition rate photonic hardware, correlation measurements can enable fast feature generation by bypassing digital simulation of PEs. Our results show that photonic PEs improve GCN performance and support optical acceleration of graph ML.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "physics.optics",
        "cond-mat.dis-nn",
        "cs.LG",
        "quant-ph"
      ],
      "primary_category": "physics.optics",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15549v1",
        "pdf": "https://arxiv.org/pdf/2512.15549v1"
      },
      "arxiv_id": "2512.15549v1",
      "comment": "12 pages, 6 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15548v1",
      "title": "An Open-Source Framework for Quality-Assured Smartphone-Based Visible Light Iris Recognition",
      "authors": [
        "Naveenkumar G. Venkataswamy",
        "Yu Liu",
        "Soumyabrata Dey",
        "Stephanie Schuckers",
        "Masudul H. Imtiaz"
      ],
      "abstract": "Smartphone-based iris recognition in the visible spectrum (VIS) offers a low-cost and accessible biometric alternative but remains a challenge due to lighting variability, pigmentation effects, and the limited adoption of standardized capture protocols. In this work, we present CUVIRIS, a dataset of 752 ISO/IEC 29794-6 compliant iris images from 47 subjects, collected with a custom Android application that enforces real-time framing, sharpness assessment, and quality feedback. We further introduce LightIrisNet, a MobileNetV3-based multi-task segmentation model optimized for on-device deployment. In addition, we adapt IrisFormer, a transformer-based matcher, to the VIS domain. We evaluate OSIRIS and IrisFormer under a standardized protocol and benchmark against published CNN baselines reported in prior work. On CUVIRIS, the open-source OSIRIS system achieves a TAR of 97.9% at FAR = 0.01 (EER = 0.76%), while IrisFormer, trained only on the UBIRIS.v2 dataset, achieves an EER of 0.057\\%. To support reproducibility, we release the Android application, LightIrisNet, trained IrisFormer weights, and a subset of the CUVIRIS dataset. These results show that, with standardized acquisition and VIS-adapted lightweight models, accurate iris recognition on commodity smartphones is feasible under controlled conditions, bringing this modality closer to practical deployment.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "eess.IV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15548v1",
        "pdf": "https://arxiv.org/pdf/2512.15548v1"
      },
      "arxiv_id": "2512.15548v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15543v1",
      "title": "Nine Years of Pediatric Iris Recognition: Evidence for Biometric Permanence",
      "authors": [
        "Naveenkumar G Venkataswamy",
        "Masudul H Imtiaz",
        "Stephanie Schuckers"
      ],
      "abstract": "Biometric permanence in pediatric populations remains poorly understood despite widespread deployment of iris recognition for children in national identity programs such as India's Aadhaar and trusted traveler programs like Canada's NEXUS. This study presents a comprehensive longitudinal evaluation of pediatric iris recognition, analyzing 276 subjects enrolled between ages 4-12 and followed up to nine years through adolescence. Using 18,318 near-infrared iris images acquired semi-annually, we evaluated commercial (VeriEye) and open-source (OpenIris) systems through linear mixed-effects models that disentangle enrollment age, developmental maturation, and elapsed time while controlling for image quality and physiological factors. False non-match rates remained below 0.5% across the nine-year period for both matchers using pediatric-calibrated thresholds, approaching adult-level performance. However, we reveal significant algorithm-dependent temporal behaviors: VeriEye's apparent decline reflects developmental confounding across enrollment cohorts rather than genuine template aging, while OpenIris exhibits modest but genuine temporal aging (0.5 standard deviations over eight years). Image quality and pupil dilation constancy dominated longitudinal performance, with dilation effects reaching 3.0-3.5 standard deviations, substantially exceeding temporal factors. Failures concentrated in 9.4% of subjects with persistent acquisition challenges rather than accumulating with elapsed time, confirming acquisition conditions as the primary limitation. These findings justify extending conservative re-enrollment policies, potentially to 10-12 year validity periods for high-quality enrollments at ages 7+, and demonstrate iris recognition remains viable throughout childhood and adolescence with proper imaging control.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "eess.IV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15543v1",
        "pdf": "https://arxiv.org/pdf/2512.15543v1"
      },
      "arxiv_id": "2512.15543v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15542v1",
      "title": "BLANKET: Anonymizing Faces in Infant Video Recordings",
      "authors": [
        "Ditmar Hadera",
        "Jan Cech",
        "Miroslav Purkrabek",
        "Matej Hoffmann"
      ],
      "abstract": "Ensuring the ethical use of video data involving human subjects, particularly infants, requires robust anonymization methods. We propose BLANKET (Baby-face Landmark-preserving ANonymization with Keypoint dEtection consisTency), a novel approach designed to anonymize infant faces in video recordings while preserving essential facial attributes. Our method comprises two stages. First, a new random face, compatible with the original identity, is generated via inpainting using a diffusion model. Second, the new identity is seamlessly incorporated into each video frame through temporally consistent face swapping with authentic expression transfer. The method is evaluated on a dataset of short video recordings of babies and is compared to the popular anonymization method, DeepPrivacy2. Key metrics assessed include the level of de-identification, preservation of facial attributes, impact on human pose estimation (as an example of a downstream task), and presence of artifacts. Both methods alter the identity, and our method outperforms DeepPrivacy2 in all other respects. The code is available as an easy-to-use anonymization demo at https://github.com/ctu-vras/blanket-infant-face-anonym.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15542v1",
        "pdf": "https://arxiv.org/pdf/2512.15542v1"
      },
      "arxiv_id": "2512.15542v1",
      "comment": "Project website: https://github.com/ctu-vras/blanket-infant-face-anonym",
      "journal_ref": "2025 IEEE International Conference on Development and Learning (ICDL)",
      "has_code": true
    },
    {
      "id": "2512.15538v1",
      "title": "Tracking Temporal Dynamics of Vector Sets with Gaussian Process",
      "authors": [
        "Taichi Aida",
        "Mamoru Komachi",
        "Toshinobu Ogiso",
        "Hiroya Takamura",
        "Daichi Mochihashi"
      ],
      "abstract": "Understanding the temporal evolution of sets of vectors is a fundamental challenge across various domains, including ecology, crime analysis, and linguistics. For instance, ecosystem structures evolve due to interactions among plants, herbivores, and carnivores; the spatial distribution of crimes shifts in response to societal changes; and word embedding vectors reflect cultural and semantic trends over time. However, analyzing such time-varying sets of vectors is challenging due to their complicated structures, which also evolve over time. In this work, we propose a novel method for modeling the distribution underlying each set of vectors using infinite-dimensional Gaussian processes. By approximating the latent function in the Gaussian process with Random Fourier Features, we obtain compact and comparable vector representations over time. This enables us to track and visualize temporal transitions of vector sets in a low-dimensional space. We apply our method to both sociological data (crime distributions) and linguistic data (word embeddings), demonstrating its effectiveness in capturing temporal dynamics. Our results show that the proposed approach provides interpretable and robust representations, offering a powerful framework for analyzing structural changes in temporally indexed vector sets across diverse domains.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.CL"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15538v1",
        "pdf": "https://arxiv.org/pdf/2512.15538v1"
      },
      "arxiv_id": "2512.15538v1",
      "comment": "Work in Progress",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15532v1",
      "title": "A Conditioned UNet for Music Source Separation",
      "authors": [
        "Ken O'Hanlon",
        "Basil Woods",
        "Lin Wang",
        "Mark Sandler"
      ],
      "abstract": "In this paper we propose a conditioned UNet for Music Source Separation (MSS). MSS is generally performed by multi-output neural networks, typically UNets, with each output representing a particular stem from a predefined instrument vocabulary. In contrast, conditioned MSS networks accept an audio query related to a stem of interest alongside the signal from which that stem is to be extracted. Thus, a strict vocabulary is not required and this enables more realistic tasks in MSS. The potential of conditioned approaches for such tasks has been somewhat hidden due to a lack of suitable data, an issue recently addressed with the MoisesDb dataset. A recent method, Banquet, employs this dataset with promising results seen on larger vocabularies. Banquet uses Bandsplit RNN rather than a UNet and the authors state that UNets should not be suitable for conditioned MSS. We counter this argument and propose QSCNet, a novel conditioned UNet for MSS that integrates network conditioning elements in the Sparse Compressed Network for MSS. We find QSCNet to outperform Banquet by over 1dB SNR on a couple of MSS tasks, while using less than half the number of parameters.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.SD",
        "cs.AI",
        "cs.LG",
        "eess.AS"
      ],
      "primary_category": "cs.SD",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15532v1",
        "pdf": "https://arxiv.org/pdf/2512.15532v1"
      },
      "arxiv_id": "2512.15532v1",
      "comment": "",
      "journal_ref": "Proceedings of the 17th International Symposium on Computer Music Multidisciplinary Research (2025) 322-333",
      "has_code": false
    },
    {
      "id": "2512.15531v1",
      "title": "An Efficient and Effective Encoder Model for Vision and Language Tasks in the Remote Sensing Domain",
      "authors": [
        "João Daniel Silva",
        "Joao Magalhaes",
        "Devis Tuia",
        "Bruno Martins"
      ],
      "abstract": "The remote sensing community has recently seen the emergence of methods based on Large Vision and Language Models (LVLMs) that can address multiple tasks at the intersection of computer vision and natural language processing. To fully exploit the potential of such models, a significant focus has been given to the collection of large amounts of training data that cover multiple remote sensing-specific tasks, such as image captioning or visual question answering. However, the cost of using and training LVLMs is high, due to the large number of parameters. While multiple parameter-efficient adaptation techniques have been explored, the computational costs of training and inference with these models can remain prohibitive for most institutions. In this work, we explore the use of encoder-only architectures and propose a model that can effectively address multi-task learning while remaining compact in terms of the number of parameters. In particular, our model tackles combinations of tasks that are not typically explored in a unified model: the generation of text from remote sensing images and cross-modal retrieval. The results of our GeoMELT model - named from Multi-task Efficient Learning Transformer - in established benchmarks confirm the efficacy and efficiency of the proposed approach.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15531v1",
        "pdf": "https://arxiv.org/pdf/2512.15531v1"
      },
      "arxiv_id": "2512.15531v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15528v1",
      "title": "EmoCaliber: Advancing Reliable Visual Emotion Comprehension via Confidence Verbalization and Calibration",
      "authors": [
        "Daiqing Wu",
        "Dongbao Yang",
        "Can Ma. Yu Zhou"
      ],
      "abstract": "Visual Emotion Comprehension (VEC) aims to infer sentiment polarities or emotion categories from affective cues embedded in images. In recent years, Multimodal Large Language Models (MLLMs) have established a popular paradigm in VEC, leveraging their generalizability to unify VEC tasks defined under diverse emotion taxonomies. While this paradigm achieves notable success, it typically formulates VEC as a deterministic task, requiring the model to output a single, definitive emotion label for each image. Such a formulation insufficiently accounts for the inherent subjectivity of emotion perception, overlooking alternative interpretations that may be equally plausible to different viewers. To address this limitation, we propose equipping MLLMs with capabilities to verbalize their confidence in emotion predictions. This additional signal provides users with an estimate of both the plausibility of alternative interpretations and the MLLMs' self-assessed competence, thereby enhancing reliability in practice. Building on this insight, we introduce a three-stage training framework that progressively endows with structured reasoning, teaches to verbalize confidence, and calibrates confidence expression, culminating in EmoCaliber, a confidence-aware MLLM for VEC. Through fair and comprehensive evaluations on the unified benchmark VECBench, EmoCaliber demonstrates overall superiority against existing methods in both emotion prediction and confidence estimation. These results validate the effectiveness of our approach and mark a feasible step toward more reliable VEC systems. Project page: https://github.com/wdqqdw/EmoCaliber.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15528v1",
        "pdf": "https://arxiv.org/pdf/2512.15528v1"
      },
      "arxiv_id": "2512.15528v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15526v1",
      "title": "BERT and CNN integrated Neural Collaborative Filtering for Recommender Systems",
      "authors": [
        "Abdullah Al Munem",
        "Sumona Yeasmin",
        "Mohammad Rezwanul Huq"
      ],
      "abstract": "Every day, a significant number of users visit the internet for different needs. The owners of a website generate profits from the user interaction with the contents or items of the website. A robust recommendation system can increase user interaction with a website by recommending items according to the user's unique preferences. BERT and CNN-integrated neural collaborative filtering (NCF) have been proposed for the recommendation system in this experiment. The proposed model takes inputs from the user and item profile and finds the user's interest. This model can handle numeric, categorical, and image data to extract the latent features from the inputs. The model is trained and validated on a small sample of the MovieLens dataset for 25 epochs. The same dataset has been used to train and validate a simple NCF and a BERT-based NCF model and compared with the proposed model. The proposed model outperformed those two baseline models. The obtained result for the proposed model is 0.72 recall and 0.486 Hit Ratio @ 10 for 799 users on the MovieLens dataset. This experiment concludes that considering both categorical and image data can improve the performance of a recommendation system.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.IR",
        "cs.AI"
      ],
      "primary_category": "cs.IR",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15526v1",
        "pdf": "https://arxiv.org/pdf/2512.15526v1"
      },
      "arxiv_id": "2512.15526v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15524v1",
      "title": "DeX-Portrait: Disentangled and Expressive Portrait Animation via Explicit and Latent Motion Representations",
      "authors": [
        "Yuxiang Shi",
        "Zhe Li",
        "Yanwen Wang",
        "Hao Zhu",
        "Xun Cao",
        "Ligang Liu"
      ],
      "abstract": "Portrait animation from a single source image and a driving video is a long-standing problem. Recent approaches tend to adopt diffusion-based image/video generation models for realistic and expressive animation. However, none of these diffusion models realizes high-fidelity disentangled control between the head pose and facial expression, hindering applications like expression-only or pose-only editing and animation. To address this, we propose DeX-Portrait, a novel approach capable of generating expressive portrait animation driven by disentangled pose and expression signals. Specifically, we represent the pose as an explicit global transformation and the expression as an implicit latent code. First, we design a powerful motion trainer to learn both pose and expression encoders for extracting precise and decomposed driving signals. Then we propose to inject the pose transformation into the diffusion model through a dual-branch conditioning mechanism, and the expression latent through cross attention. Finally, we design a progressive hybrid classifier-free guidance for more faithful identity consistency. Experiments show that our method outperforms state-of-the-art baselines on both animation quality and disentangled controllability.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15524v1",
        "pdf": "https://arxiv.org/pdf/2512.15524v1"
      },
      "arxiv_id": "2512.15524v1",
      "comment": "Projectpage: https://syx132.github.io/DeX-Portrait/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15521v1",
      "title": "Autonomous Pressure Control in MuVacAS via Deep Reinforcement Learning and Deep Learning Surrogate Models",
      "authors": [
        "Guillermo Rodriguez-Llorente",
        "Galo Gallardo",
        "Rodrigo Morant Navascués",
        "Nikita Khvatkin Petrovsky",
        "Anderson Sabogal",
        "Roberto Gómez-Espinosa Martín"
      ],
      "abstract": "The development of nuclear fusion requires materials that can withstand extreme conditions. The IFMIF-DONES facility, a high-power particle accelerator, is being designed to qualify these materials. A critical testbed for its development is the MuVacAS prototype, which replicates the final segment of the accelerator beamline. Precise regulation of argon gas pressure within its ultra-high vacuum chamber is vital for this task. This work presents a fully data-driven approach for autonomous pressure control. A Deep Learning Surrogate Model, trained on real operational data, emulates the dynamics of the argon injection system. This high-fidelity digital twin then serves as a fast-simulation environment to train a Deep Reinforcement Learning agent. The results demonstrate that the agent successfully learns a control policy that maintains gas pressure within strict operational limits despite dynamic disturbances. This approach marks a significant step toward the intelligent, autonomous control systems required for the demanding next-generation particle accelerator facilities.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "physics.acc-ph",
        "cs.LG"
      ],
      "primary_category": "physics.acc-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15521v1",
        "pdf": "https://arxiv.org/pdf/2512.15521v1"
      },
      "arxiv_id": "2512.15521v1",
      "comment": "13 pages, 7 figures, included in Machine Learning and the Physical Sciences Workshop @ NeurIPS 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15512v1",
      "title": "VAAS: Vision-Attention Anomaly Scoring for Image Manipulation Detection in Digital Forensics",
      "authors": [
        "Opeyemi Bamigbade",
        "Mark Scanlon",
        "John Sheppard"
      ],
      "abstract": "Recent advances in AI-driven image generation have introduced new challenges for verifying the authenticity of digital evidence in forensic investigations. Modern generative models can produce visually consistent forgeries that evade traditional detectors based on pixel or compression artefacts. Most existing approaches also lack an explicit measure of anomaly intensity, which limits their ability to quantify the severity of manipulation. This paper introduces Vision-Attention Anomaly Scoring (VAAS), a novel dual-module framework that integrates global attention-based anomaly estimation using Vision Transformers (ViT) with patch-level self-consistency scoring derived from SegFormer embeddings. The hybrid formulation provides a continuous and interpretable anomaly score that reflects both the location and degree of manipulation. Evaluations on the DF2023 and CASIA v2.0 datasets demonstrate that VAAS achieves competitive F1 and IoU performance, while enhancing visual explainability through attention-guided anomaly maps. The framework bridges quantitative detection with human-understandable reasoning, supporting transparent and reliable image integrity assessment. The source code for all experiments and corresponding materials for reproducing the results are available open source.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.MM"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15512v1",
        "pdf": "https://arxiv.org/pdf/2512.15512v1"
      },
      "arxiv_id": "2512.15512v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15508v1",
      "title": "Off The Grid: Detection of Primitives for Feed-Forward 3D Gaussian Splatting",
      "authors": [
        "Arthur Moreau",
        "Richard Shaw",
        "Michal Nazarczuk",
        "Jisu Shin",
        "Thomas Tanay",
        "Zhensong Zhang",
        "Songcen Xu",
        "Eduardo Pérez-Pellitero"
      ],
      "abstract": "Feed-forward 3D Gaussian Splatting (3DGS) models enable real-time scene generation but are hindered by suboptimal pixel-aligned primitive placement, which relies on a dense, rigid grid and limits both quality and efficiency. We introduce a new feed-forward architecture that detects 3D Gaussian primitives at a sub-pixel level, replacing the pixel grid with an adaptive, \"Off The Grid\" distribution. Inspired by keypoint detection, our multi-resolution decoder learns to distribute primitives across image patches. This module is trained end-to-end with a 3D reconstruction backbone using self-supervised learning. Our resulting pose-free model generates photorealistic scenes in seconds, achieving state-of-the-art novel view synthesis for feed-forward models. It outperforms competitors while using far fewer primitives, demonstrating a more accurate and efficient allocation that captures fine details and reduces artifacts. Moreover, we observe that by learning to render 3D Gaussians, our 3D reconstruction backbone improves camera pose estimation, suggesting opportunities to train these foundational models without labels.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15508v1",
        "pdf": "https://arxiv.org/pdf/2512.15508v1"
      },
      "arxiv_id": "2512.15508v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15505v1",
      "title": "The LUMirage: An independent evaluation of zero-shot performance in the LUMIR challenge",
      "authors": [
        "Rohit Jena",
        "Pratik Chaudhari",
        "James C. Gee"
      ],
      "abstract": "The LUMIR challenge represents an important benchmark for evaluating deformable image registration methods on large-scale neuroimaging data. While the challenge demonstrates that modern deep learning methods achieve competitive accuracy on T1-weighted MRI, it also claims exceptional zero-shot generalization to unseen contrasts and resolutions, assertions that contradict established understanding of domain shift in deep learning. In this paper, we perform an independent re-evaluation of these zero-shot claims using rigorous evaluation protocols while addressing potential sources of instrumentation bias. Our findings reveal a more nuanced picture: (1) deep learning methods perform comparably to iterative optimization on in-distribution T1w images and even on human-adjacent species (macaque), demonstrating improved task understanding; (2) however, performance degrades significantly on out-of-distribution contrasts (T2, T2*, FLAIR), with Cohen's d scores ranging from 0.7-1.5, indicating substantial practical impact on downstream clinical workflows; (3) deep learning methods face scalability limitations on high-resolution data, failing to run on 0.6 mm isotropic images, while iterative methods benefit from increased resolution; and (4) deep methods exhibit high sensitivity to preprocessing choices. These results align with the well-established literature on domain shift and suggest that claims of universal zero-shot superiority require careful scrutiny. We advocate for evaluation protocols that reflect practical clinical and research workflows rather than conditions that may inadvertently favor particular method classes.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "eess.IV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15505v1",
        "pdf": "https://arxiv.org/pdf/2512.15505v1"
      },
      "arxiv_id": "2512.15505v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15503v1",
      "title": "Attention in Motion: Secure Platooning via Transformer-based Misbehavior Detection",
      "authors": [
        "Konstantinos Kalogiannis",
        "Ahmed Mohamed Hussain",
        "Hexu Li",
        "Panos Papadimitratos"
      ],
      "abstract": "Vehicular platooning promises transformative improvements in transportation efficiency and safety through the coordination of multi-vehicle formations enabled by Vehicle-to-Everything (V2X) communication. However, the distributed nature of platoon coordination creates security vulnerabilities, allowing authenticated vehicles to inject falsified kinematic data, compromise operational stability, and pose a threat to passenger safety. Traditional misbehaviour detection approaches, which rely on plausibility checks and statistical methods, suffer from high False Positive (FP) rates and cannot capture the complex temporal dependencies inherent in multi-vehicle coordination dynamics. We present Attention In Motion (AIMformer), a transformer-based framework specifically tailored for real-time misbehaviour detection in vehicular platoons with edge deployment capabilities. AIMformer leverages multi-head self-attention mechanisms to simultaneously capture intra-vehicle temporal dynamics and inter-vehicle spatial correlations. It incorporates global positional encoding with vehicle-specific temporal offsets to handle join/exit maneuvers. We propose a Precision-Focused (BCE) loss function that penalizes FPs to meet the requirements of safety-critical vehicular systems. Extensive evaluation across 4 platoon controllers, multiple attack vectors, and diverse mobility scenarios demonstrates superior performance ($\\geq$ 0.93) compared to state-of-the-art baseline architectures. A comprehensive deployment analysis utilizing TensorFlow Lite (TFLite), Open Neural Network Exchange (ONNX), and TensorRT achieves sub-millisecond inference latency, making it suitable for real-time operation on resource-constrained edge platforms. Hence, validating AIMformer is viable for both in-vehicle and roadside infrastructure deployment.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CR",
        "cs.AI",
        "cs.LG",
        "cs.NI"
      ],
      "primary_category": "cs.CR",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15503v1",
        "pdf": "https://arxiv.org/pdf/2512.15503v1"
      },
      "arxiv_id": "2512.15503v1",
      "comment": "17 pages, 10 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15493v1",
      "title": "Soft Geometric Inductive Bias for Object Centric Dynamics",
      "authors": [
        "Hampus Linander",
        "Conor Heins",
        "Alexander Tschantz",
        "Marco Perin",
        "Christopher Buckley"
      ],
      "abstract": "Equivariance is a powerful prior for learning physical dynamics, yet exact group equivariance can degrade performance if the symmetries are broken. We propose object-centric world models built with geometric algebra neural networks, providing a soft geometric inductive bias. Our models are evaluated using simulated environments of 2d rigid body dynamics with static obstacles, where we train for next-step predictions autoregressively. For long-horizon rollouts we show that the soft inductive bias of our models results in better performance in terms of physical fidelity compared to non-equivariant baseline models. The approach complements recent soft-equivariance ideas and aligns with the view that simple, well-chosen priors can yield robust generalization. These results suggest that geometric algebra offers an effective middle ground between hand-crafted physics and unstructured deep nets, delivering sample-efficient dynamics models for multi-object scenes.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15493v1",
        "pdf": "https://arxiv.org/pdf/2512.15493v1"
      },
      "arxiv_id": "2512.15493v1",
      "comment": "8 pages, 11 figures; 6 pages supplementary material",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15492v1",
      "title": "Robustness and uncertainty: two complementary aspects of the reliability of the predictions of a classifier",
      "authors": [
        "Adrián Detavernier",
        "Jasper De Bock"
      ],
      "abstract": "We consider two conceptually different approaches for assessing the reliability of the individual predictions of a classifier: Robustness Quantification (RQ) and Uncertainty Quantification (UQ). We compare both approaches on a number of benchmark datasets and show that there is no clear winner between the two, but that they are complementary and can be combined to obtain a hybrid approach that outperforms both RQ and UQ. As a byproduct of our approach, for each dataset, we also obtain an assessment of the relative importance of uncertainty and robustness as sources of unreliability.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15492v1",
        "pdf": "https://arxiv.org/pdf/2512.15492v1"
      },
      "arxiv_id": "2512.15492v1",
      "comment": "workshop paper (not published)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15489v1",
      "title": "Nemotron-Math: Efficient Long-Context Distillation of Mathematical Reasoning from Multi-Mode Supervision",
      "authors": [
        "Wei Du",
        "Shubham Toshniwal",
        "Branislav Kisacanin",
        "Sadegh Mahdavi",
        "Ivan Moshkov",
        "George Armstrong",
        "Stephen Ge",
        "Edgar Minasyan",
        "Feng Chen",
        "Igor Gitman"
      ],
      "abstract": "High-quality mathematical reasoning supervision requires diverse reasoning styles, long-form traces, and effective tool integration, capabilities that existing datasets provide only in limited form. Leveraging the multi-mode generation ability of gpt-oss-120b, we introduce Nemotron-Math, a large-scale mathematical reasoning dataset containing 7.5M solution traces across high, medium, and low reasoning modes, each available both with and without Python tool-integrated reasoning (TIR).\n  The dataset integrates 85K curated AoPS problems with 262K community-sourced StackExchange-Math problems, combining structured competition tasks with diverse real-world mathematical queries. We conduct controlled evaluations to assess the dataset quality.\n  Nemotron-Math consistently outperforms the original OpenMathReasoning on matched AoPS problems. Incorporating StackExchange-Math substantially improves robustness and generalization, especially on HLE-Math, while preserving accuracy on math competition benchmarks.\n  To support efficient long-context training, we develop a sequential bucketed strategy that accelerates 128K context-length fine-tuning by 2--3$\\times$ without significant accuracy loss. Overall, Nemotron-Math enables state-of-the-art performance, including 100\\% maj@16 accuracy on AIME 2024 and 2025 with Python TIR.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15489v1",
        "pdf": "https://arxiv.org/pdf/2512.15489v1"
      },
      "arxiv_id": "2512.15489v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15488v1",
      "title": "RUMPL: Ray-Based Transformers for Universal Multi-View 2D to 3D Human Pose Lifting",
      "authors": [
        "Seyed Abolfazl Ghasemzadeh",
        "Alexandre Alahi",
        "Christophe De Vleeschouwer"
      ],
      "abstract": "Estimating 3D human poses from 2D images remains challenging due to occlusions and projective ambiguity. Multi-view learning-based approaches mitigate these issues but often fail to generalize to real-world scenarios, as large-scale multi-view datasets with 3D ground truth are scarce and captured under constrained conditions. To overcome this limitation, recent methods rely on 2D pose estimation combined with 2D-to-3D pose lifting trained on synthetic data. Building on our previous MPL framework, we propose RUMPL, a transformer-based 3D pose lifter that introduces a 3D ray-based representation of 2D keypoints. This formulation makes the model independent of camera calibration and the number of views, enabling universal deployment across arbitrary multi-view configurations without retraining or fine-tuning. A new View Fusion Transformer leverages learned fused-ray tokens to aggregate information along rays, further improving multi-view consistency. Extensive experiments demonstrate that RUMPL reduces MPJPE by up to 53% compared to triangulation and over 60% compared to transformer-based image-representation baselines. Results on new benchmarks, including in-the-wild multi-view and multi-person datasets, confirm its robustness and scalability. The framework's source code is available at https://github.com/aghasemzadeh/OpenRUMPL",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15488v1",
        "pdf": "https://arxiv.org/pdf/2512.15488v1"
      },
      "arxiv_id": "2512.15488v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15483v1",
      "title": "Multi-stage Bayesian optimisation for dynamic decision-making in self-driving labs",
      "authors": [
        "Luca Torresi",
        "Pascal Friederich"
      ],
      "abstract": "Self-driving laboratories (SDLs) are combining recent technological advances in robotics, automation, and machine learning based data analysis and decision-making to perform autonomous experimentation toward human-directed goals without requiring any direct human intervention. SDLs are successfully used in materials science, chemistry, and beyond, to optimise processes, materials, and devices in a systematic and data-efficient way. At present, the most widely used algorithm to identify the most informative next experiment is Bayesian optimisation. While relatively simple to apply to a wide range of optimisation problems, standard Bayesian optimisation relies on a fixed experimental workflow with a clear set of optimisation parameters and one or more measurable objective functions. This excludes the possibility of making on-the-fly decisions about changes in the planned sequence of operations and including intermediate measurements in the decision-making process. Therefore, many real-world experiments need to be adapted and simplified to be converted to the common setting in self-driving labs. In this paper, we introduce an extension to Bayesian optimisation that allows flexible sampling of multi-stage workflows and makes optimal decisions based on intermediate observables, which we call proxy measurements. We systematically compare the advantage of taking into account proxy measurements over conventional Bayesian optimisation, in which only the final measurement is observed. We find that over a wide range of scenarios, proxy measurements yield a substantial improvement, both in the time to find good solutions and in the overall optimality of found solutions. This not only paves the way to use more complex and thus more realistic experimental workflows in autonomous labs but also to smoothly combine simulations and experiments in the next generation of SDLs.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15483v1",
        "pdf": "https://arxiv.org/pdf/2512.15483v1"
      },
      "arxiv_id": "2512.15483v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15480v1",
      "title": "Evaluation of deep learning architectures for wildlife object detection: A comparative study of ResNet and Inception",
      "authors": [
        "Malach Obisa Amonga",
        "Benard Osero",
        "Edna Too"
      ],
      "abstract": "Wildlife object detection plays a vital role in biodiversity conservation, ecological monitoring, and habitat protection. However, this task is often challenged by environmental variability, visual similarities among species, and intra-class diversity. This study investigates the effectiveness of two individual deep learning architectures ResNet-101 and Inception v3 for wildlife object detection under such complex conditions. The models were trained and evaluated on a wildlife image dataset using a standardized preprocessing approach, which included resizing images to a maximum dimension of 800 pixels, converting them to RGB format, and transforming them into PyTorch tensors. A ratio of 70:30 training and validation split was used for model development. The ResNet-101 model achieved a classification accuracy of 94% and a mean Average Precision (mAP) of 0.91, showing strong performance in extracting deep hierarchical features. The Inception v3 model performed slightly better, attaining a classification accuracy of 95% and a mAP of 0.92, attributed to its efficient multi-scale feature extraction through parallel convolutions. Despite the strong results, both models exhibited challenges when detecting species with similar visual characteristics or those captured under poor lighting and occlusion. Nonetheless, the findings confirm that both ResNet-101 and Inception v3 are effective models for wildlife object detection tasks and provide a reliable foundation for conservation-focused computer vision applications.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15480v1",
        "pdf": "https://arxiv.org/pdf/2512.15480v1"
      },
      "arxiv_id": "2512.15480v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15469v1",
      "title": "Metanetworks as Regulatory Operators: Learning to Edit for Requirement Compliance",
      "authors": [
        "Ioannis Kalogeropoulos",
        "Giorgos Bouritsas",
        "Yannis Panagakis"
      ],
      "abstract": "As machine learning models are increasingly deployed in high-stakes settings, e.g. as decision support systems in various societal sectors or in critical infrastructure, designers and auditors are facing the need to ensure that models satisfy a wider variety of requirements (e.g. compliance with regulations, fairness, computational constraints) beyond performance. Although most of them are the subject of ongoing studies, typical approaches face critical challenges: post-processing methods tend to compromise performance, which is often counteracted by fine-tuning or, worse, training from scratch, an often time-consuming or even unavailable strategy. This raises the following question: \"Can we efficiently edit models to satisfy requirements, without sacrificing their utility?\" In this work, we approach this with a unifying framework, in a data-driven manner, i.e. we learn to edit neural networks (NNs), where the editor is an NN itself - a graph metanetwork - and editing amounts to a single inference step. In particular, the metanetwork is trained on NN populations to minimise an objective consisting of two terms: the requirement to be enforced and the preservation of the NN's utility. We experiment with diverse tasks (the data minimisation principle, bias mitigation and weight pruning) improving the trade-offs between performance, requirement satisfaction and time efficiency compared to popular post-processing or re-training alternatives.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15469v1",
        "pdf": "https://arxiv.org/pdf/2512.15469v1"
      },
      "arxiv_id": "2512.15469v1",
      "comment": "23 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15468v1",
      "title": "How Do Semantically Equivalent Code Transformations Impact Membership Inference on LLMs for Code?",
      "authors": [
        "Hua Yang",
        "Alejandro Velasco",
        "Thanh Le-Cong",
        "Md Nazmul Haque",
        "Bowen Xu",
        "Denys Poshyvanyk"
      ],
      "abstract": "The success of large language models for code relies on vast amounts of code data, including public open-source repositories, such as GitHub, and private, confidential code from companies. This raises concerns about intellectual property compliance and the potential unauthorized use of license-restricted code. While membership inference (MI) techniques have been proposed to detect such unauthorized usage, their effectiveness can be undermined by semantically equivalent code transformation techniques, which modify code syntax while preserving semantic.\n  In this work, we systematically investigate whether semantically equivalent code transformation rules might be leveraged to evade MI detection. The results reveal that model accuracy drops by only 1.5% in the worst case for each rule, demonstrating that transformed datasets can effectively serve as substitutes for fine-tuning. Additionally, we find that one of the rules (RenameVariable) reduces MI success by 10.19%, highlighting its potential to obscure the presence of restricted code. To validate these findings, we conduct a causal analysis confirming that variable renaming has the strongest causal effect in disrupting MI detection. Notably, we find that combining multiple transformations does not further reduce MI effectiveness. Our results expose a critical loophole in license compliance enforcement for training large language models for code, showing that MI detection can be substantially weakened by transformation-based obfuscation techniques.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.SE",
        "cs.AI",
        "cs.CR"
      ],
      "primary_category": "cs.SE",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15468v1",
        "pdf": "https://arxiv.org/pdf/2512.15468v1"
      },
      "arxiv_id": "2512.15468v1",
      "comment": "13 pages, 3 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15466v1",
      "title": "On Assessing the Relevance of Code Reviews Authored by Generative Models",
      "authors": [
        "Robert Heumüller",
        "Frank Ortmeier"
      ],
      "abstract": "The use of large language models like ChatGPT in code review offers promising efficiency gains but also raises concerns about correctness and safety. Existing evaluation methods for code review generation either rely on automatic comparisons to a single ground truth, which fails to capture the variability of human perspectives, or on subjective assessments of \"usefulness\", a highly ambiguous concept. We propose a novel evaluation approach based on what we call multi-subjective ranking. Using a dataset of 280 self-contained code review requests and corresponding comments from CodeReview StackExchange, multiple human judges ranked the quality of ChatGPT-generated comments alongside the top human responses from the platform. Results show that ChatGPT's comments were ranked significantly better than human ones, even surpassing StackExchange's accepted answers. Going further, our proposed method motivates and enables more meaningful assessments of generative AI's performance in code review, while also raising awareness of potential risks of unchecked integration into review processes.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.SE",
        "cs.AI"
      ],
      "primary_category": "cs.SE",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15466v1",
        "pdf": "https://arxiv.org/pdf/2512.15466v1"
      },
      "arxiv_id": "2512.15466v1",
      "comment": "Replication Package: https://github.com/robert-heumueller-ovgu/repl-generative-review-relevance",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15462v1",
      "title": "Intent-Driven UAM Rescheduling",
      "authors": [
        "Jeongseok Kim",
        "Kangjin Kim"
      ],
      "abstract": "Due to the restricted resources, efficient scheduling in vertiports has received much more attention in the field of Urban Air Mobility (UAM). For the scheduling problem, we utilize a Mixed Integer Linear Programming (MILP), which is often formulated in a resource-restricted project scheduling problem (RCPSP). In this paper, we show our approach to handle both dynamic operation requirements and vague rescheduling requests from humans. Particularly, we utilize a three-valued logic for interpreting ambiguous user intents and a decision tree, proposing a newly integrated system that combines Answer Set Programming (ASP) and MILP. This integrated framework optimizes schedules and supports human inputs transparently. With this system, we provide a robust structure for explainable, adaptive UAM scheduling.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI",
        "cs.HC",
        "cs.SC"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15462v1",
        "pdf": "https://arxiv.org/pdf/2512.15462v1"
      },
      "arxiv_id": "2512.15462v1",
      "comment": "18 pages, 2 figures, AAIML submitted",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15460v1",
      "title": "From Risk to Resilience: Towards Assessing and Mitigating the Risk of Data Reconstruction Attacks in Federated Learning",
      "authors": [
        "Xiangrui Xu",
        "Zhize Li",
        "Yufei Han",
        "Bin Wang",
        "Jiqiang Liu",
        "Wei Wang"
      ],
      "abstract": "Data Reconstruction Attacks (DRA) pose a significant threat to Federated Learning (FL) systems by enabling adversaries to infer sensitive training data from local clients. Despite extensive research, the question of how to characterize and assess the risk of DRAs in FL systems remains unresolved due to the lack of a theoretically-grounded risk quantification framework. In this work, we address this gap by introducing Invertibility Loss (InvLoss) to quantify the maximum achievable effectiveness of DRAs for a given data instance and FL model. We derive a tight and computable upper bound for InvLoss and explore its implications from three perspectives. First, we show that DRA risk is governed by the spectral properties of the Jacobian matrix of exchanged model updates or feature embeddings, providing a unified explanation for the effectiveness of defense methods. Second, we develop InvRE, an InvLoss-based DRA risk estimator that offers attack method-agnostic, comprehensive risk evaluation across data instances and model architectures. Third, we propose two adaptive noise perturbation defenses that enhance FL privacy without harming classification accuracy. Extensive experiments on real-world datasets validate our framework, demonstrating its potential for systematic DRA risk evaluation and mitigation in FL systems.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15460v1",
        "pdf": "https://arxiv.org/pdf/2512.15460v1"
      },
      "arxiv_id": "2512.15460v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15445v1",
      "title": "ST-DETrack: Identity-Preserving Branch Tracking in Entangled Plant Canopies via Dual Spatiotemporal Evidence",
      "authors": [
        "Yueqianji Chen",
        "Kevin Williams",
        "John H. Doonan",
        "Paolo Remagnino",
        "Jo Hepworth"
      ],
      "abstract": "Automated extraction of individual plant branches from time-series imagery is essential for high-throughput phenotyping, yet it remains computationally challenging due to non-rigid growth dynamics and severe identity fragmentation within entangled canopies. To overcome these stage-dependent ambiguities, we propose ST-DETrack, a spatiotemporal-fusion dual-decoder network designed to preserve branch identity from budding to flowering. Our architecture integrates a spatial decoder, which leverages geometric priors such as position and angle for early-stage tracking, with a temporal decoder that exploits motion consistency to resolve late-stage occlusions. Crucially, an adaptive gating mechanism dynamically shifts reliance between these spatial and temporal cues, while a biological constraint based on negative gravitropism mitigates vertical growth ambiguities. Validated on a Brassica napus dataset, ST-DETrack achieves a Branch Matching Accuracy (BMA) of 93.6%, significantly outperforming spatial and temporal baselines by 28.9 and 3.3 percentage points, respectively. These results demonstrate the method's robustness in maintaining long-term identity consistency amidst complex, dynamic plant architectures.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15445v1",
        "pdf": "https://arxiv.org/pdf/2512.15445v1"
      },
      "arxiv_id": "2512.15445v1",
      "comment": "Under Review at IEEE Transactions on Image Processing",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15442v1",
      "title": "Copyright Infringement Risk Reduction via Chain-of-Thought and Task Instruction Prompting",
      "authors": [
        "Neeraj Sarna",
        "Yuanyuan Li",
        "Michael von Gablenz"
      ],
      "abstract": "Large scale text-to-image generation models can memorize and reproduce their training dataset. Since the training dataset often contains copyrighted material, reproduction of training dataset poses a copyright infringement risk, which could result in legal liabilities and financial losses for both the AI user and the developer. The current works explores the potential of chain-of-thought and task instruction prompting in reducing copyrighted content generation. To this end, we present a formulation that combines these two techniques with two other copyright mitigation strategies: a) negative prompting, and b) prompt re-writing. We study the generated images in terms their similarity to a copyrighted image and their relevance of the user input. We present numerical experiments on a variety of models and provide insights on the effectiveness of the aforementioned techniques for varying model complexity.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15442v1",
        "pdf": "https://arxiv.org/pdf/2512.15442v1"
      },
      "arxiv_id": "2512.15442v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15439v1",
      "title": "Double Horizon Model-Based Policy Optimization",
      "authors": [
        "Akihiro Kubo",
        "Paavo Parmas",
        "Shin Ishii"
      ],
      "abstract": "Model-based reinforcement learning (MBRL) reduces the cost of real-environment sampling by generating synthetic trajectories (called rollouts) from a learned dynamics model. However, choosing the length of the rollouts poses two dilemmas: (1) Longer rollouts better preserve on-policy training but amplify model bias, indicating the need for an intermediate horizon to mitigate distribution shift (i.e., the gap between on-policy and past off-policy samples). (2) Moreover, a longer model rollout may reduce value estimation bias but raise the variance of policy gradients due to backpropagation through multiple steps, implying another intermediate horizon for stable gradient estimates. However, these two optimal horizons may differ. To resolve this conflict, we propose Double Horizon Model-Based Policy Optimization (DHMBPO), which divides the rollout procedure into a long \"distribution rollout\" (DR) and a short \"training rollout\" (TR). The DR generates on-policy state samples for mitigating distribution shift. In contrast, the short TR leverages differentiable transitions to offer accurate value gradient estimation with stable gradient updates, thereby requiring fewer updates and reducing overall runtime. We demonstrate that the double-horizon approach effectively balances distribution shift, model bias, and gradient instability, and surpasses existing MBRL methods on continuous-control benchmarks in terms of both sample efficiency and runtime.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15439v1",
        "pdf": "https://arxiv.org/pdf/2512.15439v1"
      },
      "arxiv_id": "2512.15439v1",
      "comment": "Accepted to Transactions on Machine Learning Research (TMLR) Code available at https://github.com/4kubo/erl_lib",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15436v1",
      "title": "Online Partitioned Local Depth for semi-supervised applications",
      "authors": [
        "John D. Foley",
        "Justin T. Lee"
      ],
      "abstract": "We introduce an extension of the partitioned local depth (PaLD) algorithm that is adapted to online applications such as semi-supervised prediction. The new algorithm we present, online PaLD, is well-suited to situations where it is a possible to pre-compute a cohesion network from a reference dataset. After $O(n^3)$ steps to construct a queryable data structure, online PaLD can extend the cohesion network to a new data point in $O(n^2)$ time. Our approach complements previous speed up approaches based on approximation and parallelism. For illustrations, we present applications to online anomaly detection and semi-supervised classification for health-care datasets.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "stat.ML",
        "cs.LG"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15436v1",
        "pdf": "https://arxiv.org/pdf/2512.15436v1"
      },
      "arxiv_id": "2512.15436v1",
      "comment": "19 pages, 2 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15435v1",
      "title": "Outer-Learning Framework for Playing Multi-Player Trick-Taking Card Games: A Case Study in Skat",
      "authors": [
        "Stefan Edelkamp"
      ],
      "abstract": "In multi-player card games such as Skat or Bridge, the early stages of the game, such as bidding, game selection, and initial card selection, are often more critical to the success of the play than refined middle- and end-game play. At the current limits of computation, such early decision-making resorts to using statistical information derived from a large corpus of human expert games. In this paper, we derive and evaluate a general bootstrapping outer-learning framework that improves prediction accuracy by expanding the database of human games with millions of self-playing AI games to generate and merge statistics. We implement perfect feature hash functions to address compacted tables, producing a self-improving card game engine, where newly inferred knowledge is continuously improved during self-learning. The case study in Skat shows that the automated approach can be used to support various decisions in the game.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15435v1",
        "pdf": "https://arxiv.org/pdf/2512.15435v1"
      },
      "arxiv_id": "2512.15435v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15433v1",
      "title": "CLIP-FTI: Fine-Grained Face Template Inversion via CLIP-Driven Attribute Conditioning",
      "authors": [
        "Longchen Dai",
        "Zixuan Shen",
        "Zhiheng Zhou",
        "Peipeng Yu",
        "Zhihua Xia"
      ],
      "abstract": "Face recognition systems store face templates for efficient matching. Once leaked, these templates pose a threat: inverting them can yield photorealistic surrogates that compromise privacy and enable impersonation. Although existing research has achieved relatively realistic face template inversion, the reconstructed facial images exhibit over-smoothed facial-part attributes (eyes, nose, mouth) and limited transferability. To address this problem, we present CLIP-FTI, a CLIP-driven fine-grained attribute conditioning framework for face template inversion. Our core idea is to use the CLIP model to obtain the semantic embeddings of facial features, in order to realize the reconstruction of specific facial feature attributes. Specifically, facial feature attribute embeddings extracted from CLIP are fused with the leaked template via a cross-modal feature interaction network and projected into the intermediate latent space of a pretrained StyleGAN. The StyleGAN generator then synthesizes face images with the same identity as the templates but with more fine-grained facial feature attributes. Experiments across multiple face recognition backbones and datasets show that our reconstructions (i) achieve higher identification accuracy and attribute similarity, (ii) recover sharper component-level attribute semantics, and (iii) improve cross-model attack transferability compared to prior reconstruction attacks. To the best of our knowledge, ours is the first method to use additional information besides the face template attack to realize face template inversion and obtains SOTA results.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15433v1",
        "pdf": "https://arxiv.org/pdf/2512.15433v1"
      },
      "arxiv_id": "2512.15433v1",
      "comment": "Accepted by AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15431v1",
      "title": "Step-GUI Technical Report",
      "authors": [
        "Haolong Yan",
        "Jia Wang",
        "Xin Huang",
        "Yeqing Shen",
        "Ziyang Meng",
        "Zhimin Fan",
        "Kaijun Tan",
        "Jin Gao",
        "Lieyu Shi",
        "Mi Yang",
        "Shiliang Yang",
        "Zhirui Wang",
        "Brian Li",
        "Kang An",
        "Chenyang Li",
        "Lei Lei",
        "Mengmeng Duan",
        "Danxun Liang",
        "Guodong Liu",
        "Hang Cheng",
        "Hao Wu",
        "Jie Dong",
        "Junhao Huang",
        "Mei Chen",
        "Renjie Yu",
        "Shunshan Li",
        "Xu Zhou",
        "Yiting Dai",
        "Yineng Deng",
        "Yingdan Liang",
        "Zelin Chen",
        "Wen Sun",
        "Chengxu Yan",
        "Chunqin Xu",
        "Dong Li",
        "Fengqiong Xiao",
        "Guanghao Fan",
        "Guopeng Li",
        "Guozhen Peng",
        "Hongbing Li",
        "Hang Li",
        "Hongming Chen",
        "Jingjing Xie",
        "Jianyong Li",
        "Jingyang Zhang",
        "Jiaju Ren",
        "Jiayu Yuan",
        "Jianpeng Yin",
        "Kai Cao",
        "Liang Zhao",
        "Liguo Tan",
        "Liying Shi",
        "Mengqiang Ren",
        "Min Xu",
        "Manjiao Liu",
        "Mao Luo",
        "Mingxin Wan",
        "Na Wang",
        "Nan Wu",
        "Ning Wang",
        "Peiyao Ma",
        "Qingzhou Zhang",
        "Qiao Wang",
        "Qinlin Zeng",
        "Qiong Gao",
        "Qiongyao Li",
        "Shangwu Zhong",
        "Shuli Gao",
        "Shaofan Liu",
        "Shisi Gao",
        "Shuang Luo",
        "Xingbin Liu",
        "Xiaojia Liu",
        "Xiaojie Hou",
        "Xin Liu",
        "Xuanti Feng",
        "Xuedan Cai",
        "Xuan Wen",
        "Xianwei Zhu",
        "Xin Liang",
        "Xin Liu",
        "Xin Zhou",
        "Yingxiu Zhao",
        "Yukang Shi",
        "Yunfang Xu",
        "Yuqing Zeng",
        "Yixun Zhang",
        "Zejia Weng",
        "Zhonghao Yan",
        "Zhiguo Huang",
        "Zhuoyu Wang",
        "Zheng Ge",
        "Jing Li",
        "Yibo Zhu",
        "Binxing Jiao",
        "Xiangyu Zhang",
        "Daxin Jiang"
      ],
      "abstract": "Recent advances in multimodal large language models unlock unprecedented opportunities for GUI automation. However, a fundamental challenge remains: how to efficiently acquire high-quality training data while maintaining annotation reliability? We introduce a self-evolving training pipeline powered by the Calibrated Step Reward System, which converts model-generated trajectories into reliable training signals through trajectory-level calibration, achieving >90% annotation accuracy with 10-100x lower cost. Leveraging this pipeline, we introduce Step-GUI, a family of models (4B/8B) that achieves state-of-the-art GUI performance (8B: 80.2% AndroidWorld, 48.5% OSWorld, 62.6% ScreenShot-Pro) while maintaining robust general capabilities. As GUI agent capabilities improve, practical deployment demands standardized interfaces across heterogeneous devices while protecting user privacy. To this end, we propose GUI-MCP, the first Model Context Protocol for GUI automation with hierarchical architecture that combines low-level atomic operations and high-level task delegation to local specialist models, enabling high-privacy execution where sensitive data stays on-device. Finally, to assess whether agents can handle authentic everyday usage, we introduce AndroidDaily, a benchmark grounded in real-world mobile usage patterns with 3146 static actions and 235 end-to-end tasks across high-frequency daily scenarios (8B: static 89.91%, end-to-end 52.50%). Our work advances the development of practical GUI agents and demonstrates strong potential for real-world deployment in everyday digital interactions.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15431v1",
        "pdf": "https://arxiv.org/pdf/2512.15431v1"
      },
      "arxiv_id": "2512.15431v1",
      "comment": "41 pages, 26 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15430v1",
      "title": "FM-EAC: Feature Model-based Enhanced Actor-Critic for Multi-Task Control in Dynamic Environments",
      "authors": [
        "Quanxi Zhou",
        "Wencan Mao",
        "Manabu Tsukada",
        "John C. S. Lui",
        "Yusheng Ji"
      ],
      "abstract": "Model-based reinforcement learning (MBRL) and model-free reinforcement learning (MFRL) evolve along distinct paths but converge in the design of Dyna-Q [1]. However, modern RL methods still struggle with effective transferability across tasks and scenarios. Motivated by this limitation, we propose a generalized algorithm, Feature Model-Based Enhanced Actor-Critic (FM-EAC), that integrates planning, acting, and learning for multi-task control in dynamic environments. FM-EAC combines the strengths of MBRL and MFRL and improves generalizability through the use of novel feature-based models and an enhanced actor-critic framework. Simulations in both urban and agricultural applications demonstrate that FM-EAC consistently outperforms many state-of-the-art MBRL and MFRL methods. More importantly, different sub-networks can be customized within FM-EAC according to user-specific requirements.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15430v1",
        "pdf": "https://arxiv.org/pdf/2512.15430v1"
      },
      "arxiv_id": "2512.15430v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15427v1",
      "title": "Statistics of Min-max Normalized Eigenvalues in Random Matrices",
      "authors": [
        "Hyakka Nakada",
        "Shu Tanaka"
      ],
      "abstract": "Random matrix theory has played an important role in various areas of pure mathematics, mathematical physics, and machine learning. From a practical perspective of data science, input data are usually normalized prior to processing. Thus, this study investigates the statistical properties of min-max normalized eigenvalues in random matrices. Previously, the effective distribution for such normalized eigenvalues has been proposed. In this study, we apply it to evaluate a scaling law of the cumulative distribution. Furthermore, we derive the residual error that arises during matrix factorization of random matrices. We conducted numerical experiments to verify these theoretical predictions.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "cond-mat.stat-mech",
        "math.ST"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15427v1",
        "pdf": "https://arxiv.org/pdf/2512.15427v1"
      },
      "arxiv_id": "2512.15427v1",
      "comment": "4 pages, 4 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15423v1",
      "title": "Photorealistic Phantom Roads in Real Scenes: Disentangling 3D Hallucinations from Physical Geometry",
      "authors": [
        "Hoang Nguyen",
        "Xiaohao Xu",
        "Xiaonan Huang"
      ],
      "abstract": "Monocular depth foundation models achieve remarkable generalization by learning large-scale semantic priors, but this creates a critical vulnerability: they hallucinate illusory 3D structures from geometrically planar but perceptually ambiguous inputs. We term this failure the 3D Mirage. This paper introduces the first end-to-end framework to probe, quantify, and tame this unquantified safety risk. To probe, we present 3D-Mirage, the first benchmark of real-world illusions (e.g., street art) with precise planar-region annotations and context-restricted crops. To quantify, we propose a Laplacian-based evaluation framework with two metrics: the Deviation Composite Score (DCS) for spurious non-planarity and the Confusion Composite Score (CCS) for contextual instability. To tame this failure, we introduce Grounded Self-Distillation, a parameter-efficient strategy that surgically enforces planarity on illusion ROIs while using a frozen teacher to preserve background knowledge, thus avoiding catastrophic forgetting. Our work provides the essential tools to diagnose and mitigate this phenomenon, urging a necessary shift in MDE evaluation from pixel-wise accuracy to structural and contextual robustness. Our code and benchmark will be publicly available to foster this exciting research direction.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.RO"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15423v1",
        "pdf": "https://arxiv.org/pdf/2512.15423v1"
      },
      "arxiv_id": "2512.15423v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15420v1",
      "title": "FlowBind: Efficient Any-to-Any Generation with Bidirectional Flows",
      "authors": [
        "Yeonwoo Cha",
        "Semin Kim",
        "Jinhyeon Kwon",
        "Seunghoon Hong"
      ],
      "abstract": "Any-to-any generation seeks to translate between arbitrary subsets of modalities, enabling flexible cross-modal synthesis. Despite recent success, existing flow-based approaches are challenged by their inefficiency, as they require large-scale datasets often with restrictive pairing constraints, incur high computational cost from modeling joint distribution, and rely on complex multi-stage training. We propose FlowBind, an efficient framework for any-to-any generation. Our approach is distinguished by its simplicity: it learns a shared latent space capturing cross-modal information, with modality-specific invertible flows bridging this latent to each modality. Both components are optimized jointly under a single flow-matching objective, and at inference the invertible flows act as encoders and decoders for direct translation across modalities. By factorizing interactions through the shared latent, FlowBind naturally leverages arbitrary subsets of modalities for training, and achieves competitive generation quality while substantially reducing data requirements and computational cost. Experiments on text, image, and audio demonstrate that FlowBind attains comparable quality while requiring up to 6x fewer parameters and training 10x faster than prior methods. The project page with code is available at https://yeonwoo378.github.io/official_flowbind.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15420v1",
        "pdf": "https://arxiv.org/pdf/2512.15420v1"
      },
      "arxiv_id": "2512.15420v1",
      "comment": "https://yeonwoo378.github.io/official_flowbind",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2512.15411v1",
      "title": "MiVLA: Towards Generalizable Vision-Language-Action Model with Human-Robot Mutual Imitation Pre-training",
      "authors": [
        "Zhenhan Yin",
        "Xuanhan Wang",
        "Jiahao Jiang",
        "Kaiyuan Deng",
        "Pengqi Chen",
        "Shuangle Li",
        "Chong Liu",
        "Xing Xu",
        "ingkuan Song",
        "Lianli Gao",
        "Heng Tao Shen"
      ],
      "abstract": "While leveraging abundant human videos and simulated robot data poses a scalable solution to the scarcity of real-world robot data, the generalization capability of existing vision-language-action models (VLAs) remains limited by mismatches in camera views, visual appearance, and embodiment morphologies. To overcome this limitation, we propose MiVLA, a generalizable VLA empowered by human-robot mutual imitation pre-training, which leverages inherent behavioral similarity between human hands and robotic arms to build a foundation of strong behavioral priors for both human actions and robotic control. Specifically, our method utilizes kinematic rules with left/right hand coordinate systems for bidirectional alignment between human and robot action spaces. Given human or simulated robot demonstrations, MiVLA is trained to forecast behavior trajectories for one embodiment, and imitate behaviors for another one unseen in the demonstration. Based on this mutual imitation, it integrates the behavioral fidelity of real-world human data with the manipulative diversity of simulated robot data into a unified model, thereby enhancing the generalization capability for downstream tasks. Extensive experiments conducted on both simulation and real-world platforms with three robots (ARX, PiPer and LocoMan), demonstrate that MiVLA achieves strong improved generalization capability, outperforming state-of-the-art VLAs (e.g., $\\boldsymbolπ_{0}$, $\\boldsymbolπ_{0.5}$ and H-RDT) by 25% in simulation, and 14% in real-world robot control tasks.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.RO",
        "cs.CV"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15411v1",
        "pdf": "https://arxiv.org/pdf/2512.15411v1"
      },
      "arxiv_id": "2512.15411v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15410v1",
      "title": "Preserving Marker Specificity with Lightweight Channel-Independent Representation Learning",
      "authors": [
        "Simon Gutwein",
        "Arthur Longuefosse",
        "Jun Seita",
        "Sabine Taschner-Mandl",
        "Roxane Licandro"
      ],
      "abstract": "Multiplexed tissue imaging measures dozens of protein markers per cell, yet most deep learning models still apply early channel fusion, assuming shared structure across markers. We investigate whether preserving marker independence, combined with deliberately shallow architectures, provides a more suitable inductive bias for self-supervised representation learning in multiplex data than increasing model scale. Using a Hodgkin lymphoma CODEX dataset with 145,000 cells and 49 markers, we compare standard early-fusion CNNs with channel-separated architectures, including a marker-aware baseline and our novel shallow Channel-Independent Model (CIM-S) with 5.5K parameters. After contrastive pretraining and linear evaluation, early-fusion models show limited ability to retain marker-specific information and struggle particularly with rare-cell discrimination. Channel-independent architectures, and CIM-S in particular, achieve substantially stronger representations despite their compact size. These findings are consistent across multiple self-supervised frameworks, remain stable across augmentation settings, and are reproducible across both the 49-marker and reduced 18-marker settings. These results show that lightweight, channel-independent architectures can match or surpass deep early-fusion CNNs and foundation models for multiplex representation learning. Code is available at https://github.com/SimonBon/CIM-S.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15410v1",
        "pdf": "https://arxiv.org/pdf/2512.15410v1"
      },
      "arxiv_id": "2512.15410v1",
      "comment": "16 pages, 9 figures, MIDL 2026 conference",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15405v1",
      "title": "EUBRL: Epistemic Uncertainty Directed Bayesian Reinforcement Learning",
      "authors": [
        "Jianfei Ma",
        "Wee Sun Lee"
      ],
      "abstract": "At the boundary between the known and the unknown, an agent inevitably confronts the dilemma of whether to explore or to exploit. Epistemic uncertainty reflects such boundaries, representing systematic uncertainty due to limited knowledge. In this paper, we propose a Bayesian reinforcement learning (RL) algorithm, $\\texttt{EUBRL}$, which leverages epistemic guidance to achieve principled exploration. This guidance adaptively reduces per-step regret arising from estimation errors. We establish nearly minimax-optimal regret and sample complexity guarantees for a class of sufficiently expressive priors in infinite-horizon discounted MDPs. Empirically, we evaluate $\\texttt{EUBRL}$ on tasks characterized by sparse rewards, long horizons, and stochasticity. Results demonstrate that $\\texttt{EUBRL}$ achieves superior sample efficiency, scalability, and consistency.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15405v1",
        "pdf": "https://arxiv.org/pdf/2512.15405v1"
      },
      "arxiv_id": "2512.15405v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15396v1",
      "title": "SMART: Semantic Matching Contrastive Learning for Partially View-Aligned Clustering",
      "authors": [
        "Liang Peng",
        "Yixuan Ye",
        "Cheng Liu",
        "Hangjun Che",
        "Fei Wang",
        "Zhiwen Yu",
        "Si Wu",
        "Hau-San Wong"
      ],
      "abstract": "Multi-view clustering has been empirically shown to improve learning performance by leveraging the inherent complementary information across multiple views of data. However, in real-world scenarios, collecting strictly aligned views is challenging, and learning from both aligned and unaligned data becomes a more practical solution. Partially View-aligned Clustering aims to learn correspondences between misaligned view samples to better exploit the potential consistency and complementarity across views, including both aligned and unaligned data. However, most existing PVC methods fail to leverage unaligned data to capture the shared semantics among samples from the same cluster. Moreover, the inherent heterogeneity of multi-view data induces distributional shifts in representations, leading to inaccuracies in establishing meaningful correspondences between cross-view latent features and, consequently, impairing learning effectiveness. To address these challenges, we propose a Semantic MAtching contRasTive learning model (SMART) for PVC. The main idea of our approach is to alleviate the influence of cross-view distributional shifts, thereby facilitating semantic matching contrastive learning to fully exploit semantic relationships in both aligned and unaligned data. Extensive experiments on eight benchmark datasets demonstrate that our method consistently outperforms existing approaches on the PVC problem.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15396v1",
        "pdf": "https://arxiv.org/pdf/2512.15396v1"
      },
      "arxiv_id": "2512.15396v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15394v1",
      "title": "Deep Learning-Driven Quantitative Spectroscopic Photoacoustic Imaging for Segmentation and Oxygen Saturation Estimation",
      "authors": [
        "Ruibo Shang",
        "Sidhartha Jandhyala",
        "Yujia Wu",
        "Kevin Hoffer-Hawlik",
        "Austin Van Namen",
        "Matthew O'Donnell",
        "Geoffrey P. Luke"
      ],
      "abstract": "Spectroscopic photoacoustic (sPA) imaging can potentially estimate blood oxygenation saturation (sO2) in vivo noninvasively. However, quantitatively accurate results require accurate optical fluence estimates. Robust modeling in heterogeneous tissue, where light with different wavelengths can experience significantly different absorption and scattering, is difficult. In this work, we developed a deep neural network (Hybrid-Net) for sPA imaging to simultaneously estimate sO2 in blood vessels and segment those vessels from surrounding background tissue. sO2 error was minimized only in blood vessels segmented in Hybrid-Net, resulting in more accurate predictions. Hybrid-Net was first trained on simulated sPA data (at 700 nm and 850 nm) representing initial pressure distributions from three-dimensional Monte Carlo simulations of light transport in breast tissue. Then, for experimental verification, the network was retrained on experimental sPA data (at 700 nm and 850 nm) acquired from simple tissue mimicking phantoms with an embedded blood pool. Quantitative measures were used to evaluate Hybrid-Net performance with an averaged segmentation accuracy of >= 0.978 in simulations with varying noise levels (0dB-35dB) and 0.998 in the experiment, and an averaged sO2 mean squared error of <= 0.048 in simulations with varying noise levels (0dB-35dB) and 0.003 in the experiment. Overall, these results show that Hybrid-Net can provide accurate blood oxygenation without estimating the optical fluence, and this study could lead to improvements in in-vivo sO2 estimation.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "eess.IV"
      ],
      "primary_category": "eess.IV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15394v1",
        "pdf": "https://arxiv.org/pdf/2512.15394v1"
      },
      "arxiv_id": "2512.15394v1",
      "comment": "18 pages, 6 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15388v1",
      "title": "Bilateral Spatial Reasoning about Street Networks: Graph-based RAG with Qualitative Spatial Representations",
      "authors": [
        "Reinhard Moratz",
        "Niklas Daute",
        "James Ondieki",
        "Markus Kattenbeck",
        "Mario Krajina",
        "Ioannis Giannopoulos"
      ],
      "abstract": "This paper deals with improving the capabilities of Large Language Models (LLM) to provide route instructions for pedestrian wayfinders by means of qualitative spatial relations.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15388v1",
        "pdf": "https://arxiv.org/pdf/2512.15388v1"
      },
      "arxiv_id": "2512.15388v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15386v1",
      "title": "See It Before You Grab It: Deep Learning-based Action Anticipation in Basketball",
      "authors": [
        "Arnau Barrera Roy",
        "Albert Clapés Sintes"
      ],
      "abstract": "Computer vision and video understanding have transformed sports analytics by enabling large-scale, automated analysis of game dynamics from broadcast footage. Despite significant advances in player and ball tracking, pose estimation, action localization, and automatic foul recognition, anticipating actions before they occur in sports videos has received comparatively little attention. This work introduces the task of action anticipation in basketball broadcast videos, focusing on predicting which team will gain possession of the ball following a shot attempt. To benchmark this task, a new self-curated dataset comprising 100,000 basketball video clips, over 300 hours of footage, and more than 2,000 manually annotated rebound events is presented. Comprehensive baseline results are reported using state-of-the-art action anticipation methods, representing the first application of deep learning techniques to basketball rebound prediction. Additionally, two complementary tasks, rebound classification and rebound spotting, are explored, demonstrating that this dataset supports a wide range of video understanding applications in basketball, for which no comparable datasets currently exist. Experimental results highlight both the feasibility and inherent challenges of anticipating rebounds, providing valuable insights into predictive modeling for dynamic multi-agent sports scenarios. By forecasting team possession before rebounds occur, this work enables applications in real-time automated broadcasting and post-game analysis tools to support decision-making.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15386v1",
        "pdf": "https://arxiv.org/pdf/2512.15386v1"
      },
      "arxiv_id": "2512.15386v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15385v1",
      "title": "Robustness Evaluation of Machine Learning Models for Fault Classification and Localization In Power System Protection",
      "authors": [
        "Julian Oelhaf",
        "Mehran Pashaei",
        "Georg Kordowich",
        "Christian Bergler",
        "Andreas Maier",
        "Johann Jäger",
        "Siming Bayer"
      ],
      "abstract": "The growing penetration of renewable and distributed generation is transforming power systems and challenging conventional protection schemes that rely on fixed settings and local measurements. Machine learning (ML) offers a data-driven alternative for centralized fault classification (FC) and fault localization (FL), enabling faster and more adaptive decision-making. However, practical deployment critically depends on robustness. Protection algorithms must remain reliable even when confronted with missing, noisy, or degraded sensor data. This work introduces a unified framework for systematically evaluating the robustness of ML models in power system protection.\n  High-fidelity EMT simulations are used to model realistic degradation scenarios, including sensor outages, reduced sampling rates, and transient communication losses. The framework provides a consistent methodology for benchmarking models, quantifying the impact of limited observability, and identifying critical measurement channels required for resilient operation. Results show that FC remains highly stable under most degradation types but drops by about 13% under single-phase loss, while FL is more sensitive overall, with voltage loss increasing localization error by over 150%. These findings offer actionable guidance for robustness-aware design of future ML-assisted protection systems.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "eess.SP"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15385v1",
        "pdf": "https://arxiv.org/pdf/2512.15385v1"
      },
      "arxiv_id": "2512.15385v1",
      "comment": "This paper is a postprint of a paper submitted to and accepted for publication in the 20th IET International Conference on Developments in Power System Protection (DPSP Global 2026) and is subject to Institution of Engineering and Technology Copyright. The copy of record is available at the IET Digital Library",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15379v1",
      "title": "Remotely Detectable Robot Policy Watermarking",
      "authors": [
        "Michael Amir",
        "Manon Flageat",
        "Amanda Prorok"
      ],
      "abstract": "The success of machine learning for real-world robotic systems has created a new form of intellectual property: the trained policy. This raises a critical need for novel methods that verify ownership and detect unauthorized, possibly unsafe misuse. While watermarking is established in other domains, physical policies present a unique challenge: remote detection. Existing methods assume access to the robot's internal state, but auditors are often limited to external observations (e.g., video footage). This ``Physical Observation Gap'' means the watermark must be detected from signals that are noisy, asynchronous, and filtered by unknown system dynamics. We formalize this challenge using the concept of a \\textit{glimpse sequence}, and introduce Colored Noise Coherency (CoNoCo), the first watermarking strategy designed for remote detection. CoNoCo embeds a spectral signal into the robot's motions by leveraging the policy's inherent stochasticity. To show it does not degrade performance, we prove CoNoCo preserves the marginal action distribution. Our experiments demonstrate strong, robust detection across various remote modalities, including motion capture and side-way/top-down video footage, in both simulated and real-world robot experiments. This work provides a necessary step toward protecting intellectual property in robotics, offering the first method for validating the provenance of physical policies non-invasively, using purely remote observations.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.RO",
        "cs.CR",
        "cs.LG",
        "eess.SY"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15379v1",
        "pdf": "https://arxiv.org/pdf/2512.15379v1"
      },
      "arxiv_id": "2512.15379v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15378v1",
      "title": "A Regime-Aware Fusion Framework for Time Series Classification",
      "authors": [
        "Honey Singh Chauhan",
        "Zahraa S. Abdallah"
      ],
      "abstract": "Kernel-based methods such as Rocket are among the most effective default approaches for univariate time series classification (TSC), yet they do not perform equally well across all datasets. We revisit the long-standing intuition that different representations capture complementary structure and show that selectively fusing them can yield consistent improvements over Rocket on specific, systematically identifiable kinds of datasets. We introduce Fusion-3 (F3), a lightweight framework that adaptively fuses Rocket, Sax, and Sfa representations. To understand when fusion helps, we cluster UCR datasets into six groups using meta-features capturing series length, spectral structure, roughness, and class imbalance, and treat these clusters as interpretable data-structure regimes. Our analysis shows that fusion typically outperforms strong baselines in regimes with structured variability or rich frequency content, while offering diminishing returns in highly irregular or outlier-heavy settings. To support these findings, we combine three complementary analyses: non-parametric paired statistics across datasets, ablation studies isolating the roles of individual representations, and attribution via SHAP to identify which dataset properties predict fusion gains. Sample-level case studies further reveal the underlying mechanism: fusion primarily improves performance by rescuing specific errors, with adaptive increases in frequency-domain weighting precisely where corrections occur. Using 5-fold cross-validation on the 113 UCR datasets, F3 yields small but consistent average improvements over Rocket, supported by frequentist and Bayesian evidence and accompanied by clearly identifiable failure cases. Our results show that selectively applied fusion provides dependable and interpretable extension to strong kernel-based methods, correcting their weaknesses precisely where the data support it.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15378v1",
        "pdf": "https://arxiv.org/pdf/2512.15378v1"
      },
      "arxiv_id": "2512.15378v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15376v1",
      "title": "Emotion Recognition in Signers",
      "authors": [
        "Kotaro Funakoshi",
        "Yaoxiong Zhu"
      ],
      "abstract": "Recognition of signers' emotions suffers from one theoretical challenge and one practical challenge, namely, the overlap between grammatical and affective facial expressions and the scarcity of data for model training. This paper addresses these two challenges in a cross-lingual setting using our eJSL dataset, a new benchmark dataset for emotion recognition in Japanese Sign Language signers, and BOBSL, a large British Sign Language dataset with subtitles. In eJSL, two signers expressed 78 distinct utterances with each of seven different emotional states, resulting in 1,092 video clips. We empirically demonstrate that 1) textual emotion recognition in spoken language mitigates data scarcity in sign language, 2) temporal segment selection has a significant impact, and 3) incorporating hand motion enhances emotion recognition in signers. Finally we establish a stronger baseline than spoken language LLMs.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15376v1",
        "pdf": "https://arxiv.org/pdf/2512.15376v1"
      },
      "arxiv_id": "2512.15376v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2512.15374v1",
      "title": "SCOPE: Prompt Evolution for Enhancing Agent Effectiveness",
      "authors": [
        "Zehua Pei",
        "Hui-Ling Zhen",
        "Shixiong Kai",
        "Sinno Jialin Pan",
        "Yunhe Wang",
        "Mingxuan Yuan",
        "Bei Yu"
      ],
      "abstract": "Large Language Model (LLM) agents are increasingly deployed in environments that generate massive, dynamic contexts. However, a critical bottleneck remains: while agents have access to this context, their static prompts lack the mechanisms to manage it effectively, leading to recurring Corrective and Enhancement failures. To address this capability gap, we introduce \\textbf{SCOPE} (Self-evolving Context Optimization via Prompt Evolution). SCOPE frames context management as an \\textit{online optimization} problem, synthesizing guidelines from execution traces to automatically evolve the agent's prompt. We propose a Dual-Stream mechanism that balances tactical specificity (resolving immediate errors) with strategic generality (evolving long-term principles). Furthermore, we introduce Perspective-Driven Exploration to maximize strategy coverage, increasing the likelihood that the agent has the correct strategy for any given task. Experiments on the HLE benchmark show that SCOPE improves task success rates from 14.23\\% to 38.64\\% without human intervention. We make our code publicly available at https://github.com/JarvisPei/SCOPE.",
      "published": "2025-12-17",
      "updated": "2025-12-17",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2512.15374v1",
        "pdf": "https://arxiv.org/pdf/2512.15374v1"
      },
      "arxiv_id": "2512.15374v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    }
  ]
}