{
  "fetched_at": "2025-11-24T00:26:53.944456",
  "total_papers": 100,
  "papers": [
    {
      "id": "2511.16674v1",
      "title": "Dataset Distillation for Pre-Trained Self-Supervised Vision Models",
      "authors": [
        "George Cazenavette",
        "Antonio Torralba",
        "Vincent Sitzmann"
      ],
      "abstract": "The task of dataset distillation aims to find a small set of synthetic images such that training a model on them reproduces the performance of the same model trained on a much larger dataset of real samples. Existing distillation methods focus on synthesizing datasets that enable training randomly initialized models. In contrast, state-of-the-art vision approaches are increasingly building on large, pre-trained self-supervised models rather than training from scratch. In this paper, we investigate the problem of distilling datasets that enable us to optimally train linear probes on top of such large, pre-trained vision models. We introduce a method of dataset distillation for this task called Linear Gradient Matching that optimizes the synthetic images such that, when passed through a pre-trained feature extractor, they induce gradients in the linear classifier similar to those produced by the real data. Our method yields synthetic data that outperform all real-image baselines and, remarkably, generalize across pre-trained vision models, enabling us, for instance, to train a linear CLIP probe that performs competitively using a dataset distilled via a DINO backbone. Further, we show that our distilled datasets are exceptionally effective for fine-grained classification and provide a valuable tool for model interpretability, predicting, among other things, how similar two models' embedding spaces are under the platonic representation hypothesis or whether a model is sensitive to spurious correlations in adversarial datasets.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16674v1",
        "pdf": "https://arxiv.org/pdf/2511.16674v1"
      },
      "arxiv_id": "2511.16674v1",
      "comment": "Accepted at NeurIPS 2025. Project page: https://linear-gradient-matching.github.io/ Code: https://github.com/GeorgeCazenavette/linear-gradient-matching",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16672v1",
      "title": "EvoLMM: Self-Evolving Large Multimodal Models with Continuous Rewards",
      "authors": [
        "Omkat Thawakar",
        "Shravan Venkatraman",
        "Ritesh Thawkar",
        "Abdelrahman Shaker",
        "Hisham Cholakkal",
        "Rao Muhammad Anwer",
        "Salman Khan",
        "Fahad Khan"
      ],
      "abstract": "Recent advances in large multimodal models (LMMs) have enabled impressive reasoning and perception abilities, yet most existing training pipelines still depend on human-curated data or externally verified reward models, limiting their autonomy and scalability. In this work, we strive to improve LMM reasoning capabilities in a purely unsupervised fashion (without any annotated data or reward distillation). To this end, we propose a self-evolving framework, named EvoLMM, that instantiates two cooperative agents from a single backbone model: a Proposer, which generates diverse, image-grounded questions, and a Solver, which solves them through internal consistency, where learning proceeds through a continuous self-rewarding process. This dynamic feedback encourages both the generation of informative queries and the refinement of structured reasoning without relying on ground-truth or human judgments. When using the popular Qwen2.5-VL as the base model, our EvoLMM yields consistent gains upto $\\sim$3\\% on multimodal math-reasoning benchmarks, including ChartQA, MathVista, and MathVision, using only raw training images. We hope our simple yet effective approach will serve as a solid baseline easing future research in self-improving LMMs in a fully-unsupervised fashion. Our code and models are available at https://github.com/mbzuai-oryx/EvoLMM.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16672v1",
        "pdf": "https://arxiv.org/pdf/2511.16672v1"
      },
      "arxiv_id": "2511.16672v1",
      "comment": "9 Pages, 6 Figures, 4 Tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16673v1",
      "title": "NoPo-Avatar: Generalizable and Animatable Avatars from Sparse Inputs without Human Poses",
      "authors": [
        "Jing Wen",
        "Alexander G. Schwing",
        "Shenlong Wang"
      ],
      "abstract": "We tackle the task of recovering an animatable 3D human avatar from a single or a sparse set of images. For this task, beyond a set of images, many prior state-of-the-art methods use accurate \"ground-truth\" camera poses and human poses as input to guide reconstruction at test-time. We show that pose-dependent reconstruction degrades results significantly if pose estimates are noisy. To overcome this, we introduce NoPo-Avatar, which reconstructs avatars solely from images, without any pose input. By removing the dependence of test-time reconstruction on human poses, NoPo-Avatar is not affected by noisy human pose estimates, making it more widely applicable. Experiments on challenging THuman2.0, XHuman, and HuGe100K data show that NoPo-Avatar outperforms existing baselines in practical settings (without ground-truth poses) and delivers comparable results in lab settings (with ground-truth poses).",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16673v1",
        "pdf": "https://arxiv.org/pdf/2511.16673v1"
      },
      "arxiv_id": "2511.16673v1",
      "comment": "NeurIPS'25; project page: https://wenj.github.io/NoPo-Avatar/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16671v1",
      "title": "Thinking-while-Generating: Interleaving Textual Reasoning throughout Visual Generation",
      "authors": [
        "Ziyu Guo",
        "Renrui Zhang",
        "Hongyu Li",
        "Manyuan Zhang",
        "Xinyan Chen",
        "Sifan Wang",
        "Yan Feng",
        "Peng Pei",
        "Pheng-Ann Heng"
      ],
      "abstract": "Recent advances in visual generation have increasingly explored the integration of reasoning capabilities. They incorporate textual reasoning, i.e., think, either before (as pre-planning) or after (as post-refinement) the generation process, yet they lack on-the-fly multimodal interaction during the generation itself. In this preliminary study, we introduce Thinking-while-Generating (TwiG), the first interleaved framework that enables co-evolving textual reasoning throughout the visual generation process. As visual content is progressively generating, textual reasoning is interleaved to both guide upcoming local regions and reflect on previously synthesized ones. This dynamic interplay produces more context-aware and semantically rich visual outputs. To unveil the potential of this framework, we investigate three candidate strategies, zero-shot prompting, supervised fine-tuning (SFT) on our curated TwiG-50K dataset, and reinforcement learning (RL) via a customized TwiG-GRPO strategy, each offering unique insights into the dynamics of interleaved reasoning. We hope this work inspires further research into interleaving textual reasoning for enhanced visual generation. Code will be released at: https://github.com/ZiyuGuo99/Thinking-while-Generating.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16671v1",
        "pdf": "https://arxiv.org/pdf/2511.16671v1"
      },
      "arxiv_id": "2511.16671v1",
      "comment": "Project Page: https://think-while-gen.github.io Code: https://github.com/ZiyuGuo99/Thinking-while-Generating",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16670v1",
      "title": "Learning to Think Fast and Slow for Visual Language Models",
      "authors": [
        "Chenyu Lin",
        "Cheng Chi",
        "Jinlin Wu",
        "Sharon Li",
        "Kaiyang Zhou"
      ],
      "abstract": "When confronted with complex problems, we tend to think slowly; conversely, for simple questions, we think quickly. Such a two-system thinking mechanism allows us to efficiently allocate cognitive resources, enabling quick decision-making for straightforward issues while reserving deeper analytical thinking for more intricate challenges. However, existing reasoning-oriented visual language models (VLMs), whether trained with explicit chain-of-thought annotations or rule-based RL rewards, mainly pursue lengthy, detailed reasoning chains, which often lead to excessive computational costs. In this work, we propose a simple RL approach, which enables VLMs to automatically switch between fast and slow thinking modes depending on task difficulty. The approach consists of two stages: in the first stage, we label data as either requiring fast thinking or slow thinking based on the model output length, which is inspired by the observation that pre-trained VLMs typically produce answers of varying lengths for different types of questions; in the second stage, we train the model using GRPO along with the thinking mode labels to develop dual-mode thinking. Despite its simplicity, our model, named DualMindVLM, significantly outperforms the base model and achieves performance on par with state-of-the-art visual reasoning models, while maintaining exceptionally high token efficiency.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16670v1",
        "pdf": "https://arxiv.org/pdf/2511.16670v1"
      },
      "arxiv_id": "2511.16670v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16669v1",
      "title": "Video-as-Answer: Predict and Generate Next Video Event with Joint-GRPO",
      "authors": [
        "Junhao Cheng",
        "Liang Hou",
        "Xin Tao",
        "Jing Liao"
      ],
      "abstract": "While language models have become impactful in many real-world applications, video generation remains largely confined to entertainment. Motivated by video's inherent capacity to demonstrate physical-world information that is difficult to convey through language alone (e.g., imagine teaching someone to tie a tie using only text), we identify an underutilized opportunity to extend video as a new answer modality for Next-Event Prediction (NEP), formalized as Video-Next-Event Prediction (VNEP). While the established NEP task takes a video with a procedural or predictive question as input to predict the next event in text, VNEP requires dynamic video responses. This shift from telling to showing unlocks more intuitive and customized answers for procedural learning and creative exploration. However, this task remains challenging for existing models, as it demands an understanding of multimodal input, instruction-conditioned reasoning, and the generation of video with visual and semantic consistency. To address this, we introduce VANS, a model that leverages reinforcement learning to align a Vision-Language Model (VLM) with a Video Diffusion Model (VDM) for VNEP. The core of VANS is our proposed Joint-GRPO that orchestrates the VLM and VDM to function as a unit. Driven by a shared reward on their respective output, it optimizes the VLM to produce captions that are both accurate and friendly to visualize, while guiding the VDM to generate videos that are faithful to these captions and the input visual context. To enable this learning, we craft VANS-Data-100K, a dedicated dataset for the VNEP task. Experiments on procedural and predictive benchmarks demonstrate that VANS achieves state-of-the-art performance in both video event prediction and visualization. Codes are released in https://github.com/KlingTeam/VANS.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16669v1",
        "pdf": "https://arxiv.org/pdf/2511.16669v1"
      },
      "arxiv_id": "2511.16669v1",
      "comment": "Project page: https://video-as-answer.github.io/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16668v1",
      "title": "V-ReasonBench: Toward Unified Reasoning Benchmark Suite for Video Generation Models",
      "authors": [
        "Yang Luo",
        "Xuanlei Zhao",
        "Baijiong Lin",
        "Lingting Zhu",
        "Liyao Tang",
        "Yuqi Liu",
        "Ying-Cong Chen",
        "Shengju Qian",
        "Xin Wang",
        "Yang You"
      ],
      "abstract": "Recent progress in generative video models, such as Veo-3, has shown surprising zero-shot reasoning abilities, creating a growing need for systematic and reliable evaluation. We introduce V-ReasonBench, a benchmark designed to assess video reasoning across four key dimensions: structured problem-solving, spatial cognition, pattern-based inference, and physical dynamics. The benchmark is built from both synthetic and real-world image sequences and provides a diverse set of answer-verifiable tasks that are reproducible, scalable, and unambiguous. Evaluations of six state-of-the-art video models reveal clear dimension-wise differences, with strong variation in structured, spatial, pattern-based, and physical reasoning. We further compare video models with strong image models, analyze common hallucination behaviors, and study how video duration affects Chain-of-Frames reasoning. Overall, V-ReasonBench offers a unified and reproducible framework for measuring video reasoning and aims to support the development of models with more reliable, human-aligned reasoning skills.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16668v1",
        "pdf": "https://arxiv.org/pdf/2511.16668v1"
      },
      "arxiv_id": "2511.16668v1",
      "comment": "Project Page: https://oahzxl.github.io/VReasonBench",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16666v1",
      "title": "SceneDesigner: Controllable Multi-Object Image Generation with 9-DoF Pose Manipulation",
      "authors": [
        "Zhenyuan Qin",
        "Xincheng Shuai",
        "Henghui Ding"
      ],
      "abstract": "Controllable image generation has attracted increasing attention in recent years, enabling users to manipulate visual content such as identity and style. However, achieving simultaneous control over the 9D poses (location, size, and orientation) of multiple objects remains an open challenge. Despite recent progress, existing methods often suffer from limited controllability and degraded quality, falling short of comprehensive multi-object 9D pose control. To address these limitations, we propose SceneDesigner, a method for accurate and flexible multi-object 9-DoF pose manipulation. SceneDesigner incorporates a branched network to the pre-trained base model and leverages a new representation, CNOCS map, which encodes 9D pose information from the camera view. This representation exhibits strong geometric interpretation properties, leading to more efficient and stable training. To support training, we construct a new dataset, ObjectPose9D, which aggregates images from diverse sources along with 9D pose annotations. To further address data imbalance issues, particularly performance degradation on low-frequency poses, we introduce a two-stage training strategy with reinforcement learning, where the second stage fine-tunes the model using a reward-based objective on rebalanced data. At inference time, we propose Disentangled Object Sampling, a technique that mitigates insufficient object generation and concept confusion in complex multi-object scenes. Moreover, by integrating user-specific personalization weights, SceneDesigner enables customized pose control for reference subjects. Extensive qualitative and quantitative experiments demonstrate that SceneDesigner significantly outperforms existing approaches in both controllability and quality. Code is publicly available at https://github.com/FudanCVL/SceneDesigner.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16666v1",
        "pdf": "https://arxiv.org/pdf/2511.16666v1"
      },
      "arxiv_id": "2511.16666v1",
      "comment": "NeurIPS 2025 (Spotlight), Project Page: https://henghuiding.com/SceneDesigner/",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16665v1",
      "title": "Taming the Long-Tail: Efficient Reasoning RL Training with Adaptive Drafter",
      "authors": [
        "Qinghao Hu",
        "Shang Yang",
        "Junxian Guo",
        "Xiaozhe Yao",
        "Yujun Lin",
        "Yuxian Gu",
        "Han Cai",
        "Chuang Gan",
        "Ana Klimovic",
        "Song Han"
      ],
      "abstract": "The emergence of Large Language Models (LLMs) with strong reasoning capabilities marks a significant milestone, unlocking new frontiers in complex problem-solving. However, training these reasoning models, typically using Reinforcement Learning (RL), encounters critical efficiency bottlenecks: response generation during RL training exhibits a persistent long-tail distribution, where a few very long responses dominate execution time, wasting resources and inflating costs. To address this, we propose TLT, a system that accelerates reasoning RL training losslessly by integrating adaptive speculative decoding. Applying speculative decoding in RL is challenging due to the dynamic workloads, evolving target model, and draft model training overhead. TLT overcomes these obstacles with two synergistic components: (1) Adaptive Drafter, a lightweight draft model trained continuously on idle GPUs during long-tail generation to maintain alignment with the target model at no extra cost; and (2) Adaptive Rollout Engine, which maintains a memory-efficient pool of pre-captured CUDAGraphs and adaptively select suitable SD strategies for each input batch. Evaluations demonstrate that TLT achieves over 1.7x end-to-end RL training speedup over state-of-the-art systems, preserves the model accuracy, and yields a high-quality draft model as a free byproduct suitable for efficient deployment. Code is released at https://github.com/mit-han-lab/fastrl.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.DC"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16665v1",
        "pdf": "https://arxiv.org/pdf/2511.16665v1"
      },
      "arxiv_id": "2511.16665v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16662v1",
      "title": "TriDiff-4D: Fast 4D Generation through Diffusion-based Triplane Re-posing",
      "authors": [
        "Eddie Pokming Sheung",
        "Qihao Liu",
        "Wufei Ma",
        "Prakhar Kaushik",
        "Jianwen Xie",
        "Alan Yuille"
      ],
      "abstract": "With the increasing demand for 3D animation, generating high-fidelity, controllable 4D avatars from textual descriptions remains a significant challenge. Despite notable efforts in 4D generative modeling, existing methods exhibit fundamental limitations that impede their broader applicability, including temporal and geometric inconsistencies, perceptual artifacts, motion irregularities, high computational costs, and limited control over dynamics. To address these challenges, we propose TriDiff-4D, a novel 4D generative pipeline that employs diffusion-based triplane re-posing to produce high-quality, temporally coherent 4D avatars. Our model adopts an auto-regressive strategy to generate 4D sequences of arbitrary length, synthesizing each 3D frame with a single diffusion process. By explicitly learning 3D structure and motion priors from large-scale 3D and motion datasets, TriDiff-4D enables skeleton-driven 4D generation that excels in temporal consistency, motion accuracy, computational efficiency, and visual fidelity. Specifically, TriDiff-4D first generates a canonical 3D avatar and a corresponding motion sequence from a text prompt, then uses a second diffusion model to animate the avatar according to the motion sequence, supporting arbitrarily long 4D generation. Experimental results demonstrate that TriDiff-4D significantly outperforms existing methods, reducing generation time from hours to seconds by eliminating the optimization process, while substantially improving the generation of complex motions with high-fidelity appearance and accurate 3D geometry.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16662v1",
        "pdf": "https://arxiv.org/pdf/2511.16662v1"
      },
      "arxiv_id": "2511.16662v1",
      "comment": "8 pages, 10 figures, Under review at a conference",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16661v1",
      "title": "Dexterity from Smart Lenses: Multi-Fingered Robot Manipulation with In-the-Wild Human Demonstrations",
      "authors": [
        "Irmak Guzey",
        "Haozhi Qi",
        "Julen Urain",
        "Changhao Wang",
        "Jessica Yin",
        "Krishna Bodduluri",
        "Mike Lambeta",
        "Lerrel Pinto",
        "Akshara Rai",
        "Jitendra Malik",
        "Tingfan Wu",
        "Akash Sharma",
        "Homanga Bharadhwaj"
      ],
      "abstract": "Learning multi-fingered robot policies from humans performing daily tasks in natural environments has long been a grand goal in the robotics community. Achieving this would mark significant progress toward generalizable robot manipulation in human environments, as it would reduce the reliance on labor-intensive robot data collection. Despite substantial efforts, progress toward this goal has been bottle-necked by the embodiment gap between humans and robots, as well as by difficulties in extracting relevant contextual and motion cues that enable learning of autonomous policies from in-the-wild human videos. We claim that with simple yet sufficiently powerful hardware for obtaining human data and our proposed framework AINA, we are now one significant step closer to achieving this dream. AINA enables learning multi-fingered policies from data collected by anyone, anywhere, and in any environment using Aria Gen 2 glasses. These glasses are lightweight and portable, feature a high-resolution RGB camera, provide accurate on-board 3D head and hand poses, and offer a wide stereo view that can be leveraged for depth estimation of the scene. This setup enables the learning of 3D point-based policies for multi-fingered hands that are robust to background changes and can be deployed directly without requiring any robot data (including online corrections, reinforcement learning, or simulation). We compare our framework against prior human-to-robot policy learning approaches, ablate our design choices, and demonstrate results across nine everyday manipulation tasks. Robot rollouts are best viewed on our website: https://aina-robot.github.io.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16661v1",
        "pdf": "https://arxiv.org/pdf/2511.16661v1"
      },
      "arxiv_id": "2511.16661v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16660v1",
      "title": "Cognitive Foundations for Reasoning and Their Manifestation in LLMs",
      "authors": [
        "Priyanka Kargupta",
        "Shuyue Stella Li",
        "Haocheng Wang",
        "Jinu Lee",
        "Shan Chen",
        "Orevaoghene Ahia",
        "Dean Light",
        "Thomas L. Griffiths",
        "Max Kleiman-Weiner",
        "Jiawei Han",
        "Asli Celikyilmaz",
        "Yulia Tsvetkov"
      ],
      "abstract": "Large language models solve complex problems yet fail on simpler variants, suggesting they achieve correct outputs through mechanisms fundamentally different from human reasoning. We synthesize cognitive science research into a taxonomy of 28 cognitive elements spanning computational constraints, meta-cognitive controls, knowledge representations, and transformation operations, then analyze their behavioral manifestations in reasoning traces. We propose a fine-grained cognitive evaluation framework and conduct the first large-scale analysis of 170K traces from 17 models across text, vision, and audio modalities, alongside 54 human think-aloud traces, which we make publicly available. Our analysis reveals systematic structural differences: humans employ hierarchical nesting and meta-cognitive monitoring while models rely on shallow forward chaining, with divergence most pronounced on ill-structured problems. Meta-analysis of 1,598 LLM reasoning papers reveals the research community concentrates on easily quantifiable behaviors (sequential organization: 55%, decomposition: 60%) while neglecting meta-cognitive controls (self-awareness: 16%, evaluation: 8%) that correlate with success. Models possess behavioral repertoires associated with success but fail to deploy them spontaneously. Leveraging these patterns, we develop test-time reasoning guidance that automatically scaffold successful structures, improving performance by up to 60% on complex problems. By bridging cognitive science and LLM research, we establish a foundation for developing models that reason through principled cognitive mechanisms rather than brittle spurious reasoning shortcuts or memorization, opening new directions for both improving model capabilities and testing theories of human cognition at scale.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16660v1",
        "pdf": "https://arxiv.org/pdf/2511.16660v1"
      },
      "arxiv_id": "2511.16660v1",
      "comment": "40 pages, 4 tables, 6 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16659v1",
      "title": "PartUV: Part-Based UV Unwrapping of 3D Meshes",
      "authors": [
        "Zhaoning Wang",
        "Xinyue Wei",
        "Ruoxi Shi",
        "Xiaoshuai Zhang",
        "Hao Su",
        "Minghua Liu"
      ],
      "abstract": "UV unwrapping flattens 3D surfaces to 2D with minimal distortion, often requiring the complex surface to be decomposed into multiple charts. Although extensively studied, existing UV unwrapping methods frequently struggle with AI-generated meshes, which are typically noisy, bumpy, and poorly conditioned. These methods often produce highly fragmented charts and suboptimal boundaries, introducing artifacts and hindering downstream tasks. We introduce PartUV, a part-based UV unwrapping pipeline that generates significantly fewer, part-aligned charts while maintaining low distortion. Built on top of a recent learning-based part decomposition method PartField, PartUV combines high-level semantic part decomposition with novel geometric heuristics in a top-down recursive framework. It ensures each chart's distortion remains below a user-specified threshold while minimizing the total number of charts. The pipeline integrates and extends parameterization and packing algorithms, incorporates dedicated handling of non-manifold and degenerate meshes, and is extensively parallelized for efficiency. Evaluated across four diverse datasets, including man-made, CAD, AI-generated, and Common Shapes, PartUV outperforms existing tools and recent neural methods in chart count and seam length, achieves comparable distortion, exhibits high success rates on challenging meshes, and enables new applications like part-specific multi-tiles packing. Our project page is at https://www.zhaoningwang.com/PartUV.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.CG",
        "cs.GR"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16659v1",
        "pdf": "https://arxiv.org/pdf/2511.16659v1"
      },
      "arxiv_id": "2511.16659v1",
      "comment": "project page: https://www.zhaoningwang.com/PartUV",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16657v1",
      "title": "Enhancing Forex Forecasting Accuracy: The Impact of Hybrid Variable Sets in Cognitive Algorithmic Trading Systems",
      "authors": [
        "Juan C. King",
        "Jose M. Amigo"
      ],
      "abstract": "This paper presents the implementation of an advanced artificial intelligence-based algorithmic trading system specifically designed for the EUR-USD pair within the high-frequency environment of the Forex market. The methodological approach centers on integrating a holistic set of input features: key fundamental macroeconomic variables (for example, Gross Domestic Product and Unemployment Rate) collected from both the Euro Zone and the United States, alongside a comprehensive suite of technical variables (including indicators, oscillators, Fibonacci levels, and price divergences). The performance of the resulting algorithm is evaluated using standard machine learning metrics to quantify predictive accuracy and backtesting simulations across historical data to assess trading profitability and risk. The study concludes with a comparative analysis to determine which class of input features, fundamental or technical, provides greater and more reliable predictive capacity for generating profitable trading signals.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI",
        "math.NA"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16657v1",
        "pdf": "https://arxiv.org/pdf/2511.16657v1"
      },
      "arxiv_id": "2511.16657v1",
      "comment": "Paper not published",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16655v1",
      "title": "Solving Spatial Supersensing Without Spatial Supersensing",
      "authors": [
        "Vishaal Udandarao",
        "Shyamgopal Karthik",
        "Surabhi S. Nath",
        "Andreas Hochlehnert",
        "Matthias Bethge",
        "Ameya Prabhu"
      ],
      "abstract": "Cambrian-S aims to take the first steps towards improving video world models with spatial supersensing by introducing (i) two benchmarks, VSI-Super-Recall (VSR) and VSI-Super-Counting (VSC), and (ii) bespoke predictive sensing inference strategies tailored to each benchmark. In this work, we conduct a critical analysis of Cambrian-S across both these fronts. First, we introduce a simple baseline, NoSense, which discards almost all temporal structure and uses only a bag-of-words SigLIP model, yet near-perfectly solves VSR, achieving 95% accuracy even on 4-hour videos. This shows benchmarks like VSR can be nearly solved without spatial cognition, world modeling or spatial supersensing. Second, we hypothesize that the tailored inference methods proposed by Cambrian-S likely exploit shortcut heuristics in the benchmark. We illustrate this with a simple sanity check on the VSC benchmark, called VSC-Repeat: We concatenate each video with itself 1-5 times, which does not change the number of unique objects. However, this simple perturbation entirely collapses the mean relative accuracy of Cambrian-S from 42% to 0%. A system that performs spatial supersensing and integrates information across experiences should recognize views of the same scene and keep object-count predictions unchanged; instead, Cambrian-S inference algorithm relies largely on a shortcut in the VSC benchmark that rooms are never revisited. Taken together, our findings suggest that (i) current VSI-Super benchmarks do not yet reliably measure spatial supersensing, and (ii) predictive-sensing inference recipes used by Cambrian-S improve performance by inadvertently exploiting shortcuts rather than from robust spatial supersensing. We include the response from the Cambrian-S authors (in Appendix A) to provide a balanced perspective alongside our claims. We release our code at: https://github.com/bethgelab/supersanity",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16655v1",
        "pdf": "https://arxiv.org/pdf/2511.16655v1"
      },
      "arxiv_id": "2511.16655v1",
      "comment": "Tech Report",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16652v1",
      "title": "Evolution Strategies at the Hyperscale",
      "authors": [
        "Bidipta Sarkar",
        "Mattie Fellows",
        "Juan Agustin Duque",
        "Alistair Letcher",
        "Antonio León Villares",
        "Anya Sims",
        "Dylan Cope",
        "Jarek Liesen",
        "Lukas Seier",
        "Theo Wolf",
        "Uljad Berdica",
        "Alexander David Goldie",
        "Aaron Courville",
        "Karin Sevegnani",
        "Shimon Whiteson",
        "Jakob Nicolaus Foerster"
      ],
      "abstract": "We introduce Evolution Guided General Optimization via Low-rank Learning (EGGROLL), an evolution strategies (ES) algorithm designed to scale backprop-free optimization to large population sizes for modern large neural network architectures with billions of parameters. ES is a set of powerful blackbox optimisation methods that can handle non-differentiable or noisy objectives with excellent scaling potential through parallelisation. Na{ï}ve ES becomes prohibitively expensive at scale due to the computational and memory costs associated with generating matrix perturbations $E\\in\\mathbb{R}^{m\\times n}$ and the batched matrix multiplications needed to compute per-member forward passes. EGGROLL overcomes these bottlenecks by generating random matrices $A\\in \\mathbb{R}^{m\\times r},\\ B\\in \\mathbb{R}^{n\\times r}$ with $r\\ll \\min(m,n)$ to form a low-rank matrix perturbation $A B^\\top$ that are used in place of the full-rank perturbation $E$. As the overall update is an average across a population of $N$ workers, this still results in a high-rank update but with significant memory and computation savings, reducing the auxiliary storage from $mn$ to $r(m+n)$ per layer and the cost of a forward pass from $\\mathcal{O}(mn)$ to $\\mathcal{O}(r(m+n))$ when compared to full-rank ES. A theoretical analysis reveals our low-rank update converges to the full-rank update at a fast $\\mathcal{O}\\left(\\frac{1}{r}\\right)$ rate. Our experiments show that (1) EGGROLL does not compromise the performance of ES in tabula-rasa RL settings, despite being faster, (2) it is competitive with GRPO as a technique for improving LLM reasoning, and (3) EGGROLL enables stable pre-training of nonlinear recurrent language models that operate purely in integer datatypes.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16652v1",
        "pdf": "https://arxiv.org/pdf/2511.16652v1"
      },
      "arxiv_id": "2511.16652v1",
      "comment": "48 pages, 12 figures, Website at https://eshyperscale.github.io/",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16653v1",
      "title": "Teacher-Guided One-Shot Pruning via Context-Aware Knowledge Distillation",
      "authors": [
        "Md. Samiul Alim",
        "Sharjil Khan",
        "Amrijit Biswas",
        "Fuad Rahman",
        "Shafin Rahman",
        "Nabeel Mohammed"
      ],
      "abstract": "Unstructured pruning remains a powerful strategy for compressing deep neural networks, yet it often demands iterative train-prune-retrain cycles, resulting in significant computational overhead. To address this challenge, we introduce a novel teacher-guided pruning framework that tightly integrates Knowledge Distillation (KD) with importance score estimation. Unlike prior approaches that apply KD as a post-pruning recovery step, our method leverages gradient signals informed by the teacher during importance score calculation to identify and retain parameters most critical for both task performance and knowledge transfer. Our method facilitates a one-shot global pruning strategy that efficiently eliminates redundant weights while preserving essential representations. After pruning, we employ sparsity-aware retraining with and without KD to recover accuracy without reactivating pruned connections. Comprehensive experiments across multiple image classification benchmarks, including CIFAR-10, CIFAR-100, and TinyImageNet, demonstrate that our method consistently achieves high sparsity levels with minimal performance degradation. Notably, our approach outperforms state-of-the-art baselines such as EPG and EPSD at high sparsity levels, while offering a more computationally efficient alternative to iterative pruning schemes like COLT. The proposed framework offers a computation-efficient, performance-preserving solution well suited for deployment in resource-constrained environments.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16653v1",
        "pdf": "https://arxiv.org/pdf/2511.16653v1"
      },
      "arxiv_id": "2511.16653v1",
      "comment": "Accepted at 2025 IEEE International Conference on Big Data (IEEE BigData 2025)",
      "journal_ref": "IEEE BigData 2025",
      "has_code": false
    },
    {
      "id": "2511.16650v1",
      "title": "Late-decoupled 3D Hierarchical Semantic Segmentation with Semantic Prototype Discrimination based Bi-branch Supervision",
      "authors": [
        "Shuyu Cao",
        "Chongshou Li",
        "Jie Xu",
        "Tianrui Li",
        "Na Zhao"
      ],
      "abstract": "3D hierarchical semantic segmentation (3DHS) is crucial for embodied intelligence applications that demand a multi-grained and multi-hierarchy understanding of 3D scenes. Despite the progress, previous 3DHS methods have overlooked following two challenges: I) multi-label learning with a parameter-sharing model can lead to multi-hierarchy conflicts in cross-hierarchy optimization, and II) the class imbalance issue is inevitable across multiple hierarchies of 3D scenes, which makes the model performance become dominated by major classes. To address these issues, we propose a novel framework with a primary 3DHS branch and an auxiliary discrimination branch. Specifically, to alleviate the multi-hierarchy conflicts, we propose a late-decoupled 3DHS framework which employs multiple decoders with the coarse-to-fine hierarchical guidance and consistency. The late-decoupled architecture can mitigate the underfitting and overfitting conflicts among multiple hierarchies and can also constrain the class imbalance problem in each individual hierarchy. Moreover, we introduce a 3DHS-oriented semantic prototype based bi-branch supervision mechanism, which additionally learns class-wise discriminative point cloud features and performs mutual supervision between the auxiliary and 3DHS branches, to enhance the class-imbalance segmentation. Extensive experiments on multiple datasets and backbones demonstrate that our approach achieves state-of-the-art 3DHS performance, and its core components can also be used as a plug-and-play enhancement to improve previous methods.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16650v1",
        "pdf": "https://arxiv.org/pdf/2511.16650v1"
      },
      "arxiv_id": "2511.16650v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16642v1",
      "title": "TRIM: Scalable 3D Gaussian Diffusion Inference with Temporal and Spatial Trimming",
      "authors": [
        "Zeyuan Yin",
        "Xiaoming Liu"
      ],
      "abstract": "Recent advances in 3D Gaussian diffusion models suffer from time-intensive denoising and post-denoising processing due to the massive number of Gaussian primitives, resulting in slow generation and limited scalability along sampling trajectories. To improve the efficiency of 3D diffusion models, we propose $\\textbf{TRIM}$ ($\\textbf{T}$rajectory $\\textbf{R}$eduction and $\\textbf{I}$nstance $\\textbf{M}$ask denoising), a post-training approach that incorporates both temporal and spatial trimming strategies, to accelerate inference without compromising output quality while supporting the inference-time scaling for Gaussian diffusion models. Instead of scaling denoising trajectories in a costly end-to-end manner, we develop a lightweight selector model to evaluate latent Gaussian primitives derived from multiple sampled noises, enabling early trajectory reduction by selecting candidates with high-quality potential. Furthermore, we introduce instance mask denoising to prune learnable Gaussian primitives by filtering out redundant background regions, reducing inference computation at each denoising step. Extensive experiments and analysis demonstrate that TRIM significantly improves both the efficiency and quality of 3D generation. Source code is available at $\\href{https://github.com/zeyuanyin/TRIM}{link}$.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16642v1",
        "pdf": "https://arxiv.org/pdf/2511.16642v1"
      },
      "arxiv_id": "2511.16642v1",
      "comment": "NeurIPS 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16637v1",
      "title": "Faster Certified Symmetry Breaking Using Orders With Auxiliary Variables",
      "authors": [
        "Markus Anders",
        "Bart Bogaerts",
        "Benjamin Bogø",
        "Arthur Gontier",
        "Wietze Koops",
        "Ciaran McCreesh",
        "Magnus O. Myreen",
        "Jakob Nordström",
        "Andy Oertel",
        "Adrian Rebola-Pardo",
        "Yong Kiam Tan"
      ],
      "abstract": "Symmetry breaking is a crucial technique in modern combinatorial solving, but it is difficult to be sure it is implemented correctly. The most successful approach to deal with bugs is to make solvers certifying, so that they output not just a solution, but also a mathematical proof of correctness in a standard format, which can then be checked by a formally verified checker. This requires justifying symmetry reasoning within the proof, but developing efficient methods for this has remained a long-standing open challenge. A fully general approach was recently proposed by Bogaerts et al. (2023), but it relies on encoding lexicographic orders with big integers, which quickly becomes infeasible for large symmetries. In this work, we develop a method for instead encoding orders with auxiliary variables. We show that this leads to orders-of-magnitude speed-ups in both theory and practice by running experiments on proof logging and checking for SAT symmetry breaking using the state-of-the-art satsuma symmetry breaker and the VeriPB proof checking toolchain.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LO",
        "cs.AI"
      ],
      "primary_category": "cs.LO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16637v1",
        "pdf": "https://arxiv.org/pdf/2511.16637v1"
      },
      "arxiv_id": "2511.16637v1",
      "comment": "26 pages. Extended version (with appendix) of the paper to appear in AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16635v1",
      "title": "SurvAgent: Hierarchical CoT-Enhanced Case Banking and Dichotomy-Based Multi-Agent System for Multimodal Survival Prediction",
      "authors": [
        "Guolin Huang",
        "Wenting Chen",
        "Jiaqi Yang",
        "Xinheng Lyu",
        "Xiaoling Luo",
        "Sen Yang",
        "Xiaohan Xing",
        "Linlin Shen"
      ],
      "abstract": "Survival analysis is critical for cancer prognosis and treatment planning, yet existing methods lack the transparency essential for clinical adoption. While recent pathology agents have demonstrated explainability in diagnostic tasks, they face three limitations for survival prediction: inability to integrate multimodal data, ineffective region-of-interest exploration, and failure to leverage experiential learning from historical cases. We introduce SurvAgent, the first hierarchical chain-of-thought (CoT)-enhanced multi-agent system for multimodal survival prediction. SurvAgent consists of two stages: (1) WSI-Gene CoT-Enhanced Case Bank Construction employs hierarchical analysis through Low-Magnification Screening, Cross-Modal Similarity-Aware Patch Mining, and Confidence-Aware Patch Mining for pathology images, while Gene-Stratified analysis processes six functional gene categories. Both generate structured reports with CoT reasoning, storing complete analytical processes for experiential learning. (2) Dichotomy-Based Multi-Expert Agent Inference retrieves similar cases via RAG and integrates multimodal reports with expert predictions through progressive interval refinement. Extensive experiments on five TCGA cohorts demonstrate SurvAgent's superority over conventional methods, proprietary MLLMs, and medical agents, establishing a new paradigm for explainable AI-driven survival prediction in precision oncology.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.CL"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16635v1",
        "pdf": "https://arxiv.org/pdf/2511.16635v1"
      },
      "arxiv_id": "2511.16635v1",
      "comment": "20 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16629v1",
      "title": "Stabilizing Policy Gradient Methods via Reward Profiling",
      "authors": [
        "Shihab Ahmed",
        "El Houcine Bergou",
        "Aritra Dutta",
        "Yue Wang"
      ],
      "abstract": "Policy gradient methods, which have been extensively studied in the last decade, offer an effective and efficient framework for reinforcement learning problems. However, their performances can often be unsatisfactory, suffering from unreliable reward improvements and slow convergence, due to high variance in gradient estimations. In this paper, we propose a universal reward profiling framework that can be seamlessly integrated with any policy gradient algorithm, where we selectively update the policy based on high-confidence performance estimations. We theoretically justify that our technique will not slow down the convergence of the baseline policy gradient methods, but with high probability, will result in stable and monotonic improvements of their performance. Empirically, on eight continuous-control benchmarks (Box2D and MuJoCo/PyBullet), our profiling yields up to 1.5x faster convergence to near-optimal returns, up to 1.75x reduction in return variance on some setups. Our profiling approach offers a general, theoretically grounded path to more reliable and efficient policy learning in complex environments.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI",
        "eess.SY"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16629v1",
        "pdf": "https://arxiv.org/pdf/2511.16629v1"
      },
      "arxiv_id": "2511.16629v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16625v1",
      "title": "MedBayes-Lite: Bayesian Uncertainty Quantification for Safe Clinical Decision Support",
      "authors": [
        "Elias Hossain",
        "Md Mehedi Hasan Nipu",
        "Maleeha Sheikh",
        "Rajib Rana",
        "Subash Neupane",
        "Niloofar Yousefi"
      ],
      "abstract": "We propose MedBayes-Lite, a lightweight Bayesian enhancement for transformer-based clinical language models designed to produce reliable, uncertainty-aware predictions. Although transformers show strong potential for clinical decision support, they remain prone to overconfidence, especially in ambiguous medical cases where calibrated uncertainty is critical. MedBayes-Lite embeds uncertainty quantification directly into existing transformer pipelines without any retraining or architectural rewiring, adding no new trainable layers and keeping parameter overhead under 3 percent. The framework integrates three components: (i) Bayesian Embedding Calibration using Monte Carlo dropout for epistemic uncertainty, (ii) Uncertainty-Weighted Attention that marginalizes over token reliability, and (iii) Confidence-Guided Decision Shaping inspired by clinical risk minimization. Across biomedical QA and clinical prediction benchmarks (MedQA, PubMedQA, MIMIC-III), MedBayes-Lite consistently improves calibration and trustworthiness, reducing overconfidence by 32 to 48 percent. In simulated clinical settings, it can prevent up to 41 percent of diagnostic errors by flagging uncertain predictions for human review. These results demonstrate its effectiveness in enabling reliable uncertainty propagation and improving interpretability in medical AI systems.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16625v1",
        "pdf": "https://arxiv.org/pdf/2511.16625v1"
      },
      "arxiv_id": "2511.16625v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16624v1",
      "title": "SAM 3D: 3Dfy Anything in Images",
      "authors": [
        "SAM 3D Team",
        "Xingyu Chen",
        "Fu-Jen Chu",
        "Pierre Gleize",
        "Kevin J Liang",
        "Alexander Sax",
        "Hao Tang",
        "Weiyao Wang",
        "Michelle Guo",
        "Thibaut Hardin",
        "Xiang Li",
        "Aohan Lin",
        "Jiawei Liu",
        "Ziqi Ma",
        "Anushka Sagar",
        "Bowen Song",
        "Xiaodong Wang",
        "Jianing Yang",
        "Bowen Zhang",
        "Piotr Dollár",
        "Georgia Gkioxari",
        "Matt Feiszli",
        "Jitendra Malik"
      ],
      "abstract": "We present SAM 3D, a generative model for visually grounded 3D object reconstruction, predicting geometry, texture, and layout from a single image. SAM 3D excels in natural images, where occlusion and scene clutter are common and visual recognition cues from context play a larger role. We achieve this with a human- and model-in-the-loop pipeline for annotating object shape, texture, and pose, providing visually grounded 3D reconstruction data at unprecedented scale. We learn from this data in a modern, multi-stage training framework that combines synthetic pretraining with real-world alignment, breaking the 3D \"data barrier\". We obtain significant gains over recent work, with at least a 5:1 win rate in human preference tests on real-world objects and scenes. We will release our code and model weights, an online demo, and a new challenging benchmark for in-the-wild 3D object reconstruction.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16624v1",
        "pdf": "https://arxiv.org/pdf/2511.16624v1"
      },
      "arxiv_id": "2511.16624v1",
      "comment": "Website: https://ai.meta.com/sam3d/",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16622v1",
      "title": "From Polynomials to Databases: Arithmetic Structures in Galois Theory",
      "authors": [
        "Jurgen Mezinaj"
      ],
      "abstract": "We develop a computational framework for classifying Galois groups of irreducible degree-7 polynomials over~$\\mathbb{Q}$, combining explicit resolvent methods with machine learning techniques. A database of over one million normalized projective septics is constructed, each annotated with algebraic invariants~$J_0, \\dots, J_4$ derived from binary transvections. For each polynomial, we compute resolvent factorizations to determine its Galois group among the seven transitive subgroups of~$S_7$ identified by Foulkes. Using this dataset, we train a neurosymbolic classifier that integrates invariant-theoretic features with supervised learning, yielding improved accuracy in detecting rare solvable groups compared to coefficient-based models. The resulting database provides a reproducible resource for constructive Galois theory and supports empirical investigations into group distribution under height constraints. The methodology extends to higher-degree cases and illustrates the utility of hybrid symbolic-numeric techniques in computational algebra.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "math.AC",
        "cs.LG"
      ],
      "primary_category": "math.AC",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16622v1",
        "pdf": "https://arxiv.org/pdf/2511.16622v1"
      },
      "arxiv_id": "2511.16622v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16618v1",
      "title": "SAM2S: Segment Anything in Surgical Videos via Semantic Long-term Tracking",
      "authors": [
        "Haofeng Liu",
        "Ziyue Wang",
        "Sudhanshu Mishra",
        "Mingqi Gao",
        "Guanyi Qin",
        "Chang Han Low",
        "Alex Y. W. Kong",
        "Yueming Jin"
      ],
      "abstract": "Surgical video segmentation is crucial for computer-assisted surgery, enabling precise localization and tracking of instruments and tissues. Interactive Video Object Segmentation (iVOS) models such as Segment Anything Model 2 (SAM2) provide prompt-based flexibility beyond methods with predefined categories, but face challenges in surgical scenarios due to the domain gap and limited long-term tracking. To address these limitations, we construct SA-SV, the largest surgical iVOS benchmark with instance-level spatio-temporal annotations (masklets) spanning eight procedure types (61k frames, 1.6k masklets), enabling comprehensive development and evaluation for long-term tracking and zero-shot generalization. Building on SA-SV, we propose SAM2S, a foundation model enhancing \\textbf{SAM2} for \\textbf{S}urgical iVOS through: (1) DiveMem, a trainable diverse memory mechanism for robust long-term tracking; (2) temporal semantic learning for instrument understanding; and (3) ambiguity-resilient learning to mitigate annotation inconsistencies across multi-source datasets. Extensive experiments demonstrate that fine-tuning on SA-SV enables substantial performance gains, with SAM2 improving by 12.99 average $\\mathcal{J}$\\&$\\mathcal{F}$ over vanilla SAM2. SAM2S further advances performance to 80.42 average $\\mathcal{J}$\\&$\\mathcal{F}$, surpassing vanilla and fine-tuned SAM2 by 17.10 and 4.11 points respectively, while maintaining 68 FPS real-time inference and strong zero-shot generalization. Code and dataset will be released at https://jinlab-imvr.github.io/SAM2S.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "eess.IV",
        "q-bio.TO"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16618v1",
        "pdf": "https://arxiv.org/pdf/2511.16618v1"
      },
      "arxiv_id": "2511.16618v1",
      "comment": "11 pages, 4 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16613v1",
      "title": "Rate-optimal community detection near the KS threshold via node-robust algorithms",
      "authors": [
        "Jingqiu Ding",
        "Yiding Hua",
        "Kasper Lindberg",
        "David Steurer",
        "Aleksandr Storozhenko"
      ],
      "abstract": "We study community detection in the \\emph{symmetric $k$-stochastic block model}, where $n$ nodes are evenly partitioned into $k$ clusters with intra- and inter-cluster connection probabilities $p$ and $q$, respectively.\n  Our main result is a polynomial-time algorithm that achieves the minimax-optimal misclassification rate\n  \\begin{equation*}\n  \\exp \\Bigl(-\\bigl(1 \\pm o(1)\\bigr) \\tfrac{C}{k}\\Bigr),\n  \\quad \\text{where } C = (\\sqrt{pn} - \\sqrt{qn})^2,\n  \\end{equation*}\n  whenever $C \\ge K\\,k^2\\,\\log k$ for some universal constant $K$, matching the Kesten--Stigum (KS) threshold up to a $\\log k$ factor.\n  Notably, this rate holds even when an adversary corrupts an $η\\le \\exp\\bigl(- (1 \\pm o(1)) \\tfrac{C}{k}\\bigr)$ fraction of the nodes.\n  To the best of our knowledge, the minimax rate was previously only attainable either via computationally inefficient procedures [ZZ15] or via polynomial-time algorithms that require strictly stronger assumptions such as $C \\ge K k^3$ [GMZZ17].\n  In the node-robust setting, the best known algorithm requires the substantially stronger condition $C \\ge K k^{102}$ [LM22].\n  Our results close this gap by providing the first polynomial-time algorithm that achieves the minimax rate near the KS threshold in both settings.\n  Our work has two key technical contributions:\n  (1) we robustify majority voting via the Sum-of-Squares framework,\n  (2) we develop a novel graph bisection algorithm via robust majority voting, which allows us to significantly improve the misclassification rate to $1/\\mathrm{poly}(k)$ for the initial estimation near the KS threshold.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "stat.ML",
        "cs.CC",
        "cs.DS",
        "cs.LG"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16613v1",
        "pdf": "https://arxiv.org/pdf/2511.16613v1"
      },
      "arxiv_id": "2511.16613v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16602v1",
      "title": "Bridging VLMs and Embodied Intelligence with Deliberate Practice Policy Optimization",
      "authors": [
        "Yi Zhang",
        "Che Liu",
        "Xiancong Ren",
        "Hanchu Ni",
        "Yingji Zhang",
        "Shuai Zhang",
        "Zeyuan Ding",
        "Jiayu Hu",
        "Haozhe Shan",
        "Junbo Qi",
        "Yan Bai",
        "Dengjie Li",
        "Jiachen Luo",
        "Yidong Wang",
        "Yong Dai",
        "Zenglin Xu",
        "Bin Shen",
        "Qifan Wang",
        "Jian Tang",
        "Xiaozhu Ju"
      ],
      "abstract": "Developing a universal and versatile embodied intelligence system presents two primary challenges: the critical embodied data bottleneck, where real-world data is scarce and expensive, and the algorithmic inefficiency of existing methods, which are resource-prohibitive. To address these limitations, we introduce Deliberate Practice Policy Optimization (DPPO), a metacognitive ``Metaloop'' training framework that dynamically alternates between supervised fine-tuning (competence expansion) and reinforcement learning (skill refinement). This enables automatic weakness identification and targeted resource allocation, specifically designed to maximize learning efficiency from sparse, finite data. Theoretically, DPPO can be formalised as a unified preference-learning framework. Empirically, training a vision-language embodied model with DPPO, referred to as Pelican-VL 1.0, yields a 20.3% performance improvement over the base model and surpasses open-source models at the 100B-parameter scale by 10.6%. We are open-sourcing both the models and code, providing the first systematic framework that alleviates the data and resource bottleneck and enables the community to build versatile embodied agents efficiently.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16602v1",
        "pdf": "https://arxiv.org/pdf/2511.16602v1"
      },
      "arxiv_id": "2511.16602v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16599v1",
      "title": "Time dependent loss reweighting for flow matching and diffusion models is theoretically justified",
      "authors": [
        "Lukas Billera",
        "Hedwig Nora Nordlinder",
        "Ben Murrell"
      ],
      "abstract": "This brief note clarifies that, in Generator Matching (which subsumes a large family of flow matching and diffusion models over continuous, manifold, and discrete spaces), both the Bregman divergence loss and the linear parameterization of the generator can depend on both the current state $X_t$ and the time $t$, and we show that the expectation over time in the loss can be taken with respect to a broad class of time distributions. We also show this for Edit Flows, which falls outside of Generator Matching. That the loss can depend on $t$ clarifies that time-dependent loss weighting schemes, often used in practice to stabilize training, are theoretically justified when the specific flow or diffusion scheme is a special case of Generator Matching (or Edit Flows). It also often simplifies the construction of $X_1$-predictor schemes, which are sometimes preferred for model-related reasons. We show examples that rely upon the dependence of linear parameterizations, and of the Bregman divergence loss, on $t$ and $X_t$.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "stat.ML",
        "cs.LG"
      ],
      "primary_category": "stat.ML",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16599v1",
        "pdf": "https://arxiv.org/pdf/2511.16599v1"
      },
      "arxiv_id": "2511.16599v1",
      "comment": "19 pages, 0 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16600v1",
      "title": "You Only Forward Once: An Efficient Compositional Judging Paradigm",
      "authors": [
        "Tianlong Zhang",
        "Hongwei Xue",
        "Shilin Yan",
        "Di Wu",
        "Chen Xu",
        "Yunyun Yang"
      ],
      "abstract": "Multimodal large language models (MLLMs) show strong potential as judges. However, existing approaches face a fundamental trade-off: adapting MLLMs to output a single score misaligns with the generative nature of MLLMs and limits fine-grained requirement understanding, whereas autoregressively generating judging analyses is prohibitively slow in high-throughput settings. Observing that judgment reduces to verifying whether inputs satisfy a set of structured requirements, we propose YOFO, a template-conditioned method that judges all requirements in a single forward pass. Built on an autoregressive model, YOFO accepts a structured requirement template and, in one inference step, produces a binary yes/no decision for each requirement by reading the logits of the final token associated with that requirement. This design yields orders-of-magnitude speedups while preserving interpretability. Extensive experiments show that YOFO not only achieves state-of-the-art results on standard recommendation datasets, but also supports dependency-aware analysis-where subsequent judgments are conditioned on previous ones-and further benefits from post-hoc CoT.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16600v1",
        "pdf": "https://arxiv.org/pdf/2511.16600v1"
      },
      "arxiv_id": "2511.16600v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16597v1",
      "title": "Variational Quantum Integrated Sensing and Communication",
      "authors": [
        "Ivana Nikoloska",
        "Osvaldo Simeone"
      ],
      "abstract": "The integration of sensing and communication functionalities within a common system is one of the main innovation drivers for next-generation networks. In this paper, we introduce a quantum integrated sensing and communication (QISAC) protocol that leverages entanglement in quantum carriers of information to enable both superdense coding and quantum sensing. The proposed approach adaptively optimizes encoding and quantum measurement via variational circuit learning, while employing classical machine learning-based decoders and estimators to process the measurement outcomes. Numerical results for qudit systems demonstrate that the proposed QISAC protocol can achieve a flexible trade-off between classical communication rate and accuracy of parameter estimation.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "quant-ph",
        "cs.IT",
        "cs.LG",
        "eess.SP"
      ],
      "primary_category": "quant-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16597v1",
        "pdf": "https://arxiv.org/pdf/2511.16597v1"
      },
      "arxiv_id": "2511.16597v1",
      "comment": "Submitted for publication",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16596v1",
      "title": "Toward Artificial Palpation: Representation Learning of Touch on Soft Bodies",
      "authors": [
        "Zohar Rimon",
        "Elisei Shafer",
        "Tal Tepper",
        "Efrat Shimron",
        "Aviv Tamar"
      ],
      "abstract": "Palpation, the use of touch in medical examination, is almost exclusively performed by humans. We investigate a proof of concept for an artificial palpation method based on self-supervised learning. Our key idea is that an encoder-decoder framework can learn a $\\textit{representation}$ from a sequence of tactile measurements that contains all the relevant information about the palpated object. We conjecture that such a representation can be used for downstream tasks such as tactile imaging and change detection. With enough training data, it should capture intricate patterns in the tactile measurements that go beyond a simple map of forces -- the current state of the art. To validate our approach, we both develop a simulation environment and collect a real-world dataset of soft objects and corresponding ground truth images obtained by magnetic resonance imaging (MRI). We collect palpation sequences using a robot equipped with a tactile sensor, and train a model that predicts sensory readings at different positions on the object. We investigate the representation learned in this process, and demonstrate its use in imaging and change detection.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16596v1",
        "pdf": "https://arxiv.org/pdf/2511.16596v1"
      },
      "arxiv_id": "2511.16596v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16595v1",
      "title": "TimeViper: A Hybrid Mamba-Transformer Vision-Language Model for Efficient Long Video Understanding",
      "authors": [
        "Boshen Xu",
        "Zihan Xiao",
        "Jiaze Li",
        "Jianzhong Ju",
        "Zhenbo Luo",
        "Jian Luan",
        "Qin Jin"
      ],
      "abstract": "We introduce TimeViper, a hybrid vision-language model designed to tackle challenges of long video understanding. Processing long videos demands both an efficient model architecture and an effective mechanism for handling extended temporal contexts. To this end, TimeViper adopts a hybrid Mamba-Transformer backbone that combines the efficiency of state-space models with the expressivity of attention mechanisms. Through this hybrid design, we reveal the vision-to-text information aggregation phenomenon, where information progressively flows from vision tokens to text tokens across increasing LLM depth, resulting in severe vision token redundancy. Motivated by this observation, we propose TransV, a token information transfer module that transfers and compresses vision tokens into instruction tokens while maintaining multimodal understanding capabilities. This design enables TimeViper to process hour-long videos exceeding 10,000 frames. Extensive experiments across multiple benchmarks demonstrate that TimeViper competes with state-of-the-art models while extending frame numbers. We further analyze attention behaviors of both Mamba and Transformer layers, offering new insights into hybrid model interpretability. This work represents an initial step towards developing, interpreting, and compressing hybrid Mamba-Transformer architectures.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16595v1",
        "pdf": "https://arxiv.org/pdf/2511.16595v1"
      },
      "arxiv_id": "2511.16595v1",
      "comment": "Project page: https://xuboshen.github.io/TimeViper",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16593v1",
      "title": "Green Resilience of Cyber-Physical Systems: Doctoral Dissertation",
      "authors": [
        "Diaeddin Rimawi"
      ],
      "abstract": "Cyber-physical systems (CPS) combine computational and physical components. Online Collaborative AI System (OL-CAIS) is a type of CPS that learn online in collaboration with humans to achieve a common goal, which makes it vulnerable to disruptive events that degrade performance. Decision-makers must therefore restore performance while limiting energy impact, creating a trade-off between resilience and greenness. This research addresses how to balance these two properties in OL-CAIS. It aims to model resilience for automatic state detection, develop agent-based policies that optimize the greenness-resilience trade-off, and understand catastrophic forgetting to maintain performance consistency. We model OL-CAIS behavior through three operational states: steady, disruptive, and final. To support recovery during disruptions, we introduce the GResilience framework, which provides recovery strategies through multi-objective optimization (one-agent), game-theoretic decision-making (two-agent), and reinforcement learning (RL-agent). We also design a measurement framework to quantify resilience and greenness. Empirical evaluation uses real and simulated experiments with a collaborative robot learning object classification from human demonstrations. Results show that the resilience model captures performance transitions during disruptions, and that GResilience policies improve green recovery by shortening recovery time, stabilizing performance, and reducing human dependency. RL-agent policies achieve the strongest results, although with a marginal increase in CO2 emissions. We also observe catastrophic forgetting after repeated disruptions, while our policies help maintain steadiness. A comparison with containerized execution shows that containerization cuts CO2 emissions by half. Overall, this research provides models, metrics, and policies that ensure the green recovery of OL-CAIS.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.SE",
        "cs.AI",
        "cs.CV",
        "cs.RO"
      ],
      "primary_category": "cs.SE",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16593v1",
        "pdf": "https://arxiv.org/pdf/2511.16593v1"
      },
      "arxiv_id": "2511.16593v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16592v1",
      "title": "gfnx: Fast and Scalable Library for Generative Flow Networks in JAX",
      "authors": [
        "Daniil Tiapkin",
        "Artem Agarkov",
        "Nikita Morozov",
        "Ian Maksimov",
        "Askar Tsyganov",
        "Timofei Gritsaev",
        "Sergey Samsonov"
      ],
      "abstract": "In this paper, we present gfnx, a fast and scalable package for training and evaluating Generative Flow Networks (GFlowNets) written in JAX. gfnx provides an extensive set of environments and metrics for benchmarking, accompanied with single-file implementations of core objectives for training GFlowNets. We include synthetic hypergrids, multiple sequence generation environments with various editing regimes and particular reward designs for molecular generation, phylogenetic tree construction, Bayesian structure learning, and sampling from the Ising model energy. Across different tasks, gfnx achieves significant wall-clock speedups compared to Pytorch-based benchmarks (such as torchgfn library) and author implementations. For example, gfnx achieves up to 55 times speedup on CPU-based sequence generation environments, and up to 80 times speedup with the GPU-based Bayesian network structure learning setup. Our package provides a diverse set of benchmarks and aims to standardize empirical evaluation and accelerate research and applications of GFlowNets. The library is available on GitHub (https://github.com/d-tiapkin/gfnx) and on pypi (https://pypi.org/project/gfnx/). Documentation is available on https://gfnx.readthedocs.io.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16592v1",
        "pdf": "https://arxiv.org/pdf/2511.16592v1"
      },
      "arxiv_id": "2511.16592v1",
      "comment": "GitHub: https://github.com/d-tiapkin/gfnx | Documentation: https://gfnx.readthedocs.io",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16590v1",
      "title": "D-GARA: A Dynamic Benchmarking Framework for GUI Agent Robustness in Real-World Anomalies",
      "authors": [
        "Sen Chen",
        "Tong Zhao",
        "Yi Bin",
        "Fei Ma",
        "Wenqi Shao",
        "Zheng Wang"
      ],
      "abstract": "Developing intelligent agents capable of operating a wide range of Graphical User Interfaces (GUIs) with human-level proficiency is a key milestone on the path toward Artificial General Intelligence. While most existing datasets and benchmarks for training and evaluating GUI agents are static and idealized, failing to reflect the complexity and unpredictability of real-world environments, particularly the presence of anomalies. To bridge this research gap, we propose D-GARA, a dynamic benchmarking framework, to evaluate Android GUI agent robustness in real-world anomalies. D-GARA introduces a diverse set of real-world anomalies that GUI agents commonly face in practice, including interruptions such as permission dialogs, battery warnings, and update prompts. Based on D-GARA framework, we construct and annotate a benchmark featuring commonly used Android applications with embedded anomalies to support broader community research. Comprehensive experiments and results demonstrate substantial performance degradation in state-of-the-art GUI agents when exposed to anomaly-rich environments, highlighting the need for robustness-aware learning. D-GARA is modular and extensible, supporting the seamless integration of new tasks, anomaly types, and interaction scenarios to meet specific evaluation goals.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16590v1",
        "pdf": "https://arxiv.org/pdf/2511.16590v1"
      },
      "arxiv_id": "2511.16590v1",
      "comment": "Accepted to AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16588v1",
      "title": "Formal Abductive Latent Explanations for Prototype-Based Networks",
      "authors": [
        "Jules Soria",
        "Zakaria Chihani",
        "Julien Girard-Satabin",
        "Alban Grastien",
        "Romain Xu-Darme",
        "Daniela Cancila"
      ],
      "abstract": "Case-based reasoning networks are machine-learning models that make predictions based on similarity between the input and prototypical parts of training samples, called prototypes. Such models are able to explain each decision by pointing to the prototypes that contributed the most to the final outcome. As the explanation is a core part of the prediction, they are often qualified as ``interpretable by design\". While promising, we show that such explanations are sometimes misleading, which hampers their usefulness in safety-critical contexts. In particular, several instances may lead to different predictions and yet have the same explanation. Drawing inspiration from the field of formal eXplainable AI (FXAI), we propose Abductive Latent Explanations (ALEs), a formalism to express sufficient conditions on the intermediate (latent) representation of the instance that imply the prediction. Our approach combines the inherent interpretability of case-based reasoning models and the guarantees provided by formal XAI. We propose a solver-free and scalable algorithm for generating ALEs based on three distinct paradigms, compare them, and present the feasibility of our approach on diverse datasets for both standard and fine-grained image classification. The associated code can be found at https://github.com/julsoria/ale",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI",
        "cs.LO"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16588v1",
        "pdf": "https://arxiv.org/pdf/2511.16588v1"
      },
      "arxiv_id": "2511.16588v1",
      "comment": "Accepted at AAAI-26",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16587v1",
      "title": "Almost Sure Convergence Analysis of Differentially Private Stochastic Gradient Methods",
      "authors": [
        "Amartya Mukherjee",
        "Jun Liu"
      ],
      "abstract": "Differentially private stochastic gradient descent (DP-SGD) has become the standard algorithm for training machine learning models with rigorous privacy guarantees. Despite its widespread use, the theoretical understanding of its long-run behavior remains limited: existing analyses typically establish convergence in expectation or with high probability, but do not address the almost sure convergence of single trajectories. In this work, we prove that DP-SGD converges almost surely under standard smoothness assumptions, both in nonconvex and strongly convex settings, provided the step sizes satisfy some standard decaying conditions. Our analysis extends to momentum variants such as the stochastic heavy ball (DP-SHB) and Nesterov's accelerated gradient (DP-NAG), where we show that careful energy constructions yield similar guarantees. These results provide stronger theoretical foundations for differentially private optimization and suggest that, despite privacy-induced distortions, the algorithm remains pathwise stable in both convex and nonconvex regimes.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "math.OC"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16587v1",
        "pdf": "https://arxiv.org/pdf/2511.16587v1"
      },
      "arxiv_id": "2511.16587v1",
      "comment": "6 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16582v1",
      "title": "Consciousness in Artificial Intelligence? A Framework for Classifying Objections and Constraints",
      "authors": [
        "Andres Campero",
        "Derek Shiller",
        "Jaan Aru",
        "Jonathan Simon"
      ],
      "abstract": "We develop a taxonomical framework for classifying challenges to the possibility of consciousness in digital artificial intelligence systems. This framework allows us to identify the level of granularity at which a given challenge is intended (the levels we propose correspond to Marr's levels) and to disambiguate its degree of force: is it a challenge to computational functionalism that leaves the possibility of digital consciousness open (degree 1), a practical challenge to digital consciousness that suggests improbability without claiming impossibility (degree 2), or an argument claiming that digital consciousness is strictly impossible (degree 3)? We apply this framework to 14 prominent examples from the scientific and philosophical literature. Our aim is not to take a side in the debate, but to provide structure and a tool for disambiguating between challenges to computational functionalism and challenges to digital consciousness, as well as between different ways of parsing such challenges.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16582v1",
        "pdf": "https://arxiv.org/pdf/2511.16582v1"
      },
      "arxiv_id": "2511.16582v1",
      "comment": "12 pages, 3 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16579v1",
      "title": "Synthesis of Safety Specifications for Probabilistic Systems",
      "authors": [
        "Gaspard Ohlmann",
        "Edwin Hamel-De le Court",
        "Francesco Belardinelli"
      ],
      "abstract": "Ensuring that agents satisfy safety specifications can be crucial in safety-critical environments. While methods exist for controller synthesis with safe temporal specifications, most existing methods restrict safe temporal specifications to probabilistic-avoidance constraints. Formal methods typically offer more expressive ways to express safety in probabilistic systems, such as Probabilistic Computation Tree Logic (PCTL) formulas. Thus, in this paper, we develop a new approach that supports more general temporal properties expressed in PCTL. Our contribution is twofold. First, we develop a theoretical framework for the Synthesis of safe-PCTL specifications. We show how the reducing global specification satisfaction to local constraints, and define CPCTL, a fragment of safe-PCTL. We demonstrate how the expressiveness of CPCTL makes it a relevant fragment for the Synthesis Problem. Second, we leverage these results and propose a new Value Iteration-based algorithm to solve the synthesis problem for these more general temporal properties, and we prove the soundness and completeness of our method.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LO",
        "cs.AI",
        "cs.LG",
        "eess.SY"
      ],
      "primary_category": "cs.LO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16579v1",
        "pdf": "https://arxiv.org/pdf/2511.16579v1"
      },
      "arxiv_id": "2511.16579v1",
      "comment": "23 pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16577v1",
      "title": "Integrating Symbolic Natural Language Understanding and Language Models for Word Sense Disambiguation",
      "authors": [
        "Kexin Zhao",
        "Ken Forbus"
      ],
      "abstract": "Word sense disambiguation is a fundamental challenge in natural language understanding. Current methods are primarily aimed at coarse-grained representations (e.g. WordNet synsets or FrameNet frames) and require hand-annotated training data to construct. This makes it difficult to automatically disambiguate richer representations (e.g. built on OpenCyc) that are needed for sophisticated inference. We propose a method that uses statistical language models as oracles for disambiguation that does not require any hand-annotation of training data. Instead, the multiple candidate meanings generated by a symbolic NLU system are converted into distinguishable natural language alternatives, which are used to query an LLM to select appropriate interpretations given the linguistic context. The selected meanings are propagated back to the symbolic NLU system. We evaluate our method against human-annotated gold answers to demonstrate its effectiveness.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16577v1",
        "pdf": "https://arxiv.org/pdf/2511.16577v1"
      },
      "arxiv_id": "2511.16577v1",
      "comment": "16 pages",
      "journal_ref": "Proceedings of the Twelfth Annual Conference on Advances in Cognitive Systems ACS-2025 (333-348)",
      "has_code": false
    },
    {
      "id": "2511.16575v1",
      "title": "ECPv2: Fast, Efficient, and Scalable Global Optimization of Lipschitz Functions",
      "authors": [
        "Fares Fourati",
        "Mohamed-Slim Alouini",
        "Vaneet Aggarwal"
      ],
      "abstract": "We propose ECPv2, a scalable and theoretically grounded algorithm for global optimization of Lipschitz-continuous functions with unknown Lipschitz constants. Building on the Every Call is Precious (ECP) framework, which ensures that each accepted function evaluation is potentially informative, ECPv2 addresses key limitations of ECP, including high computational cost and overly conservative early behavior. ECPv2 introduces three innovations: (i) an adaptive lower bound to avoid vacuous acceptance regions, (ii) a Worst-m memory mechanism that restricts comparisons to a fixed-size subset of past evaluations, and (iii) a fixed random projection to accelerate distance computations in high dimensions. We theoretically show that ECPv2 retains ECP's no-regret guarantees with optimal finite-time bounds and expands the acceptance region with high probability. We further empirically validate these findings through extensive experiments and ablation studies. Using principled hyperparameter settings, we evaluate ECPv2 across a wide range of high-dimensional, non-convex optimization problems. Across benchmarks, ECPv2 consistently matches or outperforms state-of-the-art optimizers, while significantly reducing wall-clock time.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI",
        "math.OC",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16575v1",
        "pdf": "https://arxiv.org/pdf/2511.16575v1"
      },
      "arxiv_id": "2511.16575v1",
      "comment": "Accepted at AAAI 2026 (main technical track), extended version",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16574v1",
      "title": "Erase to Retain: Low Rank Adaptation Guided Selective Unlearning in Medical Segmentation Networks",
      "authors": [
        "Nirjhor Datta",
        "Md. Golam Rabiul Alam"
      ],
      "abstract": "The ability to selectively remove knowledge from medical segmentation networks is increasingly important for privacy compliance, ethical deployment, and continual dataset revision. We introduce Erase to Retain, a controllable unlearning framework for medical image segmentation that achieves targeted forgetting without full retraining. Our method uses a teacher-student distillation paradigm with Low-Rank Adaptation (LoRA) constrained subspace updates, enabling the student network to erase lesion-specific or class-specific representations in low-rank decoder spaces while preserving global anatomical understanding. During the strong unlearning phase, LoRA modules are adversarially optimized to contradict the teacher's confident predictions on a designated forget subset, enforcing semantic removal. This is followed by a gentle restoration phase that recovers generalization on retained data through head-only supervised refinement.\n  For ISIC segmentation, the student reduces forget-set IoU from 0.875 to 0.509 while maintaining competitive performance on the retain and validation splits (0.647 to 0.677 IoU). On the cross-domain CHASE dataset, Erase to Retain consistently lowers forget-set IoU while preserving utility on retain and validation sets. For ISIC classification, our method decreases accuracy on the forget subset from 87.0 percent to 64.1 percent while improving retain accuracy from 83.9 percent to 90.6 percent.\n  These results demonstrate that LoRA-based subspace unlearning provides a practical pathway toward responsible, controllable, and reversible unlearning in medical image analysis, enabling models to forget sensitive samples or structures while preserving performance where it matters most.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16574v1",
        "pdf": "https://arxiv.org/pdf/2511.16574v1"
      },
      "arxiv_id": "2511.16574v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16573v1",
      "title": "An Exterior-Embedding Neural Operator Framework for Preserving Conservation Laws",
      "authors": [
        "Huanshuo Dong",
        "Hong Wang",
        "Hao Wu",
        "Zhiwei Zhuang",
        "Xuanze Yang",
        "Ruiqi Shu",
        "Yuan Gao",
        "Xiaomeng Huang"
      ],
      "abstract": "Neural operators have demonstrated considerable effectiveness in accelerating the solution of time-dependent partial differential equations (PDEs) by directly learning governing physical laws from data. However, for PDEs governed by conservation laws(e.g., conservation of mass, energy, or matter), existing neural operators fail to satisfy conservation properties, which leads to degraded model performance and limited generalizability. Moreover, we observe that distinct PDE problems generally require different optimal neural network architectures. This finding underscores the inherent limitations of specialized models in generalizing across diverse problem domains.\n  To address these limitations, we propose Exterior-Embedded Conservation Framework (ECF), a universal conserving framework that can be integrated with various data-driven neural operators to enforce conservation laws strictly in predictions. The framework consists of two key components: a conservation quantity encoder that extracts conserved quantities from input data, and a conservation quantity decoder that adjusts the neural operator's predictions using these quantities to ensure strict conservation compliance in the final output. Since our architecture enforces conservation laws, we theoretically prove that it enhances model performance. To validate the performance of our method, we conduct experiments on multiple conservation-law-constrained PDE scenarios, including adiabatic systems, shallow water equations, and the Allen-Cahn problem. These baselines demonstrate that our method effectively improves model accuracy while strictly enforcing conservation laws in the predictions.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.OH",
        "cs.LG"
      ],
      "primary_category": "cs.OH",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16573v1",
        "pdf": "https://arxiv.org/pdf/2511.16573v1"
      },
      "arxiv_id": "2511.16573v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16571v1",
      "title": "Boosting Predictive Performance on Tabular Data through Data Augmentation with Latent-Space Flow-Based Diffusion",
      "authors": [
        "Md. Tawfique Ihsan",
        "Md. Rakibul Hasan Rafi",
        "Ahmed Shoyeb Raihan",
        "Imtiaz Ahmed",
        "Abdullahil Azeem"
      ],
      "abstract": "Severe class imbalance is common in real-world tabular learning, where rare but important minority classes are essential for reliable prediction. Existing generative oversampling methods such as GANs, VAEs, and diffusion models can improve minority-class performance, but they often struggle with tabular heterogeneity, training stability, and privacy concerns. We propose a family of latent-space, tree-driven diffusion methods for minority oversampling that use conditional flow matching with gradient-boosted trees as the vector-field learner. The models operate in compact latent spaces to preserve tabular structure and reduce computation. We introduce three variants: PCAForest, which uses linear PCA embedding; EmbedForest, which uses a learned nonlinear embedding; and AttentionForest, which uses an attention-augmented embedding. Each method couples a GBT-based flow with a decoder back to the original feature space. Across 11 datasets from healthcare, finance, and manufacturing, AttentionForest achieves the best average minority recall while maintaining competitive precision, calibration, and distributional similarity. PCAForest and EmbedForest reach similar utility with much faster generation, offering favorable accuracy-efficiency trade-offs. Privacy evaluated with nearest-neighbor distance ratio and distance-to-closest-record is comparable to or better than the ForestDiffusion baseline. Ablation studies show that smaller embeddings tend to improve minority recall, while aggressive learning rates harm stability. Overall, latent-space, tree-driven diffusion provides an efficient and privacy-aware approach to high-fidelity tabular data augmentation under severe class imbalance.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16571v1",
        "pdf": "https://arxiv.org/pdf/2511.16571v1"
      },
      "arxiv_id": "2511.16571v1",
      "comment": "35 Pages",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16567v1",
      "title": "POMA-3D: The Point Map Way to 3D Scene Understanding",
      "authors": [
        "Ye Mao",
        "Weixun Luo",
        "Ranran Huang",
        "Junpeng Jing",
        "Krystian Mikolajczyk"
      ],
      "abstract": "In this paper, we introduce POMA-3D, the first self-supervised 3D representation model learned from point maps. Point maps encode explicit 3D coordinates on a structured 2D grid, preserving global 3D geometry while remaining compatible with the input format of 2D foundation models. To transfer rich 2D priors into POMA-3D, a view-to-scene alignment strategy is designed. Moreover, as point maps are view-dependent with respect to a canonical space, we introduce POMA-JEPA, a joint embedding-predictive architecture that enforces geometrically consistent point map features across multiple views. Additionally, we introduce ScenePoint, a point map dataset constructed from 6.5K room-level RGB-D scenes and 1M 2D image scenes to facilitate large-scale POMA-3D pretraining. Experiments show that POMA-3D serves as a strong backbone for both specialist and generalist 3D understanding. It benefits diverse tasks, including 3D question answering, embodied navigation, scene retrieval, and embodied localization, all achieved using only geometric inputs (i.e., 3D coordinates). Overall, our POMA-3D explores a point map way to 3D scene understanding, addressing the scarcity of pretrained priors and limited data in 3D representation learning. Project Page: https://matchlab-imperial.github.io/poma3d/",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16567v1",
        "pdf": "https://arxiv.org/pdf/2511.16567v1"
      },
      "arxiv_id": "2511.16567v1",
      "comment": "11 pages, 6 tables, 5 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16566v1",
      "title": "NutriScreener: Retrieval-Augmented Multi-Pose Graph Attention Network for Malnourishment Screening",
      "authors": [
        "Misaal Khan",
        "Mayank Vatsa",
        "Kuldeep Singh",
        "Richa Singh"
      ],
      "abstract": "Child malnutrition remains a global crisis, yet existing screening methods are laborious and poorly scalable, hindering early intervention. In this work, we present NutriScreener, a retrieval-augmented, multi-pose graph attention network that combines CLIP-based visual embeddings, class-boosted knowledge retrieval, and context awareness to enable robust malnutrition detection and anthropometric prediction from children's images, simultaneously addressing generalizability and class imbalance. In a clinical study, doctors rated it 4.3/5 for accuracy and 4.6/5 for efficiency, confirming its deployment readiness in low-resource settings. Trained and tested on 2,141 children from AnthroVision and additionally evaluated on diverse cross-continent populations, including ARAN and an in-house collected CampusPose dataset, it achieves 0.79 recall, 0.82 AUC, and significantly lower anthropometric RMSEs, demonstrating reliable measurement in unconstrained pediatric settings. Cross-dataset results show up to 25% recall gain and up to 3.5 cm RMSE reduction using demographically matched knowledge bases. NutriScreener offers a scalable and accurate solution for early malnutrition detection in low-resource environments.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16566v1",
        "pdf": "https://arxiv.org/pdf/2511.16566v1"
      },
      "arxiv_id": "2511.16566v1",
      "comment": "Accepted in AAAI 2026 Special Track on AI for Social Impact",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16557v1",
      "title": "Interfacial and bulk switching MoS2 memristors for an all-2D reservoir computing framework",
      "authors": [
        "Asmita S. Thool",
        "Sourodeep Roy",
        "Prahalad Kanti Barman",
        "Kartick Biswas",
        "Pavan Nukala",
        "Abhishek Misra",
        "Saptarshi Das",
        "and Bhaswar Chakrabarti"
      ],
      "abstract": "In this study, we design a reservoir computing (RC) network by exploiting short- and long-term memory dynamics in Au/Ti/MoS$_2$/Au memristive devices. The temporal dynamics is engineered by controlling the thickness of the Chemical Vapor Deposited (CVD) MoS$_2$ films. Devices with a monolayer (1L)-MoS$_2$ film exhibit volatile (short-term memory) switching dynamics. We also report non-volatile resistance switching with excellent uniformity and analog behavior in conductance tuning for the multilayer (ML) MoS$_2$ memristive devices. We correlate this performance with trap-assisted space-charge limited conduction (SCLC) mechanism, leading to a bulk-limited resistance switching behavior. Four-bit reservoir states are generated using volatile memristors. The readout layer is implemented with an array of nonvolatile synapses. This small RC network achieves 89.56\\% precision in a spoken-digit recognition task and is also used to analyze a nonlinear time series equation.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.ET",
        "cs.AI"
      ],
      "primary_category": "cs.ET",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16557v1",
        "pdf": "https://arxiv.org/pdf/2511.16557v1"
      },
      "arxiv_id": "2511.16557v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16555v1",
      "title": "Lite Any Stereo: Efficient Zero-Shot Stereo Matching",
      "authors": [
        "Junpeng Jing",
        "Weixun Luo",
        "Ye Mao",
        "Krystian Mikolajczyk"
      ],
      "abstract": "Recent advances in stereo matching have focused on accuracy, often at the cost of significantly increased model size. Traditionally, the community has regarded efficient models as incapable of zero-shot ability due to their limited capacity. In this paper, we introduce Lite Any Stereo, a stereo depth estimation framework that achieves strong zero-shot generalization while remaining highly efficient. To this end, we design a compact yet expressive backbone to ensure scalability, along with a carefully crafted hybrid cost aggregation module. We further propose a three-stage training strategy on million-scale data to effectively bridge the sim-to-real gap. Together, these components demonstrate that an ultra-light model can deliver strong generalization, ranking 1st across four widely used real-world benchmarks. Remarkably, our model attains accuracy comparable to or exceeding state-of-the-art non-prior-based accurate methods while requiring less than 1% computational cost, setting a new standard for efficient stereo matching.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16555v1",
        "pdf": "https://arxiv.org/pdf/2511.16555v1"
      },
      "arxiv_id": "2511.16555v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16551v1",
      "title": "Toward Valid Generative Clinical Trial Data with Survival Endpoints",
      "authors": [
        "Perrine Chassat",
        "Van Tuan Nguyen",
        "Lucas Ducrot",
        "Emilie Lanoy",
        "Agathe Guilloux"
      ],
      "abstract": "Clinical trials face mounting challenges: fragmented patient populations, slow enrollment, and unsustainable costs, particularly for late phase trials in oncology and rare diseases. While external control arms built from real-world data have been explored, a promising alternative is the generation of synthetic control arms using generative AI. A central challenge is the generation of time-to-event outcomes, which constitute primary endpoints in oncology and rare disease trials, but are difficult to model under censoring and small sample sizes. Existing generative approaches, largely GAN-based, are data-hungry, unstable, and rely on strong assumptions such as independent censoring. We introduce a variational autoencoder (VAE) that jointly generates mixed-type covariates and survival outcomes within a unified latent variable framework, without assuming independent censoring. Across synthetic and real trial datasets, we evaluate our model in two realistic scenarios: (i) data sharing under privacy constraints, where synthetic controls substitute for original data, and (ii) control-arm augmentation, where synthetic patients mitigate imbalances between treated and control groups. Our method outperforms GAN baselines on fidelity, utility, and privacy metrics, while revealing systematic miscalibration of type I error and power. We propose a post-generation selection procedure that improves calibration, highlighting both progress and open challenges for generative survival modeling.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "stat.AP",
        "stat.ME",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16551v1",
        "pdf": "https://arxiv.org/pdf/2511.16551v1"
      },
      "arxiv_id": "2511.16551v1",
      "comment": "P. Chassat and V.T. Nguyen contributed equally to this work",
      "journal_ref": "Machine Learning for Health (ML4H) 2025",
      "has_code": false
    },
    {
      "id": "2511.16550v1",
      "title": "Broad stochastic configuration residual learning system for norm-convergent universal approximation",
      "authors": [
        "Han Su",
        "Zhongyan Li",
        "Wanquan Liu"
      ],
      "abstract": "Universal approximation serves as the foundation of neural network learning algorithms. However, some networks establish their universal approximation property by demonstrating that the iterative errors converge in probability measure rather than the more rigorous norm convergence, which makes the universal approximation property of randomized learning networks highly sensitive to random parameter selection, Broad residual learning system (BRLS), as a member of randomized learning models, also encounters this issue. We theoretically demonstrate the limitation of its universal approximation property, that is, the iterative errors do not satisfy norm convergence if the selection of random parameters is inappropriate and the convergence rate meets certain conditions. To address this issue, we propose the broad stochastic configuration residual learning system (BSCRLS) algorithm, which features a novel supervisory mechanism adaptively constraining the range settings of random parameters on the basis of BRLS framework, Furthermore, we prove the universal approximation theorem of BSCRLS based on the more stringent norm convergence. Three versions of incremental BSCRLS algorithms are presented to satisfy the application requirements of various network updates. Solar panels dust detection experiments are performed on publicly available dataset and compared with 13 deep and broad learning algorithms. Experimental results reveal the effectiveness and superiority of BSCRLS algorithms.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16550v1",
        "pdf": "https://arxiv.org/pdf/2511.16550v1"
      },
      "arxiv_id": "2511.16550v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16549v1",
      "title": "FairLRF: Achieving Fairness through Sparse Low Rank Factorization",
      "authors": [
        "Yuanbo Guo",
        "Jun Xia",
        "Yiyu Shi"
      ],
      "abstract": "As deep learning (DL) techniques become integral to various applications, ensuring model fairness while maintaining high performance has become increasingly critical, particularly in sensitive fields such as medical diagnosis. Although a variety of bias-mitigation methods have been proposed, many rely on computationally expensive debiasing strategies or suffer substantial drops in model accuracy, which limits their practicality in real-world, resource-constrained settings. To address this issue, we propose a fairness-oriented low rank factorization (LRF) framework that leverages singular value decomposition (SVD) to improve DL model fairness. Unlike traditional SVD, which is mainly used for model compression by decomposing and reducing weight matrices, our work shows that SVD can also serve as an effective tool for fairness enhancement. Specifically, we observed that elements in the unitary matrices obtained from SVD contribute unequally to model bias across groups defined by sensitive attributes. Motivated by this observation, we propose a method, named FairLRF, that selectively removes bias-inducing elements from unitary matrices to reduce group disparities, thus enhancing model fairness. Extensive experiments show that our method outperforms conventional LRF methods as well as state-of-the-art fairness-enhancing techniques. Additionally, an ablation study examines how major hyper-parameters may influence the performance of processed models. To the best of our knowledge, this is the first work utilizing SVD not primarily for compression but for fairness enhancement.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16549v1",
        "pdf": "https://arxiv.org/pdf/2511.16549v1"
      },
      "arxiv_id": "2511.16549v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16548v1",
      "title": "Utilizing Large Language Models for Zero-Shot Medical Ontology Extension from Clinical Notes",
      "authors": [
        "Guanchen Wu",
        "Yuzhang Xie",
        "Huanwei Wu",
        "Zhe He",
        "Hui Shao",
        "Xiao Hu",
        "Carl Yang"
      ],
      "abstract": "Integrating novel medical concepts and relationships into existing ontologies can significantly enhance their coverage and utility for both biomedical research and clinical applications. Clinical notes, as unstructured documents rich with detailed patient observations, offer valuable context-specific insights and represent a promising yet underutilized source for ontology extension. Despite this potential, directly leveraging clinical notes for ontology extension remains largely unexplored. To address this gap, we propose CLOZE, a novel framework that uses large language models (LLMs) to automatically extract medical entities from clinical notes and integrate them into hierarchical medical ontologies. By capitalizing on the strong language understanding and extensive biomedical knowledge of pre-trained LLMs, CLOZE effectively identifies disease-related concepts and captures complex hierarchical relationships. The zero-shot framework requires no additional training or labeled data, making it a cost-efficient solution. Furthermore, CLOZE ensures patient privacy through automated removal of protected health information (PHI). Experimental results demonstrate that CLOZE provides an accurate, scalable, and privacy-preserving ontology extension framework, with strong potential to support a wide range of downstream applications in biomedical research and clinical informatics.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16548v1",
        "pdf": "https://arxiv.org/pdf/2511.16548v1"
      },
      "arxiv_id": "2511.16548v1",
      "comment": "BIBM 2025 (WS#44: Biological ontologies and knowledge bases (BiOK) in the LLM era)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16546v1",
      "title": "Progressive Supernet Training for Efficient Visual Autoregressive Modeling",
      "authors": [
        "Xiaoyue Chen",
        "Yuling Shi",
        "Kaiyuan Li",
        "Huandong Wang",
        "Yong Li",
        "Xiaodong Gu",
        "Xinlei Chen",
        "Mingbao Lin"
      ],
      "abstract": "Visual Auto-Regressive (VAR) models significantly reduce inference steps through the \"next-scale\" prediction paradigm. However, progressive multi-scale generation incurs substantial memory overhead due to cumulative KV caching, limiting practical deployment.\n  We observe a scale-depth asymmetric dependency in VAR: early scales exhibit extreme sensitivity to network depth, while later scales remain robust to depth reduction. Inspired by this, we propose VARiant: by equidistant sampling, we select multiple subnets ranging from 16 to 2 layers from the original 30-layer VAR-d30 network. Early scales are processed by the full network, while later scales utilize subnet. Subnet and the full network share weights, enabling flexible depth adjustment within a single model.\n  However, weight sharing between subnet and the entire network can lead to optimization conflicts. To address this, we propose a progressive training strategy that breaks through the Pareto frontier of generation quality for both subnets and the full network under fixed-ratio training, achieving joint optimality.\n  Experiments on ImageNet demonstrate that, compared to the pretrained VAR-d30 (FID 1.95), VARiant-d16 and VARiant-d8 achieve nearly equivalent quality (FID 2.05/2.12) while reducing memory consumption by 40-65%. VARiant-d2 achieves 3.5 times speedup and 80% memory reduction at moderate quality cost (FID 2.97). In terms of deployment, VARiant's single-model architecture supports zero-cost runtime depth switching and provides flexible deployment options from high quality to extreme efficiency, catering to diverse application scenarios.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16546v1",
        "pdf": "https://arxiv.org/pdf/2511.16546v1"
      },
      "arxiv_id": "2511.16546v1",
      "comment": "Submitted to CVPR 2025. 10 pages, 7 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16544v1",
      "title": "WER is Unaware: Assessing How ASR Errors Distort Clinical Understanding in Patient Facing Dialogue",
      "authors": [
        "Zachary Ellis",
        "Jared Joselowitz",
        "Yash Deo",
        "Yajie He",
        "Anna Kalygina",
        "Aisling Higham",
        "Mana Rahimzadeh",
        "Yan Jia",
        "Ibrahim Habli",
        "Ernest Lim"
      ],
      "abstract": "As Automatic Speech Recognition (ASR) is increasingly deployed in clinical dialogue, standard evaluations still rely heavily on Word Error Rate (WER). This paper challenges that standard, investigating whether WER or other common metrics correlate with the clinical impact of transcription errors. We establish a gold-standard benchmark by having expert clinicians compare ground-truth utterances to their ASR-generated counterparts, labeling the clinical impact of any discrepancies found in two distinct doctor-patient dialogue datasets. Our analysis reveals that WER and a comprehensive suite of existing metrics correlate poorly with the clinician-assigned risk labels (No, Minimal, or Significant Impact). To bridge this evaluation gap, we introduce an LLM-as-a-Judge, programmatically optimized using GEPA to replicate expert clinical assessment. The optimized judge (Gemini-2.5-Pro) achieves human-comparable performance, obtaining 90% accuracy and a strong Cohen's $κ$ of 0.816. This work provides a validated, automated framework for moving ASR evaluation beyond simple textual fidelity to a necessary, scalable assessment of safety in clinical dialogue.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16544v1",
        "pdf": "https://arxiv.org/pdf/2511.16544v1"
      },
      "arxiv_id": "2511.16544v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16543v1",
      "title": "The Oracle and The Prism: A Decoupled and Efficient Framework for Generative Recommendation Explanation",
      "authors": [
        "Jiaheng Zhang",
        "Daqiang Zhang"
      ],
      "abstract": "The integration of Large Language Models (LLMs) into explainable recommendation systems often leads to a performance-efficiency trade-off in end-to-end architectures, where joint optimization of ranking and explanation can result in suboptimal compromises. To resolve this, we propose Prism, a novel decoupled framework that rigorously separates the recommendation process into a dedicated ranking stage and an explanation generation stage.\n  Inspired by knowledge distillation, Prism leverages a powerful teacher LLM (e.g., FLAN-T5-XXL) as an Oracle to produce high-fidelity explanatory knowledge. A compact, fine-tuned student model (e.g., BART-Base), the Prism, then specializes in synthesizing this knowledge into personalized explanations. This decomposition ensures that each component is optimized for its specific objective, eliminating inherent conflicts in coupled models.\n  Extensive experiments on benchmark datasets demonstrate that our 140M-parameter Prism model significantly outperforms its 11B-parameter teacher in human evaluations of faithfulness and personalization, while achieving a 24 times speedup and a 10 times reduction in memory consumption during inference. These results validate that decoupling, coupled with targeted distillation, provides an efficient and effective pathway to high-quality explainable recommendation.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.IR",
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.IR",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16543v1",
        "pdf": "https://arxiv.org/pdf/2511.16543v1"
      },
      "arxiv_id": "2511.16543v1",
      "comment": "11 pages,3 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16542v1",
      "title": "EOGS++: Earth Observation Gaussian Splatting with Internal Camera Refinement and Direct Panchromatic Rendering",
      "authors": [
        "Pierrick Bournez",
        "Luca Savant Aira",
        "Thibaud Ehret",
        "Gabriele Facciolo"
      ],
      "abstract": "Recently, 3D Gaussian Splatting has been introduced as a compelling alternative to NeRF for Earth observation, offering com- petitive reconstruction quality with significantly reduced training times. In this work, we extend the Earth Observation Gaussian Splatting (EOGS) framework to propose EOGS++, a novel method tailored for satellite imagery that directly operates on raw high-resolution panchromatic data without requiring external preprocessing. Furthermore, leveraging optical flow techniques we embed bundle adjustment directly within the training process, avoiding reliance on external optimization tools while improving camera pose estimation. We also introduce several improvements to the original implementation, including early stopping and TSDF post-processing, all contributing to sharper reconstructions and better geometric accuracy. Experiments on the IARPA 2016 and DFC2019 datasets demonstrate that EOGS++ achieves state-of-the-art performance in terms of reconstruction quality and effi- ciency, outperforming the original EOGS method and other NeRF-based methods while maintaining the computational advantages of Gaussian Splatting. Our model demonstrates an improvement from 1.33 to 1.19 mean MAE errors on buildings compared to the original EOGS models",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16542v1",
        "pdf": "https://arxiv.org/pdf/2511.16542v1"
      },
      "arxiv_id": "2511.16542v1",
      "comment": "8 pages, ISPRS",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16541v1",
      "title": "Supervised Contrastive Learning for Few-Shot AI-Generated Image Detection and Attribution",
      "authors": [
        "Jaime Álvarez Urueña",
        "David Camacho",
        "Javier Huertas Tato"
      ],
      "abstract": "The rapid advancement of generative artificial intelligence has enabled the creation of synthetic images that are increasingly indistinguishable from authentic content, posing significant challenges for digital media integrity. This problem is compounded by the accelerated release cycle of novel generative models, which renders traditional detection approaches (reliant on periodic retraining) computationally infeasible and operationally impractical.\n  This work proposes a novel two-stage detection framework designed to address the generalization challenge inherent in synthetic image detection. The first stage employs a vision deep learning model trained via supervised contrastive learning to extract discriminative embeddings from input imagery. Critically, this model was trained on a strategically partitioned subset of available generators, with specific architectures withheld from training to rigorously ablate cross-generator generalization capabilities. The second stage utilizes a k-nearest neighbors (k-NN) classifier operating on the learned embedding space, trained in a few-shot learning paradigm incorporating limited samples from previously unseen test generators.\n  With merely 150 images per class in the few-shot learning regime, which are easily obtainable from current generation models, the proposed framework achieves an average detection accuracy of 91.3\\%, representing a 5.2 percentage point improvement over existing approaches . For the source attribution task, the proposed approach obtains improvements of of 14.70\\% and 4.27\\% in AUC and OSCR respectively on an open set classification context, marking a significant advancement toward robust, scalable forensic attribution systems capable of adapting to the evolving generative AI landscape without requiring exhaustive retraining protocols.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16541v1",
        "pdf": "https://arxiv.org/pdf/2511.16541v1"
      },
      "arxiv_id": "2511.16541v1",
      "comment": "17 pages, 6 figures, 6 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16540v1",
      "title": "Beyond Tokens in Language Models: Interpreting Activations through Text Genre Chunks",
      "authors": [
        "Éloïse Benito-Rodriguez",
        "Einar Urdshals",
        "Jasmina Nasufi",
        "Nicky Pochinkov"
      ],
      "abstract": "Understanding Large Language Models (LLMs) is key to ensure their safe and beneficial deployment. This task is complicated by the difficulty of interpretability of LLM structures, and the inability to have all their outputs human-evaluated. In this paper, we present the first step towards a predictive framework, where the genre of a text used to prompt an LLM, is predicted based on its activations. Using Mistral-7B and two datasets, we show that genre can be extracted with F1-scores of up to 98% and 71% using scikit-learn classifiers. Across both datasets, results consistently outperform the control task, providing a proof of concept that text genres can be inferred from LLMs with shallow learning models.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16540v1",
        "pdf": "https://arxiv.org/pdf/2511.16540v1"
      },
      "arxiv_id": "2511.16540v1",
      "comment": "13 pages, 5 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16535v1",
      "title": "Investigating Optical Flow Computation: From Local Methods to a Multiresolution Horn-Schunck Implementation with Bilinear Interpolation",
      "authors": [
        "Haytham Ziani"
      ],
      "abstract": "This paper presents an applied analysis of local and global methods, with a focus on the Horn-Schunck algorithm for optical flow computation. We explore the theoretical and practical aspects of local approaches, such as the Lucas-Kanade method, and global techniques such as Horn-Schunck. Additionally, we implement a multiresolution version of the Horn-Schunck algorithm, using bilinear interpolation and prolongation to improve accuracy and convergence. The study investigates the effectiveness of these combined strategies in estimating motion between frames, particularly under varying image conditions.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16535v1",
        "pdf": "https://arxiv.org/pdf/2511.16535v1"
      },
      "arxiv_id": "2511.16535v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16532v1",
      "title": "Enhancing Multi-Camera Gymnast Tracking Through Domain Knowledge Integration",
      "authors": [
        "Fan Yang",
        "Shigeyuki Odashima",
        "Shoichi Masui",
        "Ikuo Kusajima",
        "Sosuke Yamao",
        "Shan Jiang"
      ],
      "abstract": "We present a robust multi-camera gymnast tracking, which has been applied at international gymnastics championships for gymnastics judging. Despite considerable progress in multi-camera tracking algorithms, tracking gymnasts presents unique challenges: (i) due to space restrictions, only a limited number of cameras can be installed in the gymnastics stadium; and (ii) due to variations in lighting, background, uniforms, and occlusions, multi-camera gymnast detection may fail in certain views and only provide valid detections from two opposing views. These factors complicate the accurate determination of a gymnast's 3D trajectory using conventional multi-camera triangulation. To alleviate this issue, we incorporate gymnastics domain knowledge into our tracking solution. Given that a gymnast's 3D center typically lies within a predefined vertical plane during \\revised{much of their} performance, we can apply a ray-plane intersection to generate coplanar 3D trajectory candidates for opposing-view detections. More specifically, we propose a novel cascaded data association (DA) paradigm that employs triangulation to generate 3D trajectory candidates when cross-view detections are sufficient, and resort to the ray-plane intersection when they are insufficient. Consequently, coplanar candidates are used to compensate for uncertain trajectories, thereby minimizing tracking failures. The robustness of our method is validated through extensive experimentation, demonstrating its superiority over existing methods in challenging scenarios. Furthermore, our gymnastics judging system, equipped with this tracking method, has been successfully applied to recent Gymnastics World Championships, earning significant recognition from the International Gymnastics Federation.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16532v1",
        "pdf": "https://arxiv.org/pdf/2511.16532v1"
      },
      "arxiv_id": "2511.16532v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16528v1",
      "title": "TurkColBERT: A Benchmark of Dense and Late-Interaction Models for Turkish Information Retrieval",
      "authors": [
        "Özay Ezerceli",
        "Mahmoud El Hussieni",
        "Selva Taş",
        "Reyhan Bayraktar",
        "Fatma Betül Terzioğlu",
        "Yusuf Çelebi",
        "Yağız Asker"
      ],
      "abstract": "Neural information retrieval systems excel in high-resource languages but remain underexplored for morphologically rich, lower-resource languages such as Turkish. Dense bi-encoders currently dominate Turkish IR, yet late-interaction models -- which retain token-level representations for fine-grained matching -- have not been systematically evaluated. We introduce TurkColBERT, the first comprehensive benchmark comparing dense encoders and late-interaction models for Turkish retrieval. Our two-stage adaptation pipeline fine-tunes English and multilingual encoders on Turkish NLI/STS tasks, then converts them into ColBERT-style retrievers using PyLate trained on MS MARCO-TR. We evaluate 10 models across five Turkish BEIR datasets covering scientific, financial, and argumentative domains. Results show strong parameter efficiency: the 1.0M-parameter colbert-hash-nano-tr is 600$\\times$ smaller than the 600M turkish-e5-large dense encoder while preserving over 71\\% of its average mAP. Late-interaction models that are 3--5$\\times$ smaller than dense encoders significantly outperform them; ColmmBERT-base-TR yields up to +13.8\\% mAP on domain-specific tasks. For production-readiness, we compare indexing algorithms: MUVERA+Rerank is 3.33$\\times$ faster than PLAID and offers +1.7\\% relative mAP gain. This enables low-latency retrieval, with ColmmBERT-base-TR achieving 0.54 ms query times under MUVERA. We release all checkpoints, configs, and evaluation scripts. Limitations include reliance on moderately sized datasets ($\\leq$50K documents) and translated benchmarks, which may not fully reflect real-world Turkish retrieval conditions; larger-scale MUVERA evaluations remain necessary.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.IR"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16528v1",
        "pdf": "https://arxiv.org/pdf/2511.16528v1"
      },
      "arxiv_id": "2511.16528v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16527v1",
      "title": "Contrastive vision-language learning with paraphrasing and negation",
      "authors": [
        "Kwun Ho Ngan",
        "Saman Sadeghi Afgeh",
        "Joe Townsend",
        "Artur d'Avila Garcez"
      ],
      "abstract": "Contrastive vision-language models continue to be the dominant approach for image and text retrieval. Contrastive Language-Image Pre-training (CLIP) trains two neural networks in contrastive manner to align their image and text embeddings in a shared latent space. Recent results evaluating CLIP on negated or paraphrased text have shown mixed performance because negation changes meaning radically with minimal lexical changes, while paraphrasing can create very different textual expressions with the same intended meaning. This poses a significant challenge for improving the evaluation results and alignment of vision-language models. To address this challenge, this paper evaluates the combination of paraphrasing and negation, proposes a new CLIP contrastive loss function accounting for both paraphrasing and negation, and applies LLM-generated training triples consisting of original, paraphrased and negated textual captions to CLIP-like training models. The approach, called SemCLIP, is shown to move paraphrased captions towards the original image embeddings while pushing negated captions further away in embedding space. Empirically, SemCLIP is shown to be capable of preserving CLIP's performance while increasing considerably the distances to negated captions. On the CC-Neg benchmark using an original over negation image-retrieval accuracy metric, SemCLIP improves accuracy from 68.1% to 78.1%. Although results are mixed when compared with CLIP on the Sugarcrepe++ benchmark, SemCLIP's performance is generally better than the models trained with negated captions. This robustness to negation extends to downstream zero-shot classification tasks where SemCLIP pre-trained on Sugarcrepe++ performs better than CLIP on all tested downstream tasks. These results indicate that SemCLIP can achieve significant robustness to semantic transformations.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16527v1",
        "pdf": "https://arxiv.org/pdf/2511.16527v1"
      },
      "arxiv_id": "2511.16527v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16524v1",
      "title": "BoxingVI: A Multi-Modal Benchmark for Boxing Action Recognition and Localization",
      "authors": [
        "Rahul Kumar",
        "Vipul Baghel",
        "Sudhanshu Singh",
        "Bikash Kumar Badatya",
        "Shivam Yadav",
        "Babji Srinivasan",
        "Ravi Hegde"
      ],
      "abstract": "Accurate analysis of combat sports using computer vision has gained traction in recent years, yet the development of robust datasets remains a major bottleneck due to the dynamic, unstructured nature of actions and variations in recording environments. In this work, we present a comprehensive, well-annotated video dataset tailored for punch detection and classification in boxing. The dataset comprises 6,915 high-quality punch clips categorized into six distinct punch types, extracted from 20 publicly available YouTube sparring sessions and involving 18 different athletes. Each clip is manually segmented and labeled to ensure precise temporal boundaries and class consistency, capturing a wide range of motion styles, camera angles, and athlete physiques. This dataset is specifically curated to support research in real-time vision-based action recognition, especially in low-resource and unconstrained environments. By providing a rich benchmark with diverse punch examples, this contribution aims to accelerate progress in movement analysis, automated coaching, and performance assessment within boxing and related domains.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16524v1",
        "pdf": "https://arxiv.org/pdf/2511.16524v1"
      },
      "arxiv_id": "2511.16524v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16523v1",
      "title": "Dynamic Participation in Federated Learning: Benchmarks and a Knowledge Pool Plugin",
      "authors": [
        "Ming-Lun Lee",
        "Fu-Shiang Yang",
        "Cheng-Kuan Lin",
        "Yan-Ann Chen",
        "Chih-Yu Lin",
        "Yu-Chee Tseng"
      ],
      "abstract": "Federated learning (FL) enables clients to collaboratively train a shared model in a distributed manner, setting it apart from traditional deep learning paradigms. However, most existing FL research assumes consistent client participation, overlooking the practical scenario of dynamic participation (DPFL), where clients may intermittently join or leave during training. Moreover, no existing benchmarking framework systematically supports the study of DPFL-specific challenges. In this work, we present the first open-source framework explicitly designed for benchmarking FL models under dynamic client participation. Our framework provides configurable data distributions, participation patterns, and evaluation metrics tailored to DPFL scenarios. Using this platform, we benchmark four major categories of widely adopted FL models and uncover substantial performance degradation under dynamic participation. To address these challenges, we further propose Knowledge-Pool Federated Learning (KPFL), a generic plugin that maintains a shared knowledge pool across both active and idle clients. KPFL leverages dual-age and data-bias weighting, combined with generative knowledge distillation, to mitigate instability and prevent knowledge loss. Extensive experiments demonstrate the significant impact of dynamic participation on FL performance and the effectiveness of KPFL in improving model robustness and generalization.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16523v1",
        "pdf": "https://arxiv.org/pdf/2511.16523v1"
      },
      "arxiv_id": "2511.16523v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16521v1",
      "title": "YOWO: You Only Walk Once to Jointly Map An Indoor Scene and Register Ceiling-mounted Cameras",
      "authors": [
        "Fan Yang",
        "Sosuke Yamao",
        "Ikuo Kusajima",
        "Atsunori Moteki",
        "Shoichi Masui",
        "Shan Jiang"
      ],
      "abstract": "Using ceiling-mounted cameras (CMCs) for indoor visual capturing opens up a wide range of applications. However, registering CMCs to the target scene layout presents a challenging task. While manual registration with specialized tools is inefficient and costly, automatic registration with visual localization may yield poor results when visual ambiguity exists. To alleviate these issues, we propose a novel solution for jointly mapping an indoor scene and registering CMCs to the scene layout. Our approach involves equipping a mobile agent with a head-mounted RGB-D camera to traverse the entire scene once and synchronize CMCs to capture this mobile agent. The egocentric videos generate world-coordinate agent trajectories and the scene layout, while the videos of CMCs provide pseudo-scale agent trajectories and CMC relative poses. By correlating all the trajectories with their corresponding timestamps, the CMC relative poses can be aligned to the world-coordinate scene layout. Based on this initialization, a factor graph is customized to enable the joint optimization of ego-camera poses, scene layout, and CMC poses. We also develop a new dataset, setting the first benchmark for collaborative scene mapping and CMC registration (https://sites.google.com/view/yowo/home). Experimental results indicate that our method not only effectively accomplishes two tasks within a unified framework, but also jointly enhances their performance. We thus provide a reliable tool to facilitate downstream position-aware applications.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16521v1",
        "pdf": "https://arxiv.org/pdf/2511.16521v1"
      },
      "arxiv_id": "2511.16521v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16520v1",
      "title": "Saving Foundation Flow-Matching Priors for Inverse Problems",
      "authors": [
        "Yuxiang Wan",
        "Ryan Devera",
        "Wenjie Zhang",
        "Ju Sun"
      ],
      "abstract": "Foundation flow-matching (FM) models promise a universal prior for solving inverse problems (IPs), yet today they trail behind domain-specific or even untrained priors. How can we unlock their potential? We introduce FMPlug, a plug-in framework that redefines how foundation FMs are used in IPs. FMPlug combines an instance-guided, time-dependent warm-start strategy with a sharp Gaussianity regularization, adding problem-specific guidance while preserving the Gaussian structures. This leads to a significant performance boost across image restoration and scientific IPs. Our results point to a path for making foundation FM models practical, reusable priors for IP solving.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "eess.IV"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16520v1",
        "pdf": "https://arxiv.org/pdf/2511.16520v1"
      },
      "arxiv_id": "2511.16520v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16518v1",
      "title": "MiMo-Embodied: X-Embodied Foundation Model Technical Report",
      "authors": [
        "Xiaoshuai Hao",
        "Lei Zhou",
        "Zhijian Huang",
        "Zhiwen Hou",
        "Yingbo Tang",
        "Lingfeng Zhang",
        "Guang Li",
        "Zheng Lu",
        "Shuhuai Ren",
        "Xianhui Meng",
        "Yuchen Zhang",
        "Jing Wu",
        "Jinghui Lu",
        "Chenxu Dang",
        "Jiayi Guan",
        "Jianhua Wu",
        "Zhiyi Hou",
        "Hanbing Li",
        "Shumeng Xia",
        "Mingliang Zhou",
        "Yinan Zheng",
        "Zihao Yue",
        "Shuhao Gu",
        "Hao Tian",
        "Yuannan Shen",
        "Jianwei Cui",
        "Wen Zhang",
        "Shaoqing Xu",
        "Bing Wang",
        "Haiyang Sun",
        "Zeyu Zhu",
        "Yuncheng Jiang",
        "Zibin Guo",
        "Chuhong Gong",
        "Chaofan Zhang",
        "Wenbo Ding",
        "Kun Ma",
        "Guang Chen",
        "Rui Cai",
        "Diyun Xiang",
        "Heng Qu",
        "Fuli Luo",
        "Hangjun Ye",
        "Long Chen"
      ],
      "abstract": "We open-source MiMo-Embodied, the first cross-embodied foundation model to successfully integrate and achieve state-of-the-art performance in both Autonomous Driving and Embodied AI. MiMo-Embodied sets new records across 17 embodied AI benchmarks in Task Planning, Affordance Prediction and Spatial Understanding, while also excelling in 12 autonomous driving benchmarks across Environmental Perception, Status Prediction, and Driving Planning. Across these tasks, MiMo-Embodied significantly outperforms existing open-source, closed-source, and specialized baselines. Our results indicate that through multi-stage learning, curated data construction, and CoT/RL fine-tuning, these two domains exhibit strong positive transfer and mutually reinforce one another. We provide a detailed analysis of our model design and training methodologies to facilitate further research. Code and models are available at https://github.com/XiaomiMiMo/MiMo-Embodied.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.RO",
        "cs.CL",
        "cs.CV"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16518v1",
        "pdf": "https://arxiv.org/pdf/2511.16518v1"
      },
      "arxiv_id": "2511.16518v1",
      "comment": "Code: https://github.com/XiaomiMiMo/MiMo-Embodied Model: https://huggingface.co/XiaomiMiMo/MiMo-Embodied-7B",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16512v1",
      "title": "Loss Functions Robust to the Presence of Label Errors",
      "authors": [
        "Nicholas Pellegrino",
        "David Szczecina",
        "Paul Fieguth"
      ],
      "abstract": "Methods for detecting label errors in training data require models that are robust to label errors (i.e., not fit to erroneously labelled data points). However, acquiring such models often involves training on corrupted data, which presents a challenge. Adjustments to the loss function present an opportunity for improvement. Motivated by Focal Loss (which emphasizes difficult-to-classify samples), two novel, yet simple, loss functions are proposed that de-weight or ignore these difficult samples (i.e., those likely to have label errors). Results on artificially corrupted data show promise, such that F1 scores for detecting errors are improved from the baselines of conventional categorical Cross Entropy and Focal Loss.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16512v1",
        "pdf": "https://arxiv.org/pdf/2511.16512v1"
      },
      "arxiv_id": "2511.16512v1",
      "comment": "6 pages, 6 figures, Presented at the 10th Annual Conference on Vision and Intelligent Systems (2024)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16501v1",
      "title": "ODE-ViT: Plug & Play Attention Layer from the Generalization of the ViT as an Ordinary Differential Equation",
      "authors": [
        "Carlos Boned Riera",
        "David Romero Sanchez",
        "Oriol Ramos Terrades"
      ],
      "abstract": "In recent years, increasingly large models have achieved outstanding performance across CV tasks. However, these models demand substantial computational resources and storage, and their growing complexity limits our understanding of how they make decisions. Most of these architectures rely on the attention mechanism within Transformer-based designs. Building upon the connection between residual neural networks and ordinary differential equations (ODEs), we introduce ODE-ViT, a Vision Transformer reformulated as an ODE system that satisfies the conditions for well-posed and stable dynamics. Experiments on CIFAR-10 and CIFAR-100 demonstrate that ODE-ViT achieves stable, interpretable, and competitive performance with up to one order of magnitude fewer parameters, surpassing prior ODE-based Transformer approaches in classification tasks. We further propose a plug-and-play teacher-student framework in which a discrete ViT guides the continuous trajectory of ODE-ViT by treating the intermediate representations of the teacher as solutions of the ODE. This strategy improves performance by more than 10% compared to training a free ODE-ViT from scratch.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16501v1",
        "pdf": "https://arxiv.org/pdf/2511.16501v1"
      },
      "arxiv_id": "2511.16501v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16498v1",
      "title": "Acquisition Time-Informed Breast Tumor Segmentation from Dynamic Contrast-Enhanced MRI",
      "authors": [
        "Rui Wang",
        "Yuexi Du",
        "John Lewin",
        "R. Todd Constable",
        "Nicha C. Dvornek"
      ],
      "abstract": "Dynamic contrast-enhanced magnetic resonance imaging (DCE-MRI) plays an important role in breast cancer screening, tumor assessment, and treatment planning and monitoring. The dynamic changes in contrast in different tissues help to highlight the tumor in post-contrast images. However, varying acquisition protocols and individual factors result in large variation in the appearance of tissues, even for images acquired in the same phase (e.g., first post-contrast phase), making automated tumor segmentation challenging. Here, we propose a tumor segmentation method that leverages knowledge of the image acquisition time to modulate model features according to the specific acquisition sequence. We incorporate the acquisition times using feature-wise linear modulation (FiLM) layers, a lightweight method for incorporating temporal information that also allows for capitalizing on the full, variables number of images acquired per imaging study. We trained baseline and different configurations for the time-modulated models with varying backbone architectures on a large public multisite breast DCE-MRI dataset. Evaluation on in-domain images and a public out-of-domain dataset showed that incorporating knowledge of phase acquisition time improved tumor segmentation performance and model generalization.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16498v1",
        "pdf": "https://arxiv.org/pdf/2511.16498v1"
      },
      "arxiv_id": "2511.16498v1",
      "comment": "5 pages, 3 figures",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16494v1",
      "title": "Physics-Informed Machine Learning for Efficient Sim-to-Real Data Augmentation in Micro-Object Pose Estimation",
      "authors": [
        "Zongcai Tan",
        "Lan Wei",
        "Dandan Zhang"
      ],
      "abstract": "Precise pose estimation of optical microrobots is essential for enabling high-precision object tracking and autonomous biological studies. However, current methods rely heavily on large, high-quality microscope image datasets, which are difficult and costly to acquire due to the complexity of microrobot fabrication and the labour-intensive labelling. Digital twin systems offer a promising path for sim-to-real data augmentation, yet existing techniques struggle to replicate complex optical microscopy phenomena, such as diffraction artifacts and depth-dependent imaging.This work proposes a novel physics-informed deep generative learning framework that, for the first time, integrates wave optics-based physical rendering and depth alignment into a generative adversarial network (GAN), to synthesise high-fidelity microscope images for microrobot pose estimation efficiently. Our method improves the structural similarity index (SSIM) by 35.6% compared to purely AI-driven methods, while maintaining real-time rendering speeds (0.022 s/frame).The pose estimator (CNN backbone) trained on our synthetic data achieves 93.9%/91.9% (pitch/roll) accuracy, just 5.0%/5.4% (pitch/roll) below that of an estimator trained exclusively on real data. Furthermore, our framework generalises to unseen poses, enabling data augmentation and robust pose estimation for novel microrobot configurations without additional training data.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16494v1",
        "pdf": "https://arxiv.org/pdf/2511.16494v1"
      },
      "arxiv_id": "2511.16494v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16485v1",
      "title": "LLM4EO: Large Language Model for Evolutionary Optimization in Flexible Job Shop Scheduling",
      "authors": [
        "Rongjie Liao",
        "Junhao Qiu",
        "Xin Chen",
        "Xiaoping Li"
      ],
      "abstract": "Customized static operator design has enabled widespread application of Evolutionary Algorithms (EAs), but their search performance is transient during iterations and prone to degradation. Dynamic operators aim to address this but typically rely on predefined designs and localized parameter control during the search process, lacking adaptive optimization throughout evolution. To overcome these limitations, this work leverages Large Language Models (LLMs) to perceive evolutionary dynamics and enable operator-level meta-evolution. The proposed framework, LLMs for Evolutionary Optimization (LLM4EO), comprises three components: knowledge-transfer-based operator design, evolution perception and analysis, and adaptive operator evolution. Firstly, initialization of operators is performed by transferring the strengths of classical operators via LLMs. Then, search preferences and potential limitations of operators are analyzed by integrating fitness performance and evolutionary features, accompanied by corresponding suggestions for improvement. Upon stagnation of population evolution, gene selection priorities of operators are dynamically optimized via improvement prompting strategies. This approach achieves co-evolution of populations and operators in the search, introducing a novel paradigm for enhancing the efficiency and adaptability of EAs. Finally, a series of validations on multiple benchmark datasets of the flexible job shop scheduling problem demonstrate that LLM4EO accelerates population evolution and outperforms both mainstream evolutionary programming and traditional EAs.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.NE",
        "cs.AI"
      ],
      "primary_category": "cs.NE",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16485v1",
        "pdf": "https://arxiv.org/pdf/2511.16485v1"
      },
      "arxiv_id": "2511.16485v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16484v1",
      "title": "Flow and Depth Assisted Video Prediction with Latent Transformer",
      "authors": [
        "Eliyas Suleyman",
        "Paul Henderson",
        "Eksan Firkat",
        "Nicolas Pugeault"
      ],
      "abstract": "Video prediction is a fundamental task for various downstream applications, including robotics and world modeling. Although general video prediction models have achieved remarkable performance in standard scenarios, occlusion is still an inherent challenge in video prediction. We hypothesize that providing explicit information about motion (via point-flow) and geometric structure (via depth-maps) will enable video prediction models to perform better in situations with occlusion and the background motion. To investigate this, we present the first systematic study dedicated to occluded video prediction. We use a standard multi-object latent transformer architecture to predict future frames, but modify this to incorporate information from depth and point-flow. We evaluate this model in a controlled setting on both synthetic and real-world datasets with not only appearance-based metrics but also Wasserstein distances on object masks, which can effectively measure the motion distribution of the prediction. We find that when the prediction model is assisted with point flow and depth, it performs better in occluded scenarios and predicts more accurate background motion compared to models without the help of these modalities.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16484v1",
        "pdf": "https://arxiv.org/pdf/2511.16484v1"
      },
      "arxiv_id": "2511.16484v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16483v1",
      "title": "Large Language Model-Based Reward Design for Deep Reinforcement Learning-Driven Autonomous Cyber Defense",
      "authors": [
        "Sayak Mukherjee",
        "Samrat Chatterjee",
        "Emilie Purvine",
        "Ted Fujimoto",
        "Tegan Emerson"
      ],
      "abstract": "Designing rewards for autonomous cyber attack and defense learning agents in a complex, dynamic environment is a challenging task for subject matter experts. We propose a large language model (LLM)-based reward design approach to generate autonomous cyber defense policies in a deep reinforcement learning (DRL)-driven experimental simulation environment. Multiple attack and defense agent personas were crafted, reflecting heterogeneity in agent actions, to generate LLM-guided reward designs where the LLM was first provided with contextual cyber simulation environment information. These reward structures were then utilized within a DRL-driven attack-defense simulation environment to learn an ensemble of cyber defense policies. Our results suggest that LLM-guided reward designs can lead to effective defense strategies against diverse adversarial behaviors.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.MA"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16483v1",
        "pdf": "https://arxiv.org/pdf/2511.16483v1"
      },
      "arxiv_id": "2511.16483v1",
      "comment": "Accepted in the AAAI-26 Workshop on Artificial Intelligence for Cyber Security (AICS)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16482v1",
      "title": "Correlation-Aware Feature Attribution Based Explainable AI",
      "authors": [
        "Poushali Sengupta",
        "Yan Zhang",
        "Frank Eliassen",
        "Sabita Maharjan"
      ],
      "abstract": "Explainable AI (XAI) is increasingly essential as modern models become more complex and high-stakes applications demand transparency, trust, and regulatory compliance. Existing global attribution methods often incur high computational costs, lack stability under correlated inputs, and fail to scale efficiently to large or heterogeneous datasets. We address these gaps with \\emph{ExCIR} (Explainability through Correlation Impact Ratio), a correlation-aware attribution score equipped with a lightweight transfer protocol that reproduces full-model rankings using only a fraction of the data. ExCIR quantifies sign-aligned co-movement between features and model outputs after \\emph{robust centering} (subtracting a robust location estimate, e.g., median or mid-mean, from features and outputs). We further introduce \\textsc{BlockCIR}, a \\emph{groupwise} extension of ExCIR that scores \\emph{sets} of correlated features as a single unit. By aggregating the same signed-co-movement numerators and magnitudes over predefined or data-driven groups, \\textsc{BlockCIR} mitigates double-counting in collinear clusters (e.g., synonyms or duplicated sensors) and yields smoother, more stable rankings when strong dependencies are present. Across diverse text, tabular, signal, and image datasets, ExCIR shows trustworthy agreement with established global baselines and the full model, delivers consistent top-$k$ rankings across settings, and reduces runtime via lightweight evaluation on a subset of rows. Overall, ExCIR provides \\emph{computationally efficient}, \\emph{consistent}, and \\emph{scalable} explainability for real-world deployment.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI",
        "stat.ML"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16482v1",
        "pdf": "https://arxiv.org/pdf/2511.16482v1"
      },
      "arxiv_id": "2511.16482v1",
      "comment": "Accepted, 2026 International Conference on Advances in Artificial Intelligence and Machine Learning (AAIML 2026)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16476v1",
      "title": "Limitations of Scalarisation in MORL: A Comparative Study in Discrete Environments",
      "authors": [
        "Muhammad Sa'ood Shah",
        "Asad Jeewa"
      ],
      "abstract": "Scalarisation functions are widely employed in MORL algorithms to enable intelligent decision-making. However, these functions often struggle to approximate the Pareto front accurately, rendering them unideal in complex, uncertain environments. This study examines selected Multi-Objective Reinforcement Learning (MORL) algorithms across MORL environments with discrete action and observation spaces. We aim to investigate further the limitations associated with scalarisation approaches for decision-making in multi-objective settings. Specifically, we use an outer-loop multi-policy methodology to assess the performance of a seminal single-policy MORL algorithm, MO Q-Learning implemented with linear scalarisation and Chebyshev scalarisation functions. In addition, we explore a pioneering inner-loop multi-policy algorithm, Pareto Q-Learning, which offers a more robust alternative. Our findings reveal that the performance of the scalarisation functions is highly dependent on the environment and the shape of the Pareto front. These functions often fail to retain the solutions uncovered during learning and favour finding solutions in certain regions of the solution space. Moreover, finding the appropriate weight configurations to sample the entire Pareto front is complex, limiting their applicability in uncertain settings. In contrast, inner-loop multi-policy algorithms may provide a more sustainable and generalizable approach and potentially facilitate intelligent decision-making in dynamic and uncertain environments.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16476v1",
        "pdf": "https://arxiv.org/pdf/2511.16476v1"
      },
      "arxiv_id": "2511.16476v1",
      "comment": "15 pages, 4 figures, published in the Proceedings of the 46th Annual Conference of the South African Institute of Computer Scientists and Information Technologists (SAICSIT 2025)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16475v1",
      "title": "A Comparison Between Decision Transformers and Traditional Offline Reinforcement Learning Algorithms",
      "authors": [
        "Ali Murtaza Caunhye",
        "Asad Jeewa"
      ],
      "abstract": "The field of Offline Reinforcement Learning (RL) aims to derive effective policies from pre-collected datasets without active environment interaction. While traditional offline RL algorithms like Conservative Q-Learning (CQL) and Implicit Q-Learning (IQL) have shown promise, they often face challenges in balancing exploration and exploitation, especially in environments with varying reward densities. The recently proposed Decision Transformer (DT) approach, which reframes offline RL as a sequence modelling problem, has demonstrated impressive results across various benchmarks. This paper presents a comparative study evaluating the performance of DT against traditional offline RL algorithms in dense and sparse reward settings for the ANT continous control environment. Our research investigates how these algorithms perform when faced with different reward structures, examining their ability to learn effective policies and generalize across varying levels of feedback. Through empirical analysis in the ANT environment, we found that DTs showed less sensitivity to varying reward density compared to other methods and particularly excelled with medium-expert datasets in sparse reward scenarios. In contrast, traditional value-based methods like IQL showed improved performance in dense reward settings with high-quality data, while CQL offered balanced performance across different data qualities. Additionally, DTs exhibited lower variance in performance but required significantly more computational resources compared to traditional approaches. These findings suggest that sequence modelling approaches may be more suitable for scenarios with uncertain reward structures or mixed-quality data, while value-based methods remain competitive in settings with dense rewards and high-quality demonstrations.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16475v1",
        "pdf": "https://arxiv.org/pdf/2511.16475v1"
      },
      "arxiv_id": "2511.16475v1",
      "comment": "15 pages, 4 figures, published in the Proceedings of the 46th Annual conference of the South African Institute of Computer Scientists and Information Technologists (SIACSIT 2025)",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16471v1",
      "title": "FastSurfer-CC: A robust, accurate, and comprehensive framework for corpus callosum morphometry",
      "authors": [
        "Clemens Pollak",
        "Kersten Diers",
        "Santiago Estrada",
        "David Kügler",
        "Martin Reuter"
      ],
      "abstract": "The corpus callosum, the largest commissural structure in the human brain, is a central focus in research on aging and neurological diseases. It is also a critical target for interventions such as deep brain stimulation and serves as an important biomarker in clinical trials, including those investigating remyelination therapies. Despite extensive research on corpus callosum segmentation, few publicly available tools provide a comprehensive and automated analysis pipeline. To address this gap, we present FastSurfer-CC, an efficient and fully automated framework for corpus callosum morphometry. FastSurfer-CC automatically identifies mid-sagittal slices, segments the corpus callosum and fornix, localizes the anterior and posterior commissures to standardize head positioning, generates thickness profiles and subdivisions, and extracts eight shape metrics for statistical analysis. We demonstrate that FastSurfer-CC outperforms existing specialized tools across the individual tasks. Moreover, our method reveals statistically significant differences between Huntington's disease patients and healthy controls that are not detected by the current state-of-the-art.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16471v1",
        "pdf": "https://arxiv.org/pdf/2511.16471v1"
      },
      "arxiv_id": "2511.16471v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16470v1",
      "title": "Arctic-Extract Technical Report",
      "authors": [
        "Mateusz Chiliński",
        "Julita Ołtusek",
        "Wojciech Jaśkowski"
      ],
      "abstract": "Arctic-Extract is a state-of-the-art model designed for extracting structural data (question answering, entities and tables) from scanned or digital-born business documents. Despite its SoTA capabilities, the model is deployable on resource-constrained hardware, weighting only 6.6 GiB, making it suitable for deployment on devices with limited resources, such as A10 GPUs with 24 GB of memory. Arctic-Extract can process up to 125 A4 pages on those GPUs, making suitable for long document processing. This paper highlights Arctic-Extract's training protocols and evaluation results, demonstrating its strong performance in document understanding.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CL",
        "cs.CV"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16470v1",
        "pdf": "https://arxiv.org/pdf/2511.16470v1"
      },
      "arxiv_id": "2511.16470v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16468v1",
      "title": "Optimizing Quantum Key Distribution Network Performance using Graph Neural Networks",
      "authors": [
        "Akshit Pramod Anchan",
        "Ameiy Acharya",
        "Leki Chom Thungon"
      ],
      "abstract": "This paper proposes an optimization of Quantum Key Distribution (QKD) Networks using Graph Neural Networks (GNN) framework. Today, the development of quantum computers threatens the security systems of classical cryptography. Moreover, as QKD networks are designed for protecting secret communication, they suffer from multiple operational difficulties: adaptive to dynamic conditions, optimization for multiple parameters and effective resource utilization. In order to overcome these obstacles, we propose a GNN-based framework which can model QKD networks as dynamic graphs and extracts exploitable characteristics from these networks' structure. The graph contains not only topological information but also specific characteristics associated with quantum communication (the number of edges between nodes, etc). Experimental results demonstrate that the GNN-optimized QKD network achieves a substantial increase in total key rate (from 27.1 Kbits/s to 470 Kbits/s), a reduced average QBER (from 6.6% to 6.0%), and maintains path integrity with a slight reduction in average transmission distance (from 7.13 km to 6.42 km). Furthermore, we analyze network performance across varying scales (10 to 250 nodes), showing improved link prediction accuracy and enhanced key generation rate in medium-sized networks. This work introduces a novel operation mode for QKD networks, shifting the paradigm of network optimization through adaptive and scalable quantum communication systems that enhance security and performance.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "quant-ph",
        "cs.CR",
        "cs.LG",
        "cs.NI"
      ],
      "primary_category": "quant-ph",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16468v1",
        "pdf": "https://arxiv.org/pdf/2511.16468v1"
      },
      "arxiv_id": "2511.16468v1",
      "comment": "11 pages, 4 figures, and 2 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16467v1",
      "title": "Anatomy of an Idiom: Tracing Non-Compositionality in Language Models",
      "authors": [
        "Andrew Gomes"
      ],
      "abstract": "We investigate the processing of idiomatic expressions in transformer-based language models using a novel set of techniques for circuit discovery and analysis. First discovering circuits via a modified path patching algorithm, we find that idiom processing exhibits distinct computational patterns. We identify and investigate ``Idiom Heads,'' attention heads that frequently activate across different idioms, as well as enhanced attention between idiom tokens due to earlier processing, which we term ``augmented reception.'' We analyze these phenomena and the general features of the discovered circuits as mechanisms by which transformers balance computational efficiency and robustness. Finally, these findings provide insights into how transformers handle non-compositional language and suggest pathways for understanding the processing of more complex grammatical constructions.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16467v1",
        "pdf": "https://arxiv.org/pdf/2511.16467v1"
      },
      "arxiv_id": "2511.16467v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16454v1",
      "title": "LLaVA$^3$: Representing 3D Scenes like a Cubist Painter to Boost 3D Scene Understanding of VLMs",
      "authors": [
        "Doriand Petit",
        "Steve Bourgeois",
        "Vincent Gay-Bellile",
        "Florian Chabot",
        "Loïc Barthe"
      ],
      "abstract": "Developing a multi-modal language model capable of understanding 3D scenes remains challenging due to the limited availability of 3D training data, in contrast to the abundance of 2D datasets used for vision-language models (VLM). As an alternative, we introduce LLaVA$^3$ (pronounced LLaVA-Cube), a novel method that improves the 3D scene understanding capabilities of VLM using only multi-view 2D images and without any fine-tuning. Inspired by Cubist painters, who represented multiple viewpoints of a 3D object within a single picture, we propose to describe the 3D scene for the VLM through omnidirectional visual representations of each object. These representations are derived from an intermediate multi-view 3D reconstruction of the scene. Extensive experiments on 3D VQA and 3D language grounding show that our approach outperforms previous 2D-based VLM solutions.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16454v1",
        "pdf": "https://arxiv.org/pdf/2511.16454v1"
      },
      "arxiv_id": "2511.16454v1",
      "comment": "Accepted at AAAI'26",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16449v1",
      "title": "VLA-Pruner: Temporal-Aware Dual-Level Visual Token Pruning for Efficient Vision-Language-Action Inference",
      "authors": [
        "Ziyan Liu",
        "Yeqiu Chen",
        "Hongyi Cai",
        "Tao Lin",
        "Shuo Yang",
        "Zheng Liu",
        "Bo Zhao"
      ],
      "abstract": "Vision-Language-Action (VLA) models have shown great promise for embodied AI, yet the heavy computational cost of processing continuous visual streams severely limits their real-time deployment. Token pruning (keeping salient visual tokens and dropping redundant ones) has emerged as an effective approach for accelerating Vision-Language Models (VLMs), offering a solution for efficient VLA. However, these VLM-specific token pruning methods select tokens based solely on semantic salience metrics (e.g., prefill attention), while overlooking the VLA's intrinsic dual-system nature of high-level semantic understanding and low-level action execution. Consequently, these methods bias token retention toward semantic cues, discard critical information for action generation, and significantly degrade VLA performance. To bridge this gap, we propose VLA-Pruner, a versatile plug-and-play VLA-specific token prune method that aligns with the dual-system nature of VLA models and exploits the temporal continuity in robot manipulation. Specifically, VLA-Pruner adopts a dual-level importance criterion for visual token retention: vision-language prefill attention for semantic-level relevance and action decode attention, estimated via temporal smoothing, for action-level importance. Based on this criterion, VLA-Pruner proposes a novel dual-level token selection strategy that adaptively preserves a compact, informative set of visual tokens for both semantic understanding and action execution under given compute budget. Experiments show that VLA-Pruner achieves state-of-the-art performance across multiple VLA architectures and diverse robotic tasks.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16449v1",
        "pdf": "https://arxiv.org/pdf/2511.16449v1"
      },
      "arxiv_id": "2511.16449v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16445v1",
      "title": "PersonaDrift: A Benchmark for Temporal Anomaly Detection in Language-Based Dementia Monitoring",
      "authors": [
        "Joy Lai",
        "Alex Mihailidis"
      ],
      "abstract": "People living with dementia (PLwD) often show gradual shifts in how they communicate, becoming less expressive, more repetitive, or drifting off-topic in subtle ways. While caregivers may notice these changes informally, most computational tools are not designed to track such behavioral drift over time. This paper introduces PersonaDrift, a synthetic benchmark designed to evaluate machine learning and statistical methods for detecting progressive changes in daily communication, focusing on user responses to a digital reminder system. PersonaDrift simulates 60-day interaction logs for synthetic users modeled after real PLwD, based on interviews with caregivers. These caregiver-informed personas vary in tone, modality, and communication habits, enabling realistic diversity in behavior. The benchmark focuses on two forms of longitudinal change that caregivers highlighted as particularly salient: flattened sentiment (reduced emotional tone and verbosity) and off-topic replies (semantic drift). These changes are injected progressively at different rates to emulate naturalistic cognitive trajectories, and the framework is designed to be extensible to additional behaviors in future use cases. To explore this novel application space, we evaluate several anomaly detection approaches, unsupervised statistical methods (CUSUM, EWMA, One-Class SVM), sequence models using contextual embeddings (GRU + BERT), and supervised classifiers in both generalized and personalized settings. Preliminary results show that flattened sentiment can often be detected with simple statistical models in users with low baseline variability, while detecting semantic drift requires temporal modeling and personalized baselines. Across both tasks, personalized classifiers consistently outperform generalized ones, highlighting the importance of individual behavioral context.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI",
        "cs.LG"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16445v1",
        "pdf": "https://arxiv.org/pdf/2511.16445v1"
      },
      "arxiv_id": "2511.16445v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16440v1",
      "title": "StreetView-Waste: A Multi-Task Dataset for Urban Waste Management",
      "authors": [
        "Diogo J. Paulo",
        "João Martins",
        "Hugo Proença",
        "João C. Neves"
      ],
      "abstract": "Urban waste management remains a critical challenge for the development of smart cities. Despite the growing number of litter detection datasets, the problem of monitoring overflowing waste containers, particularly from images captured by garbage trucks, has received little attention. While existing datasets are valuable, they often lack annotations for specific container tracking or are captured in static, decontextualized environments, limiting their utility for real-world logistics. To address this gap, we present StreetView-Waste, a comprehensive dataset of urban scenes featuring litter and waste containers. The dataset supports three key evaluation tasks: (1) waste container detection, (2) waste container tracking, and (3) waste overflow segmentation. Alongside the dataset, we provide baselines for each task by benchmarking state-of-the-art models in object detection, tracking, and segmentation. Additionally, we enhance baseline performance by proposing two complementary strategies: a heuristic-based method for improved waste container tracking and a model-agnostic framework that leverages geometric priors to refine litter segmentation. Our experimental results show that while fine-tuned object detectors achieve reasonable performance in detecting waste containers, baseline tracking methods struggle to accurately estimate their number; however, our proposed heuristics reduce the mean absolute counting error by 79.6%. Similarly, while segmenting amorphous litter is challenging, our geometry-aware strategy improves segmentation mAP@0.5 by 27% on lightweight models, demonstrating the value of multimodal inputs for this task. Ultimately, StreetView-Waste provides a challenging benchmark to encourage research into real-world perception systems for urban waste management.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16440v1",
        "pdf": "https://arxiv.org/pdf/2511.16440v1"
      },
      "arxiv_id": "2511.16440v1",
      "comment": "Accepted at WACV 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16435v1",
      "title": "Beyond Visual Cues: Leveraging General Semantics as Support for Few-Shot Segmentation",
      "authors": [
        "Jin Wang",
        "Bingfeng Zhang",
        "Jian Pang",
        "Mengyu Liu",
        "Honglong Chen",
        "Weifeng Liu"
      ],
      "abstract": "Few-shot segmentation (FSS) aims to segment novel classes under the guidance of limited support samples by a meta-learning paradigm. Existing methods mainly mine references from support images as meta guidance. However, due to intra-class variations among visual representations, the meta information extracted from support images cannot produce accurate guidance to segment untrained classes. In this paper, we argue that the references from support images may not be essential, the key to the support role is to provide unbiased meta guidance for both trained and untrained classes. We then introduce a Language-Driven Attribute Generalization (LDAG) architecture to utilize inherent target property language descriptions to build robust support strategy. Specifically, to obtain an unbiased support representation, we design a Multi-attribute Enhancement (MaE) module, which produces multiple detailed attribute descriptions of the target class through Large Language Models (LLMs), and then builds refined visual-text prior guidance utilizing multi-modal matching. Meanwhile, due to text-vision modal shift, attribute text struggles to promote visual feature representation, we design a Multi-modal Attribute Alignment (MaA) to achieve cross-modal interaction between attribute texts and visual feature. Experiments show that our proposed method outperforms existing approaches by a clear margin and achieves the new state-of-the art performance. The code will be released.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16435v1",
        "pdf": "https://arxiv.org/pdf/2511.16435v1"
      },
      "arxiv_id": "2511.16435v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16432v1",
      "title": "From generative AI to the brain: five takeaways",
      "authors": [
        "Claudius Gros"
      ],
      "abstract": "The big strides seen in generative AI are not based on somewhat obscure algorithms, but due to clearly defined generative principles. The resulting concrete implementations have proven themselves in large numbers of applications. We suggest that it is imperative to thoroughly investigate which of these generative principles may be operative also in the brain, and hence relevant for cognitive neuroscience. In addition, ML research led to a range of interesting characterizations of neural information processing systems. We discuss five examples, the shortcomings of world modelling, the generation of thought processes, attention, neural scaling laws, and quantization, that illustrate how much neuroscience could potentially learn from ML research.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI",
        "q-bio.NC"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16432v1",
        "pdf": "https://arxiv.org/pdf/2511.16432v1"
      },
      "arxiv_id": "2511.16432v1",
      "comment": "Frontiers in Computational Neuroscience, in press",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16430v1",
      "title": "Graph Neural Networks for Surgical Scene Segmentation",
      "authors": [
        "Yihan Li",
        "Nikhil Churamani",
        "Maria Robu",
        "Imanol Luengo",
        "Danail Stoyanov"
      ],
      "abstract": "Purpose: Accurate identification of hepatocystic anatomy is critical to preventing surgical complications during laparoscopic cholecystectomy. Deep learning models often struggle with occlusions, long-range dependencies, and capturing the fine-scale geometry of rare structures. This work addresses these challenges by introducing graph-based segmentation approaches that enhance spatial and semantic understanding in surgical scene analyses.\n  Methods: We propose two segmentation models integrating Vision Transformer (ViT) feature encoders with Graph Neural Networks (GNNs) to explicitly model spatial relationships between anatomical regions. (1) A static k Nearest Neighbours (k-NN) graph with a Graph Convolutional Network with Initial Residual and Identity Mapping (GCNII) enables stable long-range information propagation. (2) A dynamic Differentiable Graph Generator (DGG) with a Graph Attention Network (GAT) supports adaptive topology learning. Both models are evaluated on the Endoscapes-Seg50 and CholecSeg8k benchmarks.\n  Results: The proposed approaches achieve up to 7-8% improvement in Mean Intersection over Union (mIoU) and 6% improvement in Mean Dice (mDice) scores over state-of-the-art baselines. It produces anatomically coherent predictions, particularly on thin, rare and safety-critical structures.\n  Conclusion: The proposed graph-based segmentation methods enhance both performance and anatomical consistency in surgical scene segmentation. By combining ViT-based global context with graph-based relational reasoning, the models improve interpretability and reliability, paving the way for safer laparoscopic and robot-assisted surgery through a precise identification of critical anatomical features.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.LG"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16430v1",
        "pdf": "https://arxiv.org/pdf/2511.16430v1"
      },
      "arxiv_id": "2511.16430v1",
      "comment": "12 pages, 4 figures, 3 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16428v1",
      "title": "CylinderDepth: Cylindrical Spatial Attention for Multi-View Consistent Self-Supervised Surround Depth Estimation",
      "authors": [
        "Samer Abualhanud",
        "Christian Grannemann",
        "Max Mehltretter"
      ],
      "abstract": "Self-supervised surround-view depth estimation enables dense, low-cost 3D perception with a 360° field of view from multiple minimally overlapping images. Yet, most existing methods suffer from depth estimates that are inconsistent between overlapping images. Addressing this limitation, we propose a novel geometry-guided method for calibrated, time-synchronized multi-camera rigs that predicts dense, metric, and cross-view-consistent depth. Given the intrinsic and relative orientation parameters, a first depth map is predicted per image and the so-derived 3D points from all images are projected onto a shared unit cylinder, establishing neighborhood relations across different images. This produces a 2D position map for every image, where each pixel is assigned its projected position on the cylinder. Based on these position maps, we apply an explicit, non-learned spatial attention that aggregates features among pixels across images according to their distances on the cylinder, to predict a final depth map per image. Evaluated on the DDAD and nuScenes datasets, our approach improves the consistency of depth estimates across images and the overall depth compared to state-of-the-art methods.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16428v1",
        "pdf": "https://arxiv.org/pdf/2511.16428v1"
      },
      "arxiv_id": "2511.16428v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16427v1",
      "title": "Generative Modeling of Clinical Time Series via Latent Stochastic Differential Equations",
      "authors": [
        "Muhammad Aslanimoghanloo",
        "Ahmed ElGazzar",
        "Marcel van Gerven"
      ],
      "abstract": "Clinical time series data from electronic health records and medical registries offer unprecedented opportunities to understand patient trajectories and inform medical decision-making. However, leveraging such data presents significant challenges due to irregular sampling, complex latent physiology, and inherent uncertainties in both measurements and disease progression. To address these challenges, we propose a generative modeling framework based on latent neural stochastic differential equations (SDEs) that views clinical time series as discrete-time partial observations of an underlying controlled stochastic dynamical system. Our approach models latent dynamics via neural SDEs with modality-dependent emission models, while performing state estimation and parameter learning through variational inference. This formulation naturally handles irregularly sampled observations, learns complex non-linear interactions, and captures the stochasticity of disease progression and measurement noise within a unified scalable probabilistic framework. We validate the framework on two complementary tasks: (i) individual treatment effect estimation using a simulated pharmacokinetic-pharmacodynamic (PKPD) model of lung cancer, and (ii) probabilistic forecasting of physiological signals using real-world intensive care unit (ICU) data from 12,000 patients. Results show that our framework outperforms ordinary differential equation and long short-term memory baseline models in accuracy and uncertainty estimation. These results highlight its potential for enabling precise, uncertainty-aware predictions to support clinical decision-making.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16427v1",
        "pdf": "https://arxiv.org/pdf/2511.16427v1"
      },
      "arxiv_id": "2511.16427v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16426v1",
      "title": "FreqFlow: Long-term forecasting using lightweight flow matching",
      "authors": [
        "Seyed Mohamad Moghadas",
        "Bruno Cornelis",
        "Adrian Munteanu"
      ],
      "abstract": "Multivariate time-series (MTS) forecasting is fundamental to applications ranging from urban mobility and resource management to climate modeling. While recent generative models based on denoising diffusion have advanced state-of-the-art performance in capturing complex data distributions, they suffer from significant computational overhead due to iterative stochastic sampling procedures that limit real-time deployment. Moreover, these models can be brittle when handling high-dimensional, non-stationary, and multi-scale periodic patterns characteristic of real-world sensor networks. We introduce FreqFlow, a novel framework that leverages conditional flow matching in the frequency domain for deterministic MTS forecasting. Unlike conventional approaches that operate in the time domain, FreqFlow transforms the forecasting problem into the spectral domain, where it learns to model amplitude and phase shifts through a single complex-valued linear layer. This frequency-domain formulation enables the model to efficiently capture temporal dynamics via complex multiplication, corresponding to scaling and temporal translations. The resulting architecture is exceptionally lightweight with only 89k parameters - an order of magnitude smaller than competing diffusion-based models-while enabling single-pass deterministic sampling through ordinary differential equation (ODE) integration. Our approach decomposes MTS signals into trend, seasonal, and residual components, with the flow matching mechanism specifically designed for residual learning to enhance long-term forecasting accuracy. Extensive experiments on real-world traffic speed, volume, and flow datasets demonstrate that FreqFlow achieves state-of-the-art forecasting performance, on average 7\\% RMSE improvements, while being significantly faster and more parameter-efficient than existing methods",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16426v1",
        "pdf": "https://arxiv.org/pdf/2511.16426v1"
      },
      "arxiv_id": "2511.16426v1",
      "comment": "Accepted at EurIPS, 2025",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16423v1",
      "title": "TOFA: Training-Free One-Shot Federated Adaptation for Vision-Language Models",
      "authors": [
        "Li Zhang",
        "Zhongxuan Han",
        "XiaoHua Feng",
        "Jiaming Zhang",
        "Yuyuan Li",
        "Linbo Jiang",
        "Jianan Lin",
        "Chaochao Chen"
      ],
      "abstract": "Efficient and lightweight adaptation of pre-trained Vision-Language Models (VLMs) to downstream tasks through collaborative interactions between local clients and a central server is a rapidly emerging research topic in federated learning. Existing adaptation algorithms are typically trained iteratively, which incur significant communication costs and increase the susceptibility to potential attacks. Motivated by the one-shot federated training techniques that reduce client-server exchanges to a single round, developing a lightweight one-shot federated VLM adaptation method to alleviate these issues is particularly attractive. However, current one-shot approaches face certain challenges in adapting VLMs within federated settings: (1) insufficient exploitation of the rich multimodal information inherent in VLMs; (2) lack of specialized adaptation strategies to systematically handle the severe data heterogeneity; and (3) requiring additional training resource of clients or server. To bridge these gaps, we propose a novel Training-free One-shot Federated Adaptation framework for VLMs, named TOFA. To fully leverage the generalizable multimodal features in pre-trained VLMs, TOFA employs both visual and textual pipelines to extract task-relevant representations. In the visual pipeline, a hierarchical Bayesian model learns personalized, class-specific prototype distributions. For the textual pipeline, TOFA evaluates and globally aligns the generated local text prompts for robustness. An adaptive weight calibration mechanism is also introduced to combine predictions from both modalities, balancing personalization and robustness to handle data heterogeneity. Our method is training-free, not relying on additional training resources on either the client or server side. Extensive experiments across 9 datasets in various federated settings demonstrate the effectiveness of the proposed TOFA method.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI",
        "cs.CL"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16423v1",
        "pdf": "https://arxiv.org/pdf/2511.16423v1"
      },
      "arxiv_id": "2511.16423v1",
      "comment": "Accepted by AAAI 2026",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16418v1",
      "title": "End-to-End Motion Capture from Rigid Body Markers with Geodesic Loss",
      "authors": [
        "Hai Lan",
        "Zongyan Li",
        "Jianmin Hu",
        "Jialing Yang",
        "Houde Dai"
      ],
      "abstract": "Marker-based optical motion capture (MoCap), while long regarded as the gold standard for accuracy, faces practical challenges, such as time-consuming preparation and marker identification ambiguity, due to its reliance on dense marker configurations, which fundamentally limit its scalability. To address this, we introduce a novel fundamental unit for MoCap, the Rigid Body Marker (RBM), which provides unambiguous 6-DoF data and drastically simplifies setup. Leveraging this new data modality, we develop a deep-learning-based regression model that directly estimates SMPL parameters under a geodesic loss. This end-to-end approach matches the performance of optimization-based methods while requiring over an order of magnitude less computation. Trained on synthesized data from the AMASS dataset, our end-to-end model achieves state-of-the-art accuracy in body pose estimation. Real-world data captured using a Vicon optical tracking system further demonstrates the practical viability of our approach. Overall, the results show that combining sparse 6-DoF RBM with a manifold-aware geodesic loss yields a practical and high-fidelity solution for real-time MoCap in graphics, virtual reality, and biomechanics.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CV",
        "cs.HC"
      ],
      "primary_category": "cs.CV",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16418v1",
        "pdf": "https://arxiv.org/pdf/2511.16418v1"
      },
      "arxiv_id": "2511.16418v1",
      "comment": "The source code is available in : https://github.com/wer010/GLRBM-Mocap",
      "journal_ref": "",
      "has_code": true
    },
    {
      "id": "2511.16417v1",
      "title": "Pharos-ESG: A Framework for Multimodal Parsing, Contextual Narration, and Hierarchical Labeling of ESG Report",
      "authors": [
        "Yan Chen",
        "Yu Zou",
        "Jialei Zeng",
        "Haoran You",
        "Xiaorui Zhou",
        "Aixi Zhong"
      ],
      "abstract": "Environmental, Social, and Governance (ESG) principles are reshaping the foundations of global financial gover- nance, transforming capital allocation architectures, regu- latory frameworks, and systemic risk coordination mecha- nisms. However, as the core medium for assessing corpo- rate ESG performance, the ESG reports present significant challenges for large-scale understanding, due to chaotic read- ing order from slide-like irregular layouts and implicit hier- archies arising from lengthy, weakly structured content. To address these challenges, we propose Pharos-ESG, a uni- fied framework that transforms ESG reports into structured representations through multimodal parsing, contextual nar- ration, and hierarchical labeling. It integrates a reading-order modeling module based on layout flow, hierarchy-aware seg- mentation guided by table-of-contents anchors, and a multi- modal aggregation pipeline that contextually transforms vi- sual elements into coherent natural language. The framework further enriches its outputs with ESG, GRI, and sentiment labels, yielding annotations aligned with the analytical de- mands of financial research. Extensive experiments on anno- tated benchmarks demonstrate that Pharos-ESG consistently outperforms both dedicated document parsing systems and general-purpose multimodal models. In addition, we release Aurora-ESG, the first large-scale public dataset of ESG re- ports, spanning Mainland China, Hong Kong, and U.S. mar- kets, featuring unified structured representations of multi- modal content, enriched with fine-grained layout and seman- tic annotations to better support ESG integration in financial governance and decision-making.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16417v1",
        "pdf": "https://arxiv.org/pdf/2511.16417v1"
      },
      "arxiv_id": "2511.16417v1",
      "comment": "Accepted to AAAI 26:main technical track Oral",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16416v1",
      "title": "Classification of worldwide news articles by perceived quality, 2018-2024",
      "authors": [
        "Connor McElroy",
        "Thiago E. A. de Oliveira",
        "Chris Brogly"
      ],
      "abstract": "This study explored whether supervised machine learning and deep learning models can effectively distinguish perceived lower-quality news articles from perceived higher-quality news articles. 3 machine learning classifiers and 3 deep learning models were assessed using a newly created dataset of 1,412,272 English news articles from the Common Crawl over 2018-2024. Expert consensus ratings on 579 source websites were split at the median, creating perceived low and high-quality classes of about 706,000 articles each, with 194 linguistic features per website-level labelled article. Traditional machine learning classifiers such as the Random Forest demonstrated capable performance (0.7355 accuracy, 0.8131 ROC AUC). For deep learning, ModernBERT-large (256 context length) achieved the best performance (0.8744 accuracy; 0.9593 ROC-AUC; 0.8739 F1), followed by DistilBERT-base (512 context length) at 0.8685 accuracy and 0.9554 ROC-AUC. DistilBERT-base (256 context length) reached 0.8478 accuracy and 0.9407 ROC-AUC, while ModernBERT-base (256 context length) attained 0.8569 accuracy and 0.9470 ROC-AUC. These results suggest that the perceived quality of worldwide news articles can be effectively differentiated by traditional CPU-based machine learning classifiers and deep learning classifiers.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.CL",
        "cs.LG"
      ],
      "primary_category": "cs.CL",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16416v1",
        "pdf": "https://arxiv.org/pdf/2511.16416v1"
      },
      "arxiv_id": "2511.16416v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16402v1",
      "title": "Trustworthy AI in the Agentic Lakehouse: from Concurrency to Governance",
      "authors": [
        "Jacopo Tagliabue",
        "Federico Bianchi",
        "Ciro Greco"
      ],
      "abstract": "Even as AI capabilities improve, most enterprises do not consider agents trustworthy enough to work on production data. In this paper, we argue that the path to trustworthy agentic workflows begins with solving the infrastructure problem first: traditional lakehouses are not suited for agent access patterns, but if we design one around transactions, governance follows. In particular, we draw an operational analogy to MVCC in databases and show why a direct transplant fails in a decoupled, multi-language setting. We then propose an agent-first design, Bauplan, that reimplements data and compute isolation in the lakehouse. We conclude by sharing a reference implementation of a self-healing pipeline in Bauplan, which seamlessly couples agent reasoning with all the desired guarantees for correctness and trust.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI",
        "cs.DB"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16402v1",
        "pdf": "https://arxiv.org/pdf/2511.16402v1"
      },
      "arxiv_id": "2511.16402v1",
      "comment": "AAAI26, pre-print of paper accepted at the Trustworthy Agentic AI Workshop",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16398v1",
      "title": "Collaborative Management for Chronic Diseases and Depression: A Double Heterogeneity-based Multi-Task Learning Method",
      "authors": [
        "Yidong Chai",
        "Haoxin Liu",
        "Jiaheng Xie",
        "Chaopeng Wang",
        "Xiao Fang"
      ],
      "abstract": "Wearable sensor technologies and deep learning are transforming healthcare management. Yet, most health sensing studies focus narrowly on physical chronic diseases. This overlooks the critical need for joint assessment of comorbid physical chronic diseases and depression, which is essential for collaborative chronic care. We conceptualize multi-disease assessment, including both physical diseases and depression, as a multi-task learning (MTL) problem, where each disease assessment is modeled as a task. This joint formulation leverages inter-disease relationships to improve accuracy, but it also introduces the challenge of double heterogeneity: chronic diseases differ in their manifestation (disease heterogeneity), and patients with the same disease show varied patterns (patient heterogeneity). To address these issues, we first adopt existing techniques and propose a base method. Given the limitations of the base method, we further propose an Advanced Double Heterogeneity-based Multi-Task Learning (ADH-MTL) method that improves the base method through three innovations: (1) group-level modeling to support new patient predictions, (2) a decomposition strategy to reduce model complexity, and (3) a Bayesian network that explicitly captures dependencies while balancing similarities and differences across model components. Empirical evaluations on real-world wearable sensor data demonstrate that ADH-MTL significantly outperforms existing baselines, and each of its innovations is shown to be effective. This study contributes to health information systems by offering a computational solution for integrated physical and mental healthcare and provides design principles for advancing collaborative chronic disease management across the pre-treatment, treatment, and post-treatment phases.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "primary_category": "cs.LG",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16398v1",
        "pdf": "https://arxiv.org/pdf/2511.16398v1"
      },
      "arxiv_id": "2511.16398v1",
      "comment": "",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16395v1",
      "title": "CorrectHDL: Agentic HDL Design with LLMs Leveraging High-Level Synthesis as Reference",
      "authors": [
        "Kangwei Xu",
        "Grace Li Zhang",
        "Ulf Schlichtmann",
        "Bing Li"
      ],
      "abstract": "Large Language Models (LLMs) have demonstrated remarkable potential in hardware front-end design using hardware description languages (HDLs). However, their inherent tendency toward hallucination often introduces functional errors into the generated HDL designs. To address this issue, we propose the framework CorrectHDL that leverages high-level synthesis (HLS) results as functional references to correct potential errors in LLM-generated HDL designs.The input to the proposed framework is a C/C++ program that specifies the target circuit's functionality. The program is provided to an LLM to directly generate an HDL design, whose syntax errors are repaired using a Retrieval-Augmented Generation (RAG) mechanism. The functional correctness of the LLM-generated circuit is iteratively improved by comparing its simulated behavior with an HLS reference design produced by conventional HLS tools, which ensures the functional correctness of the result but can lead to suboptimal area and power efficiency. Experimental results demonstrate that circuits generated by the proposed framework achieve significantly better area and power efficiency than conventional HLS designs and approach the quality of human-engineered circuits. Meanwhile, the correctness of the resulting HDL implementation is maintained, highlighting the effectiveness and potential of agentic HDL design leveraging the generative capabilities of LLMs and the rigor of traditional correctness-driven IC design flows.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.AI",
        "cs.PL",
        "cs.SE",
        "eess.SY"
      ],
      "primary_category": "cs.AI",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16395v1",
        "pdf": "https://arxiv.org/pdf/2511.16395v1"
      },
      "arxiv_id": "2511.16395v1",
      "comment": "7 pages, 15 figures, 2 tables",
      "journal_ref": "",
      "has_code": false
    },
    {
      "id": "2511.16390v1",
      "title": "Robot Metacognition: Decision Making with Confidence for Tool Invention",
      "authors": [
        "Ajith Anil Meera",
        "Poppy Collis",
        "Polina Arbuzova",
        "Abián Torres",
        "Paul F Kinghorn",
        "Ricardo Sanz",
        "Pablo Lanillos"
      ],
      "abstract": "Robots today often miss a key ingredient of truly intelligent behavior: the ability to reflect on their own cognitive processes and decisions. In humans, this self-monitoring or metacognition is crucial for learning, decision making and problem solving. For instance, they can evaluate how confident they are in performing a task, thus regulating their own behavior and allocating proper resources. Taking inspiration from neuroscience, we propose a robot metacognition architecture centered on confidence (a second-order judgment on decisions) and we demonstrate it on the use case of autonomous tool invention. We propose the use of confidence as a metacognitive measure within the robot decision making scheme. Confidence-informed robots can evaluate the reliability of their decisions, improving their robustness during real-world physical deployment. This form of robotic metacognition emphasizes embodied action monitoring as a means to achieve better informed decisions. We also highlight potential applications and research directions for robot metacognition.",
      "published": "2025-11-20",
      "updated": "2025-11-20",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "primary_category": "cs.RO",
      "links": {
        "paper": "http://arxiv.org/abs/2511.16390v1",
        "pdf": "https://arxiv.org/pdf/2511.16390v1"
      },
      "arxiv_id": "2511.16390v1",
      "comment": "under review",
      "journal_ref": "",
      "has_code": false
    }
  ]
}